package com.baglan.quizapp

import androidx.compose.foundation.BorderStroke
import androidx.compose.foundation.clickable
import androidx.compose.foundation.layout.*
import androidx.compose.foundation.rememberScrollState
import androidx.compose.foundation.verticalScroll
import androidx.compose.material3.*
import androidx.compose.runtime.*
import androidx.compose.ui.Alignment
import androidx.compose.ui.Modifier
import androidx.compose.ui.graphics.Color
import androidx.compose.ui.text.font.Font
import androidx.compose.ui.text.font.FontFamily
import androidx.compose.ui.tooling.preview.Preview
import androidx.compose.ui.unit.dp
import com.baglan.tarihtanbasy.R
import com.baglan.tarihtanbasy.screens.Whichquiz

interface Questions {
    val text: String
    val options: List<String>
}

data class Question(
    override val text: String,
    override val options: List<String>,
    val correctAnswerIndex: Int
) : Questions

data class Question2(
    override val text: String,
    override val options: List<String>,
    val correctAnswerIndex: Int,
    val correctAnswerIndex2: Int
) : Questions

val question1 = listOf(
    Question(
        "Мөде шаньюй бағындырған тайпалар:",
        listOf("Саян, Юечжи", "Қытай, Алтай, Саян", "Саян, Алтай, Жоғары Енесей", "Жоғары Енесей, Қытай"),
        2
    ),

    Question(
        "Б.з.б. 200 жылы ғұндарға қарсы жорықта қоршауға түскен қытай императоры:",
        listOf("У-Ди", "Гаоди", "Чжи-Чжи", "Аттила"),
        1
    ),

    Question(
        "Юечжилар мен ғұндардың арасындағы соңғы шайқас өткен уақыт:",
        listOf("Б.з.б. 200 ж", "Б.з.б. 133-127 жж", "Б.з.б. I ғасырдың ортасында", "Б.з.б. 165 ж"),
        3
    ),

    Question(
        "Ғұндардың жоғары билеушісі иеленген лауазым:",
        listOf("Тәңірқұты", "Патша", "Көсем", "Түменбасы"),
        0
    ),

    Question(
        "Ғұн мемлекетіндегі ру саны:",
        listOf("55", "65", "24", "12"),
        2
    ),

    Question(
        "Ғұндар оңтүстік және солтүстік болып екіге бөлінді:",
        listOf("Б.з.б. 200 жылы", "Б.з.б. 165 жылы", "Б.з.б II ғ басы", "Б.з.б I ғ ортасына дейін"),
        3
    ),

    Question(
        "Еуропаны Рим үстемдігінен азат еткен ғұн билеушісі:",
        listOf("Гаоди", "Мөде", "Аттила", "Чжи-Чжи"),
        2
    ),

    // ✅ Исправленный вопрос на соответствие
    Question(
        "Мемлекеттер мен ғұндарға қатысты тарихи оқиғаларды сәйкестендіріңіз:\n" +
                "1. Хань империясы\n" +
                "2. Рим империясы\n" +
                "3. Үйсін мемлекеті\n\n" +
                "А) Ғұндар ІҮ ғ ортасында Ұлы Даланы бойлай батысқа жорық жасап, осы елдің шекарасына жетті.\n" +
                "В) Б.з.б. 200 жылы осы елдің билеушісі Гаоди ғұндарға қарсы жорыққа шығады.\n" +
                "С) Олардың негізгі мекені Жетісу болды. Қытайлардан жеңілген ғұндар олардың жеріне кіріп, жеңіліске ұшырайды.",
        listOf("1-В, 2-А, 3-С", "1-А, 2-С, 3-В", "1-С, 2-А, 3-В"),
        0
    )
)
val question2 = listOf(
    Question("Қаңлылар өмір сүрді:",
        listOf("б.з.б. ІІІ", "б.з.б. ІІ", "б.з.б. І", "б.з.б. V"), 0),

    Question("Қаңлылардың орталық қаласы:",
        listOf("Сығанақ", "Құлата", "Шаш Илах", "Битянь"), 3),

    Question("Қаңлылар мекендеген аумақ:",
        listOf("Сырдың орта ағысынан Қаратау жоталарына дейін", "Жетісу", "Батыс Қазақстан", "Орталық Қазақстан"), 0),

    Question("Қаңлылардың жоғарғы билеушісінің лауазымы:",
        listOf("Хан", "Гуньмо", "Шанью", "Бек"), 0),

    Question("Қаңлылар б.з.б. 46-36 жж жорық жасады:",
        listOf("Үйсінге", "Ғұнға", "Қытайға", "Саққа"), 2),

    Question("Қаңлылар жақсы қарым-қатынас жасасты:",
        listOf("Үйсінмен", "Ғұнмен", "Қытаймен", "Скифпен"), 1),

    Question("Қаңлылардың Қауыншы мәдениеті орналасты:",
        listOf("Қуаңдария мен Жаңадарияда", "Сырдың орта ағысы мен Қаратау жоталарына дейін", "Ташкент төңірегінде", "Есіл бойы"), 2),

    Question("Қуаңдария мен Жаңадария аумағында қаңлылардың тараған мәдениеті:",
        listOf("Жетіасар", "Қауыншы", "Отырар Қаратау", "Сынтасты"), 0),

    Question("Темірді өңдеу мен балқыту ісі жақсы дамыған қаңлы мәдениеті:",
        listOf("Қауыншы", "Отырар Қаратау", "Жетіасар", "Шілікті"), 0),

    Question("20 қаладан тұратын кешен табылған қаңлы мәдениеті:",
        listOf("Қауыншы", "Жетіасар", "Отырар Қаратау", "Сынтасты"), 1)
)
val question3 = listOf(
    Question2("Сарматтар мекендеген аймақ:",
        listOf("Жетісу", "Батыс Қазақстан", "Шу мен Талас", "Еділ мен Жайық", "Сырдың орта ағысы"), 1, 3),

    Question("б.з.б. ІІІ ғасырда сарматтарды Ұлы Даланың батыс бөлігінен ығыстырған тайпа:",
        listOf("Аргиппей", "Дах-массагеттер", "Дайлар", "Аримаспы"), 1),

    Question("Сарматтар жөнінде жазбаған грек, рим тарихшылары:",
        listOf("Диадор", "Үлкен Плиний", "Арриан", "Полибий", "Полиэн"), 2),

    Question("Аршакидтер әулетінің негізін салған сармат тайпасы:",
        listOf("Роксолан", "Дайлар", "Алан", "Аорс"), 1),

    Question("Сарматтардың құрамына кірмейтін тайпа:",
        listOf("Роксолан", "Дайлар", "Сирак", "Алан", "Аорс"), 1),

    Question("Сарматтардың абыз әйелдері жерленген қорымы:",
        listOf("Сынтасты", "Сынтас", "Бесоба", "Аралтөбе"), 2),

    Question("Батыс Қазақстанда үш сармат жауынгері жерленген қорым:",
        listOf("Сынтасты", "Сынтас", "Бесоба", "Аралтөбе"), 1),

    Question("Көсемнің қару-жарағы, абыз асатаяғы табылған сармат ескерткіші:",
        listOf("Сынтасты", "Сынтас", "Бесоба", "Аралтөбе"), 3),

    Question("Аралтөбе ескерткіші табылған өңір:",
        listOf("Ақтөбе", "Маңғыстау", "Атырау", "Ақтау"), 2),

    Question("Бесоба қорымы орналасқан аумақ:",
        listOf("Ақтөбе", "Маңғыстау", "Атырау", "Ақтау"), 0),

    Question("Сармат қоғамында әскери-демократия қатысты болды:",
        listOf("Малшылар мен егіншілерге", "Қарапайым халыққа", "Ерлер мен әйелдерге", "Абыздар мен жауынгерлерге"), 2),

    Question("Сарматтардың өмірінде маңызы ерекше болды:",
        listOf("Жартылай көшпелі мал шаруашылығының", "Бау-бақша дақылдарын өсірудің", "Отырықшы шаруашылықтың", "Көшпелі мал шаруашылығының"), 3),

    Question("Ежелгі грек тарихшысы Геродоттың хабарлауынша сарматтардың тілі өте жақын тіл:",
        listOf("Түркі тілі", "Үнді-иран тіліне", "Скиф тіліне", "Аршакидтер тіліне"), 2),

    Question("Басқа көшпелі тайпаларға қарағанда әйелдердің қоғамдағы рөлі жоғары болған тайпа:",
        listOf("Сармат", "Аргиппей", "Сақ", "Скиф"), 0),

    Question("Амазонкалар туралы аңыз тараған тайпа:",
        listOf("Сармат", "Аргиппей", "Сақ", "Скиф"), 0)
)
val question4 = listOf(
    Question("Қазақстанның шығысындағы Андрон мәдениетімен туыстас, қатар өмір сүрген мәдениет:",
        listOf("Афанасьев мәдениеті", "Қарасұқ мәдениет", "Тағар мәдениеті", "Ұйық мәдениеті"), 0),

    Question("Шығыс Қазақстан мен Оңтүстік Сібір далаларындағы темірді игерген алғашқы мәдениет:",
        listOf("Қарасұқ мәдениеті", "Афанасьев мәдениеті", "Тағар мәдениеті", "Пазырық мәдениеті"), 1),

    Question("Б.з.б. ІІ мыңжылдықтың соңында Шығыс Қазақстан, Оңтүстік Сібір, Батыс Моңғолияда пайда болған мәдениет:",
        listOf("Қарасұқ мәдениеті", "Афанасьев мәдениеті", "Ұйық мәдениеті", "Тағар мәдениеті"), 0),

    Question("Андрон және Афанасьев мәдениеті Ұлы Даланың шығыс аймағынан келгендер мен жергілікті далалықтардың араласуынан пайда болған мәдениет:",
        listOf("Афанасьев мәдениеті", "Пазырық мәдениеті", "Ұйық мәдениеті", "Қарасұқ мәдениеті"), 3),

    Question("Қарасұқтықтардың шаруашылығы:",
        listOf("Таза көшпелі мал шаруашылығы", "Отырықшы шаруашылық", "Жартылай көшпелі мал шаруашылығы", "Отырықшы егін шаруашылығы"), 2),

    Question("Тақтатас қабір мәдениеті тараған мәдениет:",
        listOf("Афанасьев мәдениеті", "Пазырық мәдениеті", "Қарасұқ мәдениеті", "Ұйық мәдениеті"), 2),

    Question("Ерте темір дәуірінде Тува, Шығыс Алтай мен Солтүстік Батыс Моңғолия аумағында қалыптасқан мәдениет:",
        listOf("Афанасьев мәдениеті", "Қарасұқ мәдениет", "Ұйық мәдениеті", "Пазырық мәдениеті"), 2),

    Question2("Скиф-саққа тән \"аң стиліндегі\" түрлі алтын бұйымдар қазып алынған қорғандар:",
        listOf("І Аржан", "V Аржан", "Шілікті", "Есік" ), 0, 1),

    Question("Сақтар кезеңінде Оңтүстік Сібір далаларында өмір сүрген мәдениет:",
        listOf("Тағар мәдениеті", "Ұйық мәдениеті", "Пазырық мәдениеті", "Афанасьев мәдениеті"), 0),

    Question("Оңтүстік Сібірдің ежелгі мыс кендерінің басым бөлігін иеленгендер:",
        listOf("Афанасьевтер", "Тағарлықтар", "Пазырлықтар", "Ұйықтықтар"), 1),

    Question("Тағарлықтардың көршілес тайпалар арасында жоғары бағаланған тауары:",
        listOf("Алтын түсті қола", "Күміс", "Мыс", "Көмір"), 0),

    Question("Алтайдағы Пазырық мәдениетінің ерекшелігі:",
        listOf("Алтын түсті қоланы игеруі", "Әлемдегі алғашқы түкті кілемдерді жасауы", "Алғаш жылқыны көлік ретінде пайдалануы", "Арба үстіндегі үйді пайдалануы"), 1),

    Question("Пазырық кілемі сақтаулы тұрған қала:",
        listOf("Мәскеу", "Тува", "Түмен", "Санкт-Петербург"), 3),

    Question("Жерлеу ғұрыптарында далалықтарға тән салттар мен андрондықтарға тән жерлейтін орынды таспен қалау секілді ерекшеліктер көрініс беретін мәдениет:",
        listOf("Ұйық мәдениеті", "Пазырық мәдениеті", "Тағар мәдениеті", "Сапаллин мәдениеті"), 3)
)
val question5 = listOf(
    Question("Жетісудағы сақ жеріне б.з.б. ІІ ғ Орталық Азиядан келіп қоныстанған тайпа:",
        listOf("Сармат", "Ғұн", "Үйсін", "Қаңлы"), 2),

    Question("Ыстықкөл мен Іле өзенінің оңтүстік жағалауы аралығында орналасқан ежелгі үйсін қаласы:",
        listOf("Қызыл Аңғар", "Құлата", "Шаш-илақ", "Ақтас"), 0),

    Question("Үйсіндердің жоғарғы билеушісінің лауазымы:",
        listOf("Гуньмо", "Патша", "Күнби", "Тулы"), 0),

    Question("Үйсіндердің солтүстік-батысындағы көршілері:",
        listOf("Қаңлылар", "Ғұндар", "Сарматтар", "Сақтар"), 0),

    Question("Қола орақ табылған қорым:",
        listOf("Теңлік", "Ақтас", "Қарғалы", "Қызыл Аңғар"), 1),

    Question("Үйсіннің сәйгүлік мінген адам бейнеленген алтын қапсырма табылған қорым:",
        listOf("Қарғалы", "Ақтас", "Теңлік", "Қызыл Аңғар"), 2),

    Question("Қарғалы шатқалынан табылған назар аударарлық олжаның бірі:",
        listOf("Тәті диадема", "Алтын қапсырма", "Сырға", "Темір түйрегіш"), 0)
)
val question6 = listOf(
    Question("Б.з.б 3700-3100 жылдар аралығында өмір сүрген мәдениет:",
        listOf("Беғазы-Дәндібай", "Ботай-Терсек", "Андрон", "Көнешұңқырлы"), 1),

    Question("Қазақстан аумағындағы ежелгі археологиялық мәдениеттерді дәуірлермен сәйкестендіріңіз:\n" +
            "1) Беғазы-Дәндібай; 2) Тасмола; 3) Ботай-Терсек;\n" +
            "А) Ерте темір дәуірі; Ә) Қола дәуірі; Б) Энеолит дәуірі;",
        listOf("1- Ә; 2- А; 3-Б", "1- А; 2- Ә; 3- Б", "1- Б; 2-А; 3-Ә"), 0),

    Question("Жылқыны қолға үйрету басталды:",
        listOf("б.з.б. ІІІ мың жылдықта", "б.з.б. Ү мың жылдықта", "Б.з.б. ІІ мыңжылдықта", "Б.з.б. ІҮ мың жылдықта"), 3),

    Question("Б.з.б. ІІ мыңжылдықтың басында Ұлы Дала тұрғындары меңгерді:",
        listOf("Мыс қорытуды", "Темір қорытуды", "Қола қорытуды", "Күміс қорытуды"), 2),

    Question("Андрон ескерткіштерінің басым бөлігі кездесетін аймақ:",
        listOf("Оңтүстік Орал мен Орталық Қазақстан", "Оңтүстік Ресей мен Солтүстік Қазақстан",
            "Оңтүстік Орал мен Қазақстан", "Шығыс Қазақстан мен Орталық Қазақстан"), 2),

    Question2("Алғашқы қала үлгісіндегі қола дәуірінің тұрақтары:",
        listOf("Арқайым", "Андрон", "Сынтасты", "Беғазы", "Петров"), 0, 2),

    Question("Ең алғашқы қос доңғалақты әскери арба табылған қорым:",
        listOf("Андрон", "Сынтасты", "Петров", "Көнешұңқырлы"), 1),

    Question("Андрон тайпаларының аңыздары мен табынған құдайлары туралы айтылған шығарма:",
        listOf("Тарих", "Тарихи шежіре", "Авеста", "Үндістан"), 2),

    Question("Степняк, Айдабол, Тастыбұлақ тұрақтарынан табылған қола дәуірінің ескерткіші:",
        listOf("бота", "жылқы", "қос дөңгелекті арба", "айыл, жүген, тартпа"), 3),

    Question("Қола дәуірінде түйенің сүйектері табылған тұрақ:",
        listOf("Ақсу-Аюлы", "Алексеев", "Петровка", "Тастыбұлақ"), 1)
)
val question7 = listOf(
    Question("Түрік қағанаты құрылды:",
        listOf("VI ғасырдың соңында", "V ғасырдың ортасында", "IV ғасырда", "VI ғ. ортасында"), 3),

    Question("\"Түрік\" этнонимі бірінші рет деректерде кездеседі:",
        listOf("545 ж", "542 ж", "552 ж", "568 ж"), 1),

    Question("Түрік қолбасшысына қытай елшісі келген мерзім:",
        listOf("545 ж", "542 ж", "552 ж", "568 ж"), 0),

    Question("VI ғ ортасына дейін түріктер бағынышты болды:",
        listOf("Жужандарға", "Қытайға", "Юэчжилерге", "Дулуларға"), 0),

    Question2("552 жылы болған оқиға:",
        listOf("Жужандар талқандалды", "Қытайдың елшісі түрік ордасына келді", "Бумын елхан атағын алды", "Византияға елші жіберілді"), 0, 2),

    Question2("Түрік қағанатының билеушілері:",
        listOf("Бумын", "Иштеми", "Тардуш", "Білге"), 0, 1),

    Question("Жужандар түрік қағанатынан түпкілікті жеңілді:",
        listOf("Бумын қаған кезінде", "Мұқан қаған кезінде", "Иштеми қаған кезінде", "Тардуш"), 1),

    Question("568 жылы Византияға Түрік қағанатының елшілігін басқарып барды:",
        listOf("Маниах", "Тадо", "Замарх", "Мұқан"), 0),

    Question("VI ғ. 70 жылдары Түрік қағанатының алып жатқан территориясы:",
        listOf("Алтайдан Дунайға дейін", "Қаратаудан Батыс Моңғолияға дейін", "Алтайдан Хуанхе өзеніне дейін", "Манчжуриядан Босфорға дейін"), 3),

    Question2("VI ғ. 60 жылдары Түрік қағанаты өзара қарым-қатынас жасаған мемлекеттер:",
        listOf("Кавказ", "Иран", "Қытай", "Византия"), 1, 2)
)
val question8 = listOf(
    Question("Түргеш қағанаты VI ғасырда құрамында болды:",
        listOf("Батыс Түрік қағанатының", "Шығыс Түрік қағанатының", "Қарлұқ қағанатының", "Ұйғыр қағанаты"), 0),

    Question("Сары түргештер қоныстанған аймақ:",
        listOf("Іле өзені", "Қаратау аңғары", "Алатаудың бөктерінде", "Шу өзенінің бойында"), 3),

    Question("Қара түргештер мекендеді:",
        listOf("Іле аңғарында", "Шу бойында", "Қаратауда", "Алтай тауының бөктерінде"), 0),

    Question("704 жылы түргештер үстемдігін орнатты:",
        listOf("Сырдың орта ағысында", "Сырдың төменгі ағысында", "Шу мен Іле аралығында", "Жетісуда"), 3),

    Question("Түргеш қағанатының негізгі жер аумағы:",
        listOf("Жетісу", "Қаратау", "Алатау", "Сырдың орта ағысы"), 0),

    Question("Үшлік қағанның кіші ордасы орналасқан қала:",
        listOf("Суяб", "Күнгіт", "Битянь", "Мыңбұлақ"), 1),

    Question("Түргеш қағанаты бөлінген аймақ саны:",
        listOf("10", "3", "20", "5"), 2),

    Question("Сұлу қаған билік құрды:",
        listOf("716- 739", "710- 740", "715- 738", "704- 756"), 2),

    Question("Түргеш қағандығына батыстан қауіп төндірген мемлекет:",
        listOf("Шығыс Түрік қағанаты", "Қытай", "Батыс Түрік қағанаты", "Арабтар"), 3),

    Question("Сұлу қағанның ордасы көшірілген қала:",
        listOf("Суяб", "Мыңбұлақ", "Тараз", "Күнгіт"), 2),

    Question("Түркі- соғды одағы араб әскерлеріне соққы берді:",
        listOf("Суябта", "Күнгіт қаласында", "Бұхара түбінде", "Жетісуда"), 2),

    Question("Арабтардың Сұлу қағанға қойған лақап аты:",
        listOf("Сүзеген", "Батыр", "Ержүрек", "Қабанбай"), 0),

    Question("740 жылы Қытай әскерлері басып алған қала:",
        listOf("Тараз", "Суяб", "Күнгіт", "Атлах"), 0),

    Question("Араб және қытай әскерлері арасында үлкен шайқас өтті:",
        listOf("Суяб қаласында", "Атлах қаласында", "Күнгіт қаласында", "Мыңбұлақта"), 1),

    Question2("Атлах шайқасының тарихи маңызы:",
        listOf("Қытайлар Жетісудан қуылды", "Арабтар Орта Азияға шегінді", "Ислам тез тарала бастады", "Қытайлар түпкілікті жеңді"), 0, 3))
val question9 = listOf(
    Question("Оғыз мемлекетінің орталығы қай қала болған?",
        listOf("Баласұғын", "Суяб", "Янгикент", "Отырар"), 2),

    Question("Махмұд Қашқаридың мәліметі бойынша оғыздар қанша ру-тайпадан тұрған?",
        listOf("12", "18", "24", "36"), 2),

    Question("Оғыздар қандай екі топқа бөлінген?",
        listOf("Ақ орда және Көк орда", "Боз оқ және Үш оқ", "Қарахан және Салжұқ", "Көк түрік және Сары түрік"), 1),

    Question("Оғыз мемлекетінің жоғарғы билеушісі қалай аталған?",
        listOf("Хан", "Қаған", "Жабғу", "Бек"), 2),

    Question("965 жылы оғыздар Киев Русімен одақтасып, қай мемлекетті талқандады?",
        listOf("Хазар қағанаты", "Еділ Бұлғариясы", "Қыпшақ хандығы", "Салжұқтар"), 0),

    Question("Оғыз мемлекетінің соңғы билеушісі кім болған?",
        listOf("Білге қаған", "Шахмәлік жабғу", "Мұқан қаған", "Тоғрыл бек"), 1),

    Question("Оғыз мемлекетінің құлауына қандай факторлар әсер етті?",
        listOf("Салжұқтармен соғыс және ішкі көтерілістер", "Моңғолдардың шапқыншылығы", "Араб халифатының басып алуы", "Қытай империясының ықпалы"), 0),

    Question("ХІ ғасырдың ортасында оғыздардың орнын қандай халық басты?",
        listOf("Қыпшақтар", "Түргештер", "Ұйғырлар", "Қарлұқтар"), 0)
)
val question10 = listOf(
    Question2("Моңғолияның аумағында қалыптасқан ортағасырлық мемлекеттік бірлестіктер:",
        listOf("Найман", "Қарлұқ", "Өзбек", "Керейіт"), 0,4),

    Question2("1125 жылы Ляо империясы құлаған соң тәуелсіздігін алған елдер:",
        listOf("Найман", "Қарлұқ", "Жалайыр", "Өзбек", "Керейіт"),0,4),

    Question("VIII ғ. жазба деректерде Ертіс пен Орхон өзендері аралығында өмір сүрген тайпа:",
        listOf("Наймаандар", "Қарлұқтар", "Жалайырлар", "Керейіттер"), 0),

    Question("\"Найман\" сөзі білдіретін ұғым:",
        listOf("Алты", "Сегіз", "Тоғыз", "Үш"), 1),

    Question("Найман мемлекетінің орталығы:",
        listOf("Битөбе", "Суяб", "Балықты", "Мыңбұлақ"), 2),

    Question("Білгеден кейін Найман мемлекетінде билікке таласқан хандар:",
        listOf("Наркеш Дайын мен Бұйрық", "Бұйрық пен Күшлік", "Даян мен Күшлік", "Бұйрық пен Даян"), 3),

    Question2("1201 жылы Шыңғыс ханға қарсы топтасу үшін құрылтайға жиналған тайпалар:",
        listOf("Меркіт", "Қарлұқ", "Керейіт", "Қырғыз"), 0,4),

    Question2("Найман мемлекетіне қарсы одақтасқан елдер:",
        listOf("Жалайыр", "Керейіт", "Қарлұқ", "Моңғолдар", "Қырғыз"), 1,3),

    Question("1204 жылы Күшлік хан қоныс аударды:",
        listOf("Ертіс бойына", "Сыр өзені бойына", "Жайық бойына", "Жетісуға"), 3),

    Question("ХІІ ғ. Орхон өзенінен Хуанхэ өзеніне дейінгі жерлерді иеленген мемлекет:",
        listOf("Найман", "Жалайыр", "Керейіт", "Меркіт"), 2),

    Question("Керейіт мемлекетінің орталығы:",
        listOf("Балықты", "Битөбе", "Суяб", "Мыңбұлақ"), 1),

    Question("Керейіт мемлекеті осы хандардың тұсында күшейді:",
        listOf("Тоғрұл", "Инанч-Білге", "Бұйрық", "Маркус", "Құршақұз"), 4),

    Question("Шыңғысханның досы болған Ван хан аталған билеуші:",
        listOf("Маркуз", "Торы", "Құршақұз", "Мұқылай"), 1),

    Question("Шыңғыс ханның ант берген досы, кейін қас жауы болған:",
        listOf("Жамұқа", "Мұқылай", "Торы", "Даян"), 0),

    Question("Шыңғыс ханның ең жақын адамы, ақын, әрі батыр:",
        listOf("Жамұқа", "Мұқылай", "Торы", "Даян"), 0)
)
val question11 = listOf(
    Question("VII- VIII ғғ қыпшақтар:", listOf("Батыс Түрік қағанатының құрамында болды", "Қимақ қағанатының құрамында болды", "Дербес Қыпшақ хандығы құрылды", "Шығыс түрік қағанатының құрамында болды"), 0),
    Question("VIII- XI ғғ қыпшақтар:", listOf("Батыс Түрік қағанатының құрамында болды", "Қимақ қағанатының құрамында болды", "Дербес Қыпшақ хандығы құрылды", "Шығыс Түрік қағанатының құрамында болды"), 1),
    Question("ХІ ғ қыпшақтар аталған тайпалардың көптеген аймақтарын иеленді:", listOf("Оғыздар мен Хорезидіктердің", "Қимақтар мен славян тайпаларының", "Қарахандар мен Қимақтардың", "Оғыздар мен қимақтардың"), 3),
    Question("Қыпшақтардың Жайық өзені бойында орналасқан орталығы:", listOf("Сығанақ", "Суяб", "Сарайшық", "Күнгіт"), 2),
    Question("Қыпшақтар орыс дерегінде аталды:", listOf("Қыпшақтар", "Командар", "Половшылар", "Яланкуг"), 2),
    Question("Қыпшақтардың күшеюінен қауіптеніп, өзіне тәуелді етуге ұмтылған мемлекет:", listOf("Хорезм", "Славян тайпалары", "Қарахандар", "Қимақтар"), 0),
    Question("Хорезммен жақындануына байланысты қыпшақтар арасында ислам діні кең тарай бастаған уақыт:", listOf("ХІІІ ғ басы", "ХІІ ғ екінші жартысы", "ХІ ғ басы", "ХІ ғ ортасы"), 1),
    Question("Қыпшақтар мен Хорезм мемлекетінің Сыр бойындағы қалалар үшін қақтығысы тоқтатылды:", listOf("Қимақтардың жаулап алуымен", "Қарахандардың жорықтарымен", "Батыс Түріктердің қарсылығымен", "Маңғолдардың жаулап алуымен"), 3),
    Question("\"Дешт... түркі тілінде дала мағынасын білдіреді. Бұл далада арбамен ғана жүреді, ал ол алты айлық жолға созылады...\" деген дерек келдіреді:", listOf("Ибн Хордадбек", "Махмұд Қашқари", "Ибн Батута", "В.А.Пархоменко"), 2),
    Question("ІХ ғ ортасында Әмудария өзенінің арғы және бергі бетін мекендеген қыпшақ тайпалары мен оның 16 қаласы жайлы мәлімет келтірген:", listOf("Ибн Хордадбек", "Махмұд Қашқари", "Ибн Батута", "В.А.Пархоменко"), 0)
)
val question12 = listOf(
    Question("VIII- IX ғасырлар аралығында қимақ тайпалар одағы қалыптасты:", listOf("Солтүстік- Шығыс Қазақстан", "Сырдың орта ағысы", "Сырдың төмнгі ағысы", "Ертіс бойында"), 0),
    Question("Қимақ тайпасы өмір сүрген аймақ:", listOf("Шығыс Қазақстан", "Оңтүстік Қазақстан", "Батыс Моңғолия", "Солтүстік Қытай"), 2),
    Question("Тайпаның өз алдына бөлектенуі іске асты:", listOf("Түрік қағанаты құлаған соң", "Батыс Түрік қағанаты құлаған соң", "Шығыс Түрік қағанаты құлаған соң", "Түргеш қағанаты құлаған соң"), 1),
    Question("Қимақ тайпасының басшысы иеленген лауазым:", listOf("Хан", "Қаған", "Тәңірқұт", "Шад-түтік"), 3),
    Question("VII ғ ортасына қарай қимақтар көше бастады:", listOf("Жоңғар қақпасынан Шығыс Қазақстан аумағына", "Алтай таулары мен Ертіс өңіріне", "Еділ мен Жайық бойына", "Жетісуға"), 1),
    Question("Қимақ қағанатының ішіндегі саны жағынан көп тайпа:", listOf("Қыпшақтар", "Қарлұқтар", "Ұйғырлар", "Енесей қырғыздары"), 0),
    Question("Қимақ қағанының ордасы орналасты:", listOf("Жайық бойына", "Алтай бөктеріне", "Жетісуда", "Ертіс бойына"), 3),
    Question("Қимақтардың 16 қаласы туралы айтқан араб ғалымы:", listOf("Әл- Идриси", "Әл- Марвази", "Худуд әль- Алем", "Рузбихан"), 0),
    Question("Х ғ екінші жартысында қимақтардың жеріне шабуыл жасаған мемлекет:", listOf("Қыпшақ", "Ұйғыр", "Қарахан", "Қарлұқ"), 2),
    Question("Қимақ қағанаты өмір сүрді:", listOf("ІХ- XI", "VIII- IX", "VII- XI", "XI- XII"), 0)
)
val question13 = listOf(
    Question("756- 940 жылдары өмір сүрген мемлекет:", listOf("Түргеш", "Батыс Түрік", "Оғыз", "Қарлұқ"), 3),
    Question("Қарлұқ тайпаларының негізгі топтасып орналасқан жері:", listOf("Алтайдан Балқаш көліне дейін", "Жетісу жерінде", "Сырдың төменгі ағысында", "Еділ бойында"), 0),
    Question("VII ғасырдың соңында қарлұқтар ықпалында болған мемлекет:", listOf("Түрік қағанатының", "Батыс Түрік қағанатының", "Шығыс Түрік қағанатының", "Түргеш қағанатының"), 2),
    Question("Шығыс Түрік қағанатының билігін құлатқан тайпалар:", listOf("Ұйғырлар мен Оғыздар", "Ұйғырлар мен Қарлұқтар", "Оғыздар мен Қарлұқтар", "Түргештер мен Қарлұқтар"), 1),
    Question("744- 840 жж өмір сүрген мемлекет:", listOf("Қарлұқ қағанаты", "Оғыз мемлекеті", "Түргеш қағанаты", "Ұйғыр қағанаты"), 3),
    Question("Ұйғыр қағанатынан жеңілгеннен кейін қарлұқтар жылжыған аймақ:", listOf("Алтай тауының бөктеріне", "Жетісуға", "Сырдың төменгі ағысына", "Арал бойына"), 1),
    Question("Қарлұқ тайпаларының билеушілері иеленген лауазым:", listOf("Қаған", "Жабғу", "Патша", "Сюбашы"), 1),
    Question("Қарлұқтар осы мемлекетпен одақтасып, 840 жылы Ұйғыр қағанатын талқандады:", listOf("Енесей қырғыздарымен", "Хазарлармен", "Печенегтермен", "Түргештермен"), 0),
    Question("940 жылы Қарлұқ қағанатын талқандады:", listOf("Печенегтер", "Арабтар", "Енесей қырғыздары", "Қашқардың түрік билеушілері"), 3)
)


val question14 = listOf(
    Question("Қарахан мемлекеті құрылды:", listOf("IXғ", "Xғ", "XIғ", "XIIғ"), 1),
    Question("Қарахан мемлекетінің негізін қалаушы:", listOf("Қарахан", "Сатұқ Боғра хан", "Мұса Боғра хан", "Әли хан"), 1),
    Question("Қарахан мемлекетінің астанасы:", listOf("Суяб", "Баласағұн", "Тараз", "Ташкент"), 1),
    Question("Қарахан мемлекеті мен Газнауилер арасындағы шекара болған өзен:", listOf("Сырдария", "Іле", "Шу", "Талас"), 0),
    Question("Қарахан мемлекетінің батыстағы кіші қағанаттың ордасы:", listOf("Бұхара кейін Самарқан", "Сығанақ кейін Түркістан", "Сарай-Бату кейін Сарай Берке", "Қарақорым"), 0),
    Question("Қарахандықтарда дінбасыларының меншігі:", listOf("Харадж", "Санжақ", "Иқта", "Вакуф"), 3),
    Question("Қарахан мемлекетінің құрылуында басты рөл атқарған тайпа:", listOf("Қимақтар", "Қарлұқтар", "Оғыздар", "Қарақытайлар"), 1),
    Question("Қарахан мемлекеті екіге бөлінді:", listOf("Xғ 20ж", "XIғ 30ж соңы", "XIIғ 40ж соңы", "XIIIғ 50ж"), 1)
)

val question15 = listOf(
    Question("Қарақытай мемлекеті қашан өмір сүрді?", listOf("1000-1100 жж.", "1128-1212 жж.", "900-1000 жж.", "1200-1300 жж."), 1),
    Question("Қидандар қай ғасырда Орталық Азияның шығыс бөлігіндегі билікті басып алды?", listOf("VII ғ.", "VIII ғ.", "IX ғ.", "X ғ."), 2),
    Question("Қарақытай мемлекетінің негізін қалаған билеуші кім?", listOf("Күшлік", "Елюй Даши", "Мұхаммед Хорезмшах", "Тоныкөк"), 1),
    Question("Қарақытай мемлекетінің астанасы қай қала болды?", listOf("Отырар", "Баласағұн", "Самарқан", "Бұхара"), 1),
    Question("Жоғарғы билеуші қандай атаққа ие болды?", listOf("Қаған", "Хан", "Гурхан", "Сұлтан"), 2),
    Question("1141 жылы қарақытайлар кімдерді талқандады?", listOf("Наймандар", "Салжұқ-Қарахан әскерін", "Шыңғысхан әскерін", "Қыпшақтарды"), 1),
    Question("Қарақытай мемлекетінде билікке кімдер мұрагер бола алды?", listOf("Тек ерлер", "Тек ханзада ұлдары", "Ерлер мен әйелдер", "Тек әскери қолбасшылар"), 2),
    Question("Қарақытай мемлекетінде әр отбасынан қанша салық алынды?", listOf("1 динар", "10 динар", "5 динар", "100 динар"), 0),
    Question("Қарақытай мемлекетінің құлауына қандай оқиға әсер етті?", listOf("Шыңғысханның наймандарды ығыстыруы", "Орыс князьдерінің шабуылы", "Түрік қағанатының күшеюі", "Византияның жорығы"), 0),
    Question("Қарақытай мемлекеті қай жылы құлады?", listOf("1143 ж.", "1208 ж.", "1212 ж.", "1227 ж."), 2)
)

val question16 = listOf(    Question("Он оқ будун елі:", listOf("Түрік қағанаты", "Батыс Түрік қағанаты", "Шығыс Түрік қағанаты", "Түргеш"), 1),
    Question("Қытай деректерінде 100 мыңдық әскері бар 'он тайпа қағаны' аталған билеуші:", listOf("Мұқан", "Бумын", "Иштеми", "Тардуш"), 2),
    Question("Л.Гумилев жазуы бойынша Иштемиден кейін билікке келді:", listOf("Бумын", "Тон", "Тардуш", "Шегу"), 2),
    Question("Батыс Түрік қағанаты түпкілікті жеке мемлекетке айналды:", listOf("Иштеми қаған тұсында", "Тон қағанның тұсында", "Шегу қағанның тұсында", "Тардуш қағанның тұсында"), 3),
    Question("Батыс Түрік қағанатының саяси билігін күшейткен қағандар:", listOf("Шегу, Тон", "Шегу, Тардуш", "Ешбар Елтеріс, Тон", "Иштеми, Тардуш"), 0),
    Question("Батыс Түрік қағанатында 'он оқ будун' жүйесін енгізген:", listOf("Иштеми", "Тардуш", "Ешбар Елтеріс", "Тон-Ябғу"), 2),
    Question("Батыс Түрік қағанатының қысқы ордасы орналасқан өзен аңғары:", listOf("Шу", "Іле", "Сырдария", "Балқаш"), 0),
    Question("Батыс Түрік қағанатында сот істерін атқарушылар:", listOf("Ябғу", "Шад", "Бұйрықтар", "Елтебер"), 2),
    Question("Батыс Түрік қағанатының жазғы ордасы:", listOf("Суяб", "Мыңбұлақ", "Баласағұн", "Күлтегін"), 1),
    Question("682 жылы Моңғолияда өз мемлекетін қалпына келтірді:", listOf("Түрік қағанаты", "Батс Түрік қағанаты", "Түргеш қағанаты", "Шығыс Түрік қағанаты"), 3),
    Question("682 жылы Моңғолияда өз мемлекетін қалпына келтірген Шығыс Түрік қағанатының қағаны:", listOf("Құтлық", "Қапаған", "Білге", "Күлтегін"), 0),
    Question("Орталық Азияны бағындырған Шығыс Түрік қағанатының қағаны:", listOf("Құтлық", "Қапаған", "Білге", "Күлтегін"), 1),
    Question("Шығыс Түрік қағанаты қуатты мемлекетке айналдырған қаған:", listOf("Құтлық", "Қапаған", "Білге", "Күлтегін"), 1),
    Question("Қытаймен тиімді шартқа қол жеткізген Шығыс Түрік қағанатының билеушісі:", listOf("Қапаған", "Құтлық", "Білге", "Елтеріс"), 2),
    Question("744 жылы Шығыс Түрік қағанатын талқандады:", listOf("Түргештер мен Қарлұқтар", "Батыс Түріктер мен Түріктер", "Дунгандар мен Қарлұқтар", "Қарлұқтар мен Ұйғырлар"), 3)
)
val question17 = listOf(
    Question("Ноғай Ордасы қай мемлекеттің әлсіреуі нәтижесінде құрылды?",
        listOf("Қазақ хандығы", "Әмір Темір мемлекеті", "Алтын Орда және Ақ Орда", "Сібір хандығы"), 2),

    Question("Ноғай Ордасының орталығы қай қала болды?",
        listOf("Үргеніш", "Сарайшық", "Сығанақ", "Тараз"), 1),

    Question("Ноғай Ордасының атауы кімнің есімімен байланысты?",
        listOf("Тоғылық Темір", "Едіге", "Ноғай беклербек", "Қасым хан"), 2),

    Question("Ноғай Ордасының негізгі халқы қай тайпадан тұрды?",
        listOf("Дулат", "Қыпшақ", "Найман", "Маңғыт"), 3),

    Question("Ноғай Ордасының толықтай Алтын Ордадан оқшаулануы кімнің тұсында жүзеге асты?",
        listOf("Қасым хан", "Нұраддин", "Тоғылық Темір", "Көшім хан"), 1),

    Question("Сібір хандығының негізін қалаған хан:",
        listOf("Көшім хан", "Ибақ хан", "Бату хан", "Әбілқайыр хан"), 1),

    Question("Сібір хандығының алғашқы астанасы қай қала болды?",
        listOf("Сығанақ", "Чимги-Тура", "Сарайшық", "Қозыбас"), 1),

    Question("Көшім хан сыртқы саясатта қандай өзгерістер жасады?",
        listOf(
            "Қазақтармен одақ құрып, Ресеймен байланыс орнатты",
            "Орыс патшалығымен сауда қатынастарын дамытты",
            "Қазақ және ноғай жерлеріне жорықтар жасап, Ресеймен қарым-қатынасты үзді",
            "Монғолдармен бірігіп, Қытайға қарсы соғыс жүргізді"
        ), 2),

    Question("1581-1583 жылдары Сібір хандығына қарсы әскери жорықты кім басқарды?",
        listOf("Тоқтамыс хан", "Ермак атаман", "Қасым хан", "Жәнібек хан"), 1),

    Question("Сібір хандығының құлауының басты себебі:",
        listOf("Қазақ хандығының шабуылы", "Жоңғарлардың басып кіруі", "Орыс әскерлерінің шабуылы", "Қытай әскерлерінің жорығы"), 2)
)



val question18 = listOf(
    Question("Моғолстан мемлекеті қай ғасырларда өмір сүрді?",
        listOf("XIII-XIV ғғ.", "XIV-XVI ғғ.", "XV-XVII ғғ.", "XII-XV ғғ."), 1),

    Question("Моғолстан мемлекетінің алғашқы ханы кім болды?",
        listOf("Тоғылық Темір", "Қызыр Қожа", "Мұхаммед хан", "Ілияс Қожа"), 0),

    Question("Шағатай ұлысының басты қаласы қай қала болды?",
        listOf("Үрімші", "Самарқан", "Тараз", "Алмалық"), 3),

    Question("Кебек хан қандай реформалар жүргізді?",
        listOf("Қалаларды қиратып, көшпелі өмір салтын ұстанды", "Мемлекетті түмендерге бөлді", "Әскери жорықтар ұйымдастырды", "Сауда жолдарын жапты"), 1),

    Question("1365 жылғы «Батпақ» шайқасында кім Әмір Темірдің әскерін талқандады?",
        listOf("Тоғылық Темір", "Есенбұға", "Мұхаммед хан", "Ілияс Қожа"), 3),

    Question("Моғолстанның соңғы билеушісі қай аймаққа көшіп барып, жаңа мемлекет құрды?",
        listOf("Самарқан", "Бұхара", "Қашқария", "Ташкент"), 2),

    Question("Керей мен Жәнібек сұлтандар бастаған қазақтардың бір бөлігі қай уақытта Жетісуға көшіп келді?",
        listOf("XIV ғасырдың басында", "XV ғасырдың 50-жылдарының соңында", "XVI ғасырдың ортасында", "XIII ғасырдың аяғында"), 1),

    Question("Моғолстан мемлекетінің негізін қалауға ықпал еткен дулат тайпасының әмірі кім?",
        listOf("Қызыр Қожа", "Поладшы", "Есенбұға", "Мұхаммед хан"), 1),

    Question("Қай ханның билігі кезінде Моғолстан Әмір Темір ұрпақтарынан тәуелсіз болды?",
        listOf("Қызыр Қожа", "Мұхаммед хан", "Тоғылық Темір", "Ілияс Қожа"), 1)
)

val question19 = listOf(
    Question2("Моңғолдарға қарсылық білдіргені үшін толық жойылған қалалар?",
        listOf("Баласағұн", "Сығанақ", "Жент", "Отырар"), 1,  4), // Несколько правильных вариантов

    Question("Шыңғысханның Қазақстан мен Орта Азияға жорыққа шығуына сылтау болған оқиға?",
        listOf("Хорезмшахтар мемлекетінің билеушісі Мұхаммед билігінің әлсіреуі",
            "Моңғолиядағы жұт",
            "Отырар опаты",
            "«Суяб опаты»",
            "Жошы ханның өлімі"), 2),

    Question("Үгедей ұлысы?",
        listOf("Моңғолия жері",
            "Жетісудың солтүстік шығысы",
            "Ертістен Еділге дейін, Әмудария мен Сырдария",
            "Оңтүстік пен Оңтүстік шығыс Қазақстан, Орта Азия аумағы.",
            "Ертістен Дунайға дейінгі аумақ"), 1),

    Question("Шыңғыс хан қанша әскерімен Қазақстан аумағына жорық жасады?",
        listOf("200 мың әскерімен",
            "250 мың әскерімен",
            "300 мың әскерімен",
            "150 мың әскерімен",
            "450 мың әскерімен"), 3),

    Question("Қайырымды қала атағын алған қала?",
        listOf("Сығанақ", "Сарайшық", "Ашнас", "Отырар", "Баласағұн"), 4),

    Question("Моңғолдар аумағы толықтай басып алынды:",
        listOf("1218- 1224 жж",
            "1219- 1224 жж",
            "1218- 1222 жж",
            "1218- 1219 жж",
            "1217- 1224 жж"), 1),

    Question("Отырарды басып алуға аттанған Шыңғыс ханның ұлдары?",
        listOf("Төле мен Үгедей",
            "Жошы мен Шағатай",
            "Шағатай мен Үгедей",
            "Шағатай мен Төле",
            "Жошы мен Төле"), 2),

    Question("Моңғолдарда \"қабырға бұзғыш\", \"от лақтырғыш\" қарулары пайда болды?",
        listOf("Солтүстік Қытайды бағындырған соң",
            "Батыс Қыпшақтарды бағындырған соң",
            "Хорезмшахы Мұхаммедті бағындырған соң",
            "Отырарды күйреткен соң",
            "Сығанақты бағындырған соң"), 0)
)

val question20 = listOf(
    Question("Әмір Темір мемлекетінің территориясы?",
        listOf("Шығыс Дешті Қыпшақ аумағы", "Мауараннахр", "Шығыс Түркістан мен Жетісу", "Батыс Моңғолия"), 1),

    Question("Әмір Темірдің шығу тегі?",
        listOf("Түркіленген барлас руы", "Түркіленген байбақты руы", "Жошы әулеті", "Шағатай әулеті"), 0),

    Question("1370-1405 жж Орта Азияда билік құрды?",
        listOf("Әбілқайыр хан", "Тоғылық Темір", "Мұхаммед шайбани", "Әмір Темір"), 3),

    Question("Әмір Темірдің Тоқтамысты пайдаланудағы түпкі мақсаты?",
        listOf("Ақ Орданы да, Алтын Орданы да басып алу", "Моғолстанды басып алу", "Қытайға жорық жасау", "Үндістанды жаулап алу"), 0),

    Question("Әмір Темірдің Осман сұлтаны Баязидті жеңген жер?",
        listOf("Стамбул маңы", "Отырар маңы", "Анкара маңы", "Бодрумға жақын жерде"), 2),

    Question("Әмір Темірдің ұрпақтары билік құрды?",
        listOf("XV ғ", "XVI ғ басы", "XIV ғ соңы", "XVII ғ"), 1),

    Question("Әмір Темірді Еуропалықтар атады?",
        listOf("Темірлан", "Ақсақ Темір", "Мықты Темір", "Ержүрек Темір"), 0),

    Question("Әмір Темірдің Алтын Ордаға соңғы жорығы болған жыл?",
        listOf("1389 ж", "1391 ж", "1394 ж", "1395 ж"), 3)
)

val question21 = listOf(
    Question("Орда Ежен ұлысының атауы?",
        listOf("Алтын Орда", "Ақ Орда", "Моғолстан", "Мауараннахр"), 1),

    Question("Ақ Орданың күш-қуатын нығайтқан хан?",
        listOf("Шайбани", "Орда Ежен", "Ұрыс", "Мүбәрак"), 2),

    Question("1375-1376 жж Ұрыс хан басып алып, өз ақшасын шығара бастаған қала?",
        listOf("Сығанақ", "Сауран", "Сарайшық", "Түркістан"), 2),

    Question("Ұрыс хан тұсында Сырдария бойындағы астаналық қала?",
        listOf("Сарайшық", "Сығанақ", "Сауран", "Түркістан"), 1),

    Question("Әмір Темірдің көмегімен өзін Ақ Орда ханы деп жариялаған?",
        listOf("Тоқтамыс", "Ұрыс", "Түй Қожа", "Ілияс Қажа"), 0),

    Question("Тоқтамыс Темір Мәлікті жеңіп, Сығанақты басып алды?",
        listOf("1365", "1377", "1369", "1379"), 3),

    Question("1391 жылы Әмір Темір мен Тоқтамыс арасында шайқас болған жер?",
        listOf("Батпақ", "Құндызша", "Терек", "Сыр бойы"), 1),

    Question("Ақ Орданы әлсіреткен жағдай?",
        listOf("Шайбани ұрпақтарының жорықтары", "Ішкі талас", "Әмір Темір жорықтары", "Ойраттардың шабуылы"), 2),

    Question("Ақ Орданың соңғы ханы?",
        listOf("Барақ", "Ұрыс", "Мүбәрак", "Қызыр Қожа"), 0),

    Question("1428 жылы Ақ Орда ыдырап орнына құрылған мемлекет?",
        listOf("Моғолстан", "Әбілқайыр хандығы", "Ноғай Ордасы", "Қазақ хандығы"), 1)
)

val question22 = listOf(
    Question("Хақназар хан қай жылдары билік етті?",
        listOf("1511-1523", "1523-1538", "1538-1580", "1580-1600"), 2),

    Question("Хақназар хан Ноғай Ордасына жасаған жорықтарының нәтижесінде қандай аймақтарды Қазақ хандығына қосты?",
        listOf("Сырдария бойын", "Жетісу аймағын", "Аралдың солтүстік бойы мен Жайық жерін", "Ертіс өзені маңын"), 2),

    Question("Хақназар хан өзін қандай атақпен атады?",
        listOf("\"Қазақтар мен ноғайлардың ханы\"", "\"Түркілердің билеушісі\"", "\"Ұлы дала патшасы\"", "\"Дешті Қыпшақ әмірі\""), 0),

    Question("Хақназар хан қай мемлекет билеушісімен одақ құрды?",
        listOf("Осман империясы", "Мәскеу мемлекеті", "Моғолстан", "Шайбанилық Абдаллах"), 3),

    Question("Хақназар хан қай билеушімен дипломатиялық қарым-қатынас орнатты?",
        listOf("Абдулла хан", "Иван Грозный", "Ескендір хан", "Бабыр"), 1),

    Question("1579 жылы Хақназар ханның екі ұлы кімнің бұйрығымен өлтірілді?",
        listOf("Абдаллах ханның", "Баба сұлтанның", "Тәуекел ханның", "Бұйдаш ханның"), 1),

    Question("Хақназар ханның сыртқы саясатындағы басты мақсаты қандай болды?",
        listOf("Қазақ хандығының аумағын кеңейту", "Моғолстанды жаулап алу", "Қытаймен сауда қатынастарын нығайту", "Қазақтарды еуропалық державалармен таныстыру"), 0),

    Question("XVII ғасыр басындағы қай тарихшы Хақназар ханның ұрпағы бұдан былай хандық етпегенін жазған?",
        listOf("Қадырғали Жалайыр", "Мұхаммед Хайдар Дулати", "Рашид ад-Дин", "Ибн Рузбихан"), 0)
)

val question23 = listOf(
    Question("XVIII ғасырда билік жүргізген хандар:",
        listOf("Жәңгір, Тұрсын", "Тәуке, Абылай", "Жәңгір, Тәуке", "Есім, Жәңгір"), 1),

    Question("XVII ғ соңында қазақ хандығын басқарған хан:",
        listOf("Жәңгір", "Тұрсын", "Есім", "Тәуке"), 3),

    Question("1680-1715 жж билік құрған хан:",
        listOf("Тәуке", "Тәуекел", "Жәңгір", "Тұрсын"), 0),

    Question("Қазақ мемлекетінің 'Алтын ғасыры' аталған кезең:",
        listOf("Тәуке ханның билік құрған кезі", "Жәңгір ханның билік құрған кезі", "Есім ханның билік құрған кезі", "Тәуекел ханның билік құрған кезі"), 0),

    Question("Тәуке ханның тұсында кеңесші болған ұлы жүздің биі:",
        listOf("Майқы би", "Төле би", "Қазыбек би", "Әйтеке би"), 1),

    Question("'Жеті жарғы' заңдар жинағының негізі осы хандардың заңдар жобасы негізінде алынды:",
        listOf("Қасым, Есім", "Қасым, Жәңгір", "Тәуекел, Есім", "Шығай, Есім"), 0),

    Question("Күлтөбенің басында Тәуке хан қабылдаған заң:",
        listOf("Қасқа жол", "Ескі жол", "Жеті жарғы", "Ақтабан шұбырынды"), 2),

    Question("1710 жылы Қарақұмда жоңғарларға қарсы үш жүздің басын қосқан:",
        listOf("Есім", "Қасым", "Тәуекел", "Тәуке"), 3),

    Question("Тәуке ханның тұсындағы астана:",
        listOf("Сығанақ", "Түркістан", "Сарайшық", "Суяб"), 1),

    Question("Тәуке ханды ежелгі Спартаның ақылгөйі Ликургпен теңеген зерттеуші:",
        listOf("А.И.Левшин", "Б.Годунов", "Эссен", "Гирс"), 0)
)

val question24 = listOf(
    Question("Тәуекел хан қай жылдары билік етті?",
        listOf("1570-1582", "1582-1598", "1598-1613", "1565-1580"), 1),

    Question("Тәуекел хан 1582 жылы кіммен шайқасып, жеңіске жетті?",
        listOf("Абдаллах хан", "Баба сұлтан", "Көшім хан", "Қасым хан"), 1),

    Question("1583 жылы Тәуекел хан қай билеушінің ықпалынан кетуге шешім қабылдады?",
        listOf("Шайбанид Абдаллах ханның", "Мәскеу патшасы Федор Ивановичтің", "Моғолстан ханының", "Осман империясының сұлтанының"), 0),

    Question("Тәуекел ханның сыртқы саясатының басты бағыты қандай болды?",
        listOf("Қазақ хандығының аумағын Еуропаға дейін кеңейту",
            "Қалмақтармен достық қарым-қатынас орнату",
            "Сырдария бойындағы қалалар үшін күрес",
            "Қытаймен сауда қатынастарын нығайту"), 2),

    Question("1594 жылы Тәуекел хан қай елге елшілік жіберді?",
        listOf("Осман империясына", "Қытайға", "Мәскеу мемлекетіне", "Иранға"), 2),

    Question("Тәуекел хан Мәскеуге елшілік жіберудегі басты мақсаты қандай болды?",
        listOf("Қазақтарды православие дініне енгізу",
            "Оразмұхаммед сұлтанды тұтқыннан босату және әскери одақ құру",
            "Ресеймен сауда келісімін жасау",
            "Ресейден мал басын алу"), 1),

    Question("1597-1598 жылдары қай жерде қазақтар мен Бұхар әскері шайқасты?",
        listOf("Астрахань маңында", "Ташкент пен Самарқан арасында", "Жетісу аймағында", "Сарыарқада"), 1),

    Question("1598 жылы Тәуекел хан қай қалаларды басып алды?",
        listOf("Ташкент, Түркістан, Сайрам, Самарқан, Әндіжан",
            "Бұхара, Қоқан, Сығанақ, Отырар",
            "Батыс Сібір қалалары",
            "Қытайдың Шыңжаң аймағы"), 0),

    Question("Тәуекел хан қайтыс болғаннан кейін Қазақ хандығын кім басқарды?",
        listOf("Қасым хан", "Хақназар хан", "Есім хан", "Кенесары хан"), 2)
)

val question25 = listOf(
    Question("Бұрындық хан қай жылдары билік етті?", listOf("1458-1470", "1474-1511", "1509-1521", "1511-1523"), 1),
    Question("Бұрындық хан қандай тайпаларды біріктіре алды?", listOf("Маңғыт және ноғай тайпаларын", "Орталық Қазақстан мен Жетісу көшпелі тайпаларын", "Қыпшақ және оғыз тайпаларын", "Найман мен керей тайпаларын"), 1),
    Question("Қай тарихшы Бұрындық ханды ең мықты хан ретінде сипаттаған?", listOf("Мұхаммед Хайдар Дулати", "Рашид ад-Дин", "Ибн Рузбихан", "Әбілғазы"), 2),
    Question("Қасым хан қай ханның ұлы?", listOf("Керей ханның", "Бұрындық ханның", "Жәнібек ханның", "Әбілқайыр ханның"), 2),
    Question("Қасым хан алғашында қандай қызмет атқарды?", listOf("Бұрындық ханның атты әскер басшысы", "Жетісу уәлаятының билеушісі", "Әскербасы қолбасшы", "Орда биі"), 0),
    Question("Қай ғасырда Қасым хан билік етті?", listOf("XV ғасырдың ортасы", "XV ғасырдың соңы – XVI ғасырдың басы", "XVI ғасырдың ортасы", "XVI ғасырдың соңы"), 1),
    Question("Қасым хан Сырдария бойындағы қай қаланы соғыссыз алды?", listOf("Түркістан", "Сайрам", "Отырар", "Тараз"), 1),
    Question("Қасым хан тұсында Қазақ хандығы қай елдермен алғаш дипломатиялық байланыс орнатты?", listOf("Осман империясы мен Қытай", "Мәскеу мемлекеті мен Батыс Еуропа", "Иран мен Араб халифаты", "Үндістан мен Жапония"), 1),
    Question("Қасым ханның заңдар жинағы қалай аталды?", listOf("Жеті Жарғы", "Қасым ханның қасқа жолы", "Алтын орда заңдары", "Кодекс Куманикус"), 1),
    Question("Қасым хан тұсында Қазақ хандығының халқының саны қаншаға жетті?", listOf("500 мың", "1 миллион", "2 миллион", "3 миллион"), 1),
    Question("Қасым хан тұсында Қазақ хандығының негізгі қарсыластары кімдер болды?", listOf("Ноғай Ордасы мен Моғолстан", "Ресей мен Қытай", "Осман империясы мен Шайбани әулеті", "Қырым хандығы мен Иран"), 0),
    Question("Қасым ханның ішкі саясаттағы жетістіктері не жатпайды?", listOf(
        "Халық саны 1 млн ға жетті",
        "Хандықтың аумағы қазіргі Қазақстан жеріне жетті",
        "Қасым ханның заңдары шығарылды",
        "Қытаймен қарым-қатынас орнатты"
    ), 3)
)
val question26 = listOf(
    Question("Шығыс Дешті Қыпшақ пен Жетісу тұрғындарының топтасуы нәтижесінде құрылған бірлестік?",
        listOf("қазақ", "моғол", "өзбек", "ұйғыр"), 0),

    Question("Қазақ хандығында алғашқы хандық лауазымды иеленген?",
        listOf("Керей", "Жәнібек", "Бұрындық", "Есенбұға"), 0),

    Question("Қазақ хандығын құрған Керей мен Жәнібек тікелей ұрпағы болған Ақ Орда билеушісі?",
        listOf("Шайбани мен Барақ", "Есенбұға мен Ұрыс", "Барақ пен Ұрыс", "Әбілқайыр мен Барақ"), 2),

    Question("1450 жылдардың соңында Керей мен Жәнібек өздерінің қол астындағы халықпен бірге көшті?",
        listOf("Шығыс Дешті Қыпшаққа", "Жетісудың батысына", "Жетісудың солтүстік-шығысына", "Жайықтың төменгі ағысына"), 1),

    Question("Қазақ хандығының құрылуында басты рөл атқарған екі мемлекет?",
        listOf("Моғолстан мен Хорезм", "Бұхара мен Әбілқайыр", "Ақ Орда мен Иран", "Моғолстан мен Әбілқайыр"), 3),

    Question("М.Х.Дулатидің жазуы бойынша Қазақ хандығының құрылған мерзімі?",
        listOf("1459", "1465", "1470", "1469"), 1),

    Question("Керей мен Жәнібек бөлініп кеткен хандық?",
        listOf("Әбілқайыр хандығы", "Моғолстан", "Хорезм", "Иран"), 0),

    Question("Керей мен Жәнібек хандардың Өзбек хандығынан бөлініп кету себептері тұңғыш рет айтылған тарихи еңбек?",
        listOf("\"Диуани лұғат-ат-түрік\"", "\"Құдатғу білік\"", "\"Тарих-и Рашиди\"", "Шыңғыснама"), 2),

    Question2("Әбілқайыр хандығынан Керей мен Жәнібектің көшіп кету себебі?",
        listOf("Ойраттардан жеңілуі", "Моғолстанды жаулап алуы", "Ұлыс билеушілерінің артықшылығын шектеуі", "Хорезм мемлекетімен соғысы"), 0,  3),

    Question("Қазақ хандығының алғашқы территориясы?",
        listOf("Шу мен Талас өзендерінің маңы", "Сырдарияның төменгі ағысы", "Жетісудың солтүстік-шығысы", "Дешті Қыпшақ аймағы"), 0),

    Question("Әбілқайыр хандығынан 200 мың адамның Керей мен Жәнібекке келіп қосылуы жайында айтқан?",
        listOf("Махмуд ибн Уәли", "Ибн Рузбихан", "М.Х.Дулати", "Қадырғали Жалайри"), 2),

    Question("Әбілқайыр Жетіқұдық жеріне келіп, ауырып қайтыс болғандығын жазған тарихшы?",
        listOf("М.Х.Дулати", "Махмұд ибн Уәли", "Ибн Рузбихан", "Қ.Жалаири"), 1),

    Question("1474-1511 жж билік құрған хан?",
        listOf("Керей", "Жәнібек", "Қасым", "Бұрындық"), 3),

    Question("Бұрындық билігінің тарихи маңызы?",
        listOf("Жетісу мен Орталық Қазақстанның көшпелі тайпаларын біріктіре алды", "Сыр бойы қалаларын Қазақ хандығына қосты", "Жайық бойын Қазақ хандығына қосты", "Хорезм шахы Мұхаммедтің иеліктерін Қазақ хандығына қосты"), 0),

    Question("Бұрындық ханның басқа қазақ хандардан айырмашылығы?",
        listOf("Қазақ хандығының негізін қалады", "Қазақ хандығына Сыр бойы қалалары қосылуы", "Билікті өмірінің соңына дейін ұстай алмады", "Мұхаммед Шайбаниды өлтірді"), 2)
)

val question27 = listOf(
    Question("Қазақ қоғамы қандай екі негізгі топқа бөлінді?",
        listOf("Ақсүйек және қарасүйек", "Билер мен батырлар", "Хандар мен сұлтандар", "Шыңғыс хан ұрпақтары мен қарапайым халық"), 0),

    Question("Ақсүйек тобына кімдер жатты?",
        listOf("Шыңғыс хан ұрпақтары мен қожалар", "Билер мен батырлар", "Қарапайым халық", "Көшпенді малшылар"), 0),

    Question("Қарасүйек тобына кімдер жатты?",
        listOf("Хандар мен сұлтандар", "Билер мен батырлар", "Қожалар", "Тек қарапайым шаруалар"), 1),

    Question("Қазақ хандығындағы жоғарғы билік кімнің қолында болды?",
        listOf("Билер", "Сұлтандар", "Хан", "Батырлар"), 2),

    Question("Хан қандай маңызды шешімдер қабылдай алды?",
        listOf("Салық жинау, соғыс жариялау, бітім жасау", "Ауылдарды басқару", "Жүздерді құру", "Тек әскери істермен айналысу"), 0),

    Question("Қазақ қоғамында жыл сайын қандай жиын өткізілді?",
        listOf("Құрылтай", "Хан кеңесі", "Рулық кеңес", "Билер соты"), 0),

    Question("Құрылтайда қандай мәселелер шешілді?",
        listOf("Жерді бөлу, соғыс жариялау, бітім жасау", "Тек хан сайлау", "Салық жүйесін енгізу", "Шаруашылық мәселелерін қарастыру"), 0),

    Question("Ұлы жүз қай аумақты мекендеді?",
        listOf("Жетісу", "Сарыарқа", "Батыс Қазақстан", "Сырдария бойы"), 0)
)
val question28 = listOf(
    Question("Жәңгір хан қай жылдары билік етті?", listOf("1600-1629", "1629-1652", "1652-1670", "1643-1660"), 1),
    Question("Жәңгір хан жоңғарларға қарсы күресте кімнен көмек сұрады?", listOf("Қалмақтардан", "Қытай императорынан", "Самарқан билеушісі Жалаңтөстен", "Мәскеу патшасынан"), 2),
    Question("Жәңгір хан жоңғарларға қарсы күресте кіммен одақ құрды?", listOf("Моғолстанмен", "Қалмақтармен", "Қырғыздармен", "Шайбанилермен"), 2),
    Question("1643 жылы Жәңгір хан жоңғарлармен қандай шайқаста жеңіске жетті?", listOf("Аңырақай шайқасы", "Орбұлақ шайқасы", "Бұланты шайқасы", "Түркістан шайқасы"), 1),
    Question("Орбұлақ шайқасында Жәңгір хан қандай әскери әдісті қолданды?", listOf("Шабуыл жасау", "Қорғаныс тактикасы", "Оқ қарумен тау арасында ор қазу", "Көшпелі шабуыл"), 2),
    Question("Орбұлақ шайқасында Жәңгір хан қанша сарбазбен жасырынып күтті?", listOf("300", "500", "1000", "2000"), 0),
    Question("Орбұлақ шайқасында Жалаңтөс батыр Жәңгір ханға қанша сарбазбен көмекке келді?", listOf("5000", "10000", "15000", "20000"), 3),
    Question("Жәңгір хан қай елден әскери көмек алды?", listOf("Қытай", "Қашқар моңғолдары", "Ресей", "Осман империясы"), 1),
    Question("Орбұлақ шайқасының нәтижесі қандай болды?", listOf("Қазақ әскері жеңіліске ұшырады", "Жоңғарлар толықтай жойылды", "Жәңгір ханның әскері жеңіске жетті", "Жоңғарлар Қазақ хандығына қосылды"), 2)
)

val question29 = listOf(
    Question("Есім хан қай жылдары билік етті?", listOf("1570-1598", "1598-1628", "1628-1652", "1600-1635"), 1),
    Question("Есім ханды халық қалай атаған?", listOf("Қасқа жолды хан", "Еңсегей бойлы ер Есім", "Жарғы шығарушы", "Алдияр хан"), 1),
    Question("1603-1624 жылдары Есім хан кіммен соғысты?", listOf("Қалмақтармен", "Мәскеумен", "Бұхар хандығымен", "Қытаймен"), 2),
    Question("Есім ханның ордасы қай қалада орналасты?", listOf("Ташкент", "Түркістан", "Сайрам", "Отырар"), 1),
    Question("1613 жылы кім өзін Ташкенттің ханы деп жариялады?", listOf("Абдаллах хан", "Тұрсын сұлтан", "Батыр қонтайшы", "Көшім хан"), 1),
    Question("1627 жылы Тұрсын сұлтан қандай қадам жасады?", listOf("Қазақ хандығымен одақ құрды", "Түркістан қаласын басып алды", "Мәскеумен келісім жасады", "Қытаймен сауда байланысын күшейтті"), 1),
    Question("Тұрсын ханның жақтастары қай тайпаға жатты?", listOf("Қыпшақ", "Қатаған", "Найман", "Керей"), 1),
    Question("«Қатаған қырғыны» деген оқиға нені білдіреді?", listOf("Ойраттардың қазақтарға жасаған жорығы", "Есім ханның Тұрсын хан жақтастарын қатаң жазалауы", "Бұхар хандығының қазақтарға шабуылы", "Жоңғарлардың қазақтарды талқандауы"), 1),
    Question("Есім ханның заңдар жинағы қалай аталады?", listOf("Жеті Жарғы", "Қасым ханның қасқа жолы", "Есім ханның ескі жолы", "Шыңғыс хан заңдары"), 2)
)

val question30 = listOf(
    Question(
        "Азамат соғысы кезінде қалыптасқан экономикалық және саяси жүйе:",
        listOf("ЖЭС", "Әскери-коммунизм саясаты", "Индустрияландыру", "Тың игеру"), 1
    ),
    Question(
        "1921 жылы қуаңшылық болып, қырылған малдың пайызы:",
        listOf("80 пайыз", "90 пайыз", "50 пайыз", "60 пайыз"), 0
    ),
    Question(
        "1921-1922 жылдары аштық салдарынан Қазақстаннан тысқары жерге көшіп кеткен адам саны:",
        listOf("550 мыңға дейін", "550 мыңнан астам", "700 мыңға дейін", "700 мыңнан астам"), 3
    ),
    Question(
        "1921 жылғы қуаңшылық кезінде республика халқының аштыққа ұшыраған бөлігі:",
        listOf("1/4", "2/3", "1/3", "2/4"), 2
    ),
    Question(
        "ЖЭС бағыт алу қабылданды:",
        listOf("ІХ съезде", "ХІҮ съезде", "ХІІІ съезде", "Х съезде"), 3
    ),
    Question(
        "1921-1922 жылдары ЖЭС аясында жүргізілген шаралардың бірі:",
        listOf("Еңбек міндеткерлігі", "Азық-түлік салғырты", "Өнеркәсіпті национализациялау", "Жер-су реформасы"), 3
    ),
    Question(
        "Жер-су реформасының мәні:",
        listOf("Жерді жалға беру", "Жалдамалы еңбекті қолдану", "Еңбек міндеткерлігін жою", "Тартып алынған жерлерді қайтару"), 3
    ),
    Question(
        "Кедейлерге көмектесу үшін 1921 құрылған одақ:",
        listOf("Қосшы одағы", "Кедей одағы", "Жас қазақ одағы", "Талап"), 0
    ),
    Question(
        "ЖЭС кезінде 1924 жылдың 1 қаңтарынан бастап енгізілген салық түрі:",
        listOf("Шаңырақ салығы", "Түтін салығы", "Қарашығын салығы", "Ақшалай"), 3
    ),
    Question(
        "Индустрияландыруды бастау туралы шешім қабылданды:",
        listOf("ХІІІ съезінде", "ХҮ съезінде", "ХІҮ съезінде", "ХҮІ съезінде"), 2
    ),
    Question(
        "Орталық Қазақстанның минералдық шикізат байлықтарын зерттеген геологтар тобының жетекшісі:",
        listOf("И.М.Губкин", "Қ.Сәтбаев", "Ф.И.Голощекин", "Н.С.Курнаков"), 3
    ),
    Question(
        "Түркістан-Сібір темір жол құрылысы тұрақты пайдалануға берілді:",
        listOf("1932 жылы", "1933 жылы", "1931 жылы", "1930 жылы"), 2
    )
)
val question31 = listOf(
    Question(
        "«Сібір қазақтарының Жарғысы» қашан қабылданды",
        listOf("1822 ж.", "1824 ж.", "1826 ж.", "1828 ж."), 0
    ),
    Question(
        "1822 жылы «Сібір қазақтарының Жарғысының» басты мақсаты",
        listOf(
            "Суландыру жүйесін жүргізу",
            "Әкімшілік, сот, саяси жағынан басқаруды өзгерту",
            "Ауылдардың санын көбейту",
            "Мәдени орталықтардың санын көбейту"
        ), 1
    ),
    Question(
        "1822 жылғы «Сібір қазақтары Жарғысының» авторы",
        listOf("Радищев", "Эссен", "Янугиевский", "Сперанский"), 3
    ),
    Question(
        "«Сібір қазақтарының Жарғысы» бойынша ауыл старшындары сайланды",
        listOf("2 жылға", "3 жылға", "4 жылға", "5 жылға"), 1
    ),
    Question(
        "«Сібір қазақтарының Ережесі» бойынша мұрагерлік жолмен тағайындалған шен",
        listOf("Генерал-губернатор", "Ауыл старшыны", "Әскери губернатор", "Болыс сұлтаны"), 3
    ),
    Question(
        "«Орынбор қырғыздарының жарғысы» қашан қабылданды?",
        listOf("1822 ж.", "1824 ж.", "1826 ж.", "1828 ж."), 1
    ),
    Question(
        "Кіші жүздің соңғы ханы кім?",
        listOf("Уәли", "Бөкей", "Әбілқайыр", "Шерғазы"), 3
    ),
    Question(
        "«Орынбор қырғыздары жарғысының» авторы кім?",
        listOf("Сперанский", "І Александр", "Эссен", "Гирс"), 2
    ),
    Question(
        "Кіші жүздің аумағы бөлінді...",
        listOf("3", "4", "2", "6"), 0
    ),
    Question(
        "1822-1824 жж патша реформаларын бекітті:",
        listOf("ІІ Александр", "І Александр", "Гирс", "Сперанский"), 1
    )
)
val question32 = listOf(
    Question("Бөкей Ордасындағы көтеріліс қамтыды:", listOf("1783-1797 жж", "1837-1847 жж", "1836-1838 жж", "1822-1825 жж"), 2),
    Question2("И.Тайманұлы мен М.Өтемісұлы бастаған көтерілістің басты мақсаты:", listOf("Хан озбырлығына шек қою", "Елек өзені бойындағы жерлерді қайтарып алу", "Хандық билікті әлсірету", "Жер мәселесін шешу", "Жәңгір ханды жер аударту"), 0, 3),
    Question("21 жасында Беріш руының старшыны болып сайланды:", listOf("М.Өтемісұлы", "И.Тайманұлы", "С.Датұлы", "Ж.Тіленішұлы"), 1),
    Question2("М.Өтемісұлымен жақсы қарым-қатынаста болған орыс ғалымдары:", listOf("М.Сперанский", "Г.С.Кералин", "Н.Коншин", "А.Гейнс", "В.И.Даль"), 1, 4),
    Question("Бөкей Ордасында болған көтерілістің мақсаты айқын көрінеді:", listOf("И.Тайманұлының өлеңдерінен", "Ж.Тіленішұлының өлеңдерінен", "М.Өтемісұлының өлеңдерінен", "С.Қасымұлының өлеңдерінен"), 2),
    Question2("Бөкей Ордасындағы көтеріліс кезінде Жәңгір ханды қолдаған сыбайластары:", listOf("Қарауылқожа Бабажанұлы", "Балқы Құдайбергенұлы", "Ж.Тіленішұлы", "С.Қасымұлы", "Жүсіп батыр"), 0, 1),
    Question("И.Тайманұлы келіссөз жүргізген генерал-губернатор:", listOf("В.Перовский", "М.Сперанский", "Эссен", "Рукин"), 0),
    Question("1837 жылы 15 қарашада Исатай әскерімен жазалаушы отрядтар арасындағы шайқас өткен жер:", listOf("Елек өзені бойы", "Арал-Каспий аралығы", "Ақбұлақ", "Тастөбе"), 3),
    Question("Патша үкіметінің Исатайды ұстап берушіге белгіленген сыйдың мөлшері:", listOf("600 сом", "1000 сом", "2000 сом", "500 сом"), 1),
    Question("Исатай көтерілісін тездетіп басуға әсер еткен жағдай:", listOf("Ж.Тіленішұлының көтерілісінің басталуы", "Жүсіп батырдың көтерілісінің басталуы", "Саржан Қасымұлы көтерілісінің Кіші жүзді шарпуы", "Кенесары Қасымұлы көтерілісінің Кіші жүзді шарпуы"), 3),
    Question("И.Тайманұлы қаза тапқан соңғы шайқас мерзімі:", listOf("1838 жылы шілде", "1837 жылы шілде", "1838 жылы тамыз", "1837 жылы тамыз"), 0),
    Question("Исатай қаза тапқан шайқас:", listOf("Тастөбе", "Ақбұлақ", "Елек өзені", "Толыбай шатқалы"), 1),
    Question("Исатай мен Махамбет көтерілісін басуға басшылық еткен генерал-губернатор:", listOf("Эссен", "Перовский", "Сперанский", "Гейнс"), 1)
)
val question33 = listOf(
    Question("Қазақ даласын басқару жөніндегі ереженің жобасын дайындайтын 'далалық комиссия' құрылды:",
        listOf("XIX ғ. 60 ж.", "XIX ғ. 50 ж.", "ХХ ғ. 60 ж.", "ХХ ғ. 50 ж."), 0),

    Question("ХІХ ғасырдың 60 жылдарындағы реформаларды бекіткен Ресей императоры:",
        listOf("ІІ Александр", "І Александр", "І Павел", "І Екатерина"), 0),

    Question("XIX ғ. 60 жылдары Қазақ жерін басқару жүйесін өзгерту үшін құрылған «Дала комиссиясын» басқарған:",
        listOf("Ф.Гирс", "М.Гросс", "Сперанский", "Игельстром"), 0),

    Question("Әкімшілік басқару жүйесіне өз пікірлерін ұсынған қазақтың ағартушы - ғалымы:",
        listOf("Ш.Уәлиханов", "М.Тынышпаев", "Қ.Сәтбаев", "Ә.Марғұлан"), 0),

    Question("1867ж. 11 шілдеде ІІ Александр патша бекіткен ереже:",
        listOf("Сырдария мен Жетісу облыстарын басқару туралы Ереже",
            "Бөкей Ордасы мен Жетісу облыстарын басқару туралы Ереже",
            "Орал мен Торғай облыстарын басқару туралы Ереже",
            "Ақмола мен Семей облыстарын басқару туралы Ереже"), 0),

    Question("1867-1868 жылдардағы реформа бойынша Қазақстандағы облыстар саны:",
        listOf("Алты", "Жеті", "Үш", "Тоғыз"), 0),

    Question("1867-1868 жылдардағы реформа бойынша Орынбор генерал - губернаторлығының құрамына кірген облыстар:",
        listOf("Орал және Торғай", "Ақмола мен Семей", "Сырдария мен Жетісу", "Сырдария мен Қазалы"), 0),

    Question("1867-1868 жылғы Ережелерге сәйкес Иранмен, Қытаймен дипломатиялық келіссөз жүргізуге рұқсат берген әкімшілік:",
        listOf("Түркістан генерал - губернаторлығы", "Батыс Сібір генерал - губернаторлығы",
            "Орынбор генерал- губернаторлығы", "Сырдария генерал- губернаторлығы"), 0),

    Question("1867-1868 жылғы Ережеден кейін Қазақстанның Закаспий облысына өткен жері:",
        listOf("Маңғыстау приставтығы", "Қапал приставтығы", "Бөкей хандығы", "Сырдария облысы"), 0),

    Question("1867-1868 жылдардағы реформа негізінде Ресейдің Астрахан губерниясының құрамына қосылған жер:",
        listOf("Бөкей хандығының жері", "Жәңгір хандығының жері", "Сырдария облысы", "Маңғыстау аймағы"), 0),

    Question("Әкімшілік - аумақтық бөлініс бойынша бес буынды басқару жүйесін енгізген реформа:",
        listOf("1867-1868 жылдары", "1868-1869 жылдары", "1822 жылғы", "1824 жылғы"), 0),

    Question("1867-1868 жылғы Ереже бойынша полиция, әскери бөлімдер, уездегі мекемелер, бекіністер бағынды:",
        listOf("Ауылнай", "Болыс старшынына", "Уезд бастығына", "Генерал-губернаторға"), 2),

    Question("Ауыл старшындары мен болыстық қызметтерге үміткерлердің жасы кем болмауы шарт саналатын:",
        listOf("55", "35", "45", "25"), 3)
)
val question34 = listOf(
    Question("Қазақстанда 1916 жылғы көтерілістің басталуына себеп болды:",
        listOf("1916 ж. 12 маусымдығы Жарлық", "1916 ж. 25 маусымдығы Жарлық",
            "1916 ж. 18 шілдедегі Жарлық", "1916 ж. 25 шілдедегі Жарлық"), 1),

    Question("1916 жылғы 25 маусымдағы патша жарлығында:",
        listOf("19-43 жас аралығындағы қазақтарды тыл жұмысына алу",
            "12-25 жас аралығындағы қазақтарды тыл жұмысына алу",
            "18-35 жас аралығындағы қазақтарды тыл жұмысына алу",
            "40-50 жас аралығындағы қазақтарды тыл жұмысына алу"), 0),

    Question("1916 жылға оқиғалар қарсаңында Қазақстанда енгізілген салық түрі:",
        listOf("Көлік салығы", "Жер салығы", "Болыстық алым", "Соғыс салығы"), 3),

    Question("Патша Жарлығына қатысты қазақтың ұлттық либерал-демократиялық интеллигенциясының позициясы?",
        listOf("Қатал сынға ұшырады", "Ақылға қонымды ымыраға келу саясатын ұстанды",
            "Олар ешқандай ұстаным ұстанған жоқ", "Халық көтерілісіне себеп болды"), 1),

    Question("Тоқаш Бокин қай облыста көтеріліс басшысы болды?",
        listOf("Торғай", "Семей", "Ақмола", "Жетісу"), 3),

    Question("Түрмедегі уланған көтеріліс басшыларының бірін атаңыз.",
        listOf("А.Иманов", "Т.Бокин", "Б.Әшекеев", "Ж.Мәмбетов"), 3),

    Question("1916 жылғы көтерілістің негізгі қозғаушы күші:",
        listOf("Халық", "Патша үкіметі", "Отрядтар", "Жазалаушы әскер"), 0),

    Question("Патшалық Ресей не үшін қарапайым халықтан әскер жинамақ болды?",
        listOf("Қара жұмысқа, соның ішінде майданға окоп қазу үшін",
            "Мал бағуға", "Үй салуға", "Соғысқан әскерді емдеуге"), 0),

    Question("Көтеріліс болған жыл",
        listOf("1914", "1916", "1918", "2016"), 1),

    Question("Торғайдағы көтеріліс басшысы",
        listOf("Иманов", "Бокин", "Әшекеев", "Саурықов"), 0)
)
val question35 = listOf(
    Question("Ресейдің 1906-1917 жылдардағы заң шығарушы жоғары өкілетті органы?",
        listOf("Уақытша Үкімет", "Самодержавие", "Монархия", "Мемлекеттік Дума"), 3),

    Question("1916 жылы 15000-нан астам көтерілісші Жетісу қаласын қоршауға алды.",
        listOf("Ақиқат", "Жалған"), 1),

    Question("“Қазақ” газетінде жарияланған “Тағы соғыс” мақаласының авторы:",
        listOf("М.Дулатов", "А.Байтұрсынұлы", "Ә.Бөкейхан", "Т.Рысқұлов"), 2),

    Question("Социал-демократиялық большевиктер партиясын кім басқарды?",
        listOf("В.И.Ленин", "М.Шоқай", "Ә.Бөкейхан", "М.Сералин"), 0),

    Question("“Жас қазақ” ұйымы құрылған қала?",
        listOf("Ақмола", "Петропавл", "Ташкент", "Алматы"), 0),

    Question("1916 жылы А.Н.Куропаткиннің бұйрығы бойынша кімдер қара жұмыстан босатылды?",
        listOf("“Бұратаналардан” шыққан билік өкілдері", "Діни қызметкерлер",
            "Ақсүйектер", "Барлық жауап дұрыс"), 3),

    Question("1917 жылы ақпан революциясының нәтижесінде Уақытша үкімет билікке келді:",
        listOf("Ақиқат", "Жалған"), 0),

    Question("Таралымы 8 мың данаға жеткен газет?",
        listOf("Ұшқын", "Айқап", "Қазақ", "Серке"), 2),

    Question("Амангелді Иманов қай облыстағы көтерілісті басқарды?",
        listOf("Жетісу", "Ақмола", "Верный", "Торғай"), 3),

    Question("Тыл жұмысына тартылғандарды қайтару туралы шешім қашан қабылданды?",
        listOf("1917 ж", "1918 ж", "1919 ж", "1920 ж"), 0),

    Question("1917-1923 жылдардағы қазақтың тұңғыш ұлттық-демократиялық партиясы - Алаш партиясы болды.",
        listOf("Ақиқат", "Жалған"), 0),

    Question("1900 жылдан 1917 жылға дейін қазақ тілінде қанша кітап басылып шықты?",
        listOf("700-ден астам", "500-ден астам", "300-ге жуық", "400-ге жуық"), 3),

    Question("Бірінші орыс революциясы қашан болды?",
        listOf("1904-1905 жж", "1905-1907 жж", "1906-1907 жж", "1907-1908 жж"), 1)
)
val question36 = listOf(
    Question("Абылай хан өмір сүрді:",
        listOf("1711-1781", "1718-1783", "1715-1785", "1714-1781"), 0),

    Question("Абылай хан билік құрды:",
        listOf("1768-1785", "1772-1781", "1771-1781", "1711-1782"), 2),

    Question("Абылайдың азан шақырып қойған аты:",
        listOf("Әбілқасым", "Әбілмәмбет", "Сабалақ", "Әбілмансұр"), 3),

    Question("Шыққан тегін жасыру мақсатында Абылайды атады:",
        listOf("Сылдырмақ", "Сабалақ", "Бақташы", "Қойшы"), 1),

    Question("Қай жылы патша үкіметі Әбілмәмбетті тақтан тайдырып, Абылайға хандық таққа отыруын ұсынды?",
        listOf("1759", "1757", "1758", "1755"), 0),

    Question("Абылай ханның кеңесшісі болған жырау:",
        listOf("Бұхар жырау", "Үмбетей жырау", "Тәтіқара", "Шалкиіз"), 0),

    Question("Орта жүздің ханы Әбілмәмбет пен Абылай сұлтан Ресей бодандығына өтті:",
        listOf("1740", "1750", "1745", "1741"), 0),

    Question("Абылай ханның тұсында тату-тәтті қарым-қатынас жасаған елі:",
        listOf("Қытай", "Бұхар", "Ресей", "Жоңғар"), 2),

    Question("Абылай сұлтан жоңғар тұтқынында болды:",
        listOf("1743-1745", "1742-1743", "1745-1748", "1741-1743"), 3),

    Question("1771 жылы қалмақтардың 180 мың жауынгеріне, Абылай жорық жасады:",
        listOf("50 мың жауынгерімен", "60 мың жауынгерімен", "70 мың жауынгерімен", "30 мың жауынгерімен"), 0),

    Question("Қазақтар мен қалмақтар арасында болған 1771 жылғы шайқас:",
        listOf("'Орбұлақ'", "'Аңырақай'", "'Шаңды жорық'", "'Қалмақ қырылған'"), 2),

    Question2("1767 жылы Абылайдың Қытаймен келіссөз жүргізу нәтижесінде, қазақтарға қайтарылған жерлер:",
        listOf("Алтай бойы", "Тарбағатай аймағы", "Сырдың орта ағысы", "Іле өзені бойы"), 1,3),

    Question("Абылай ханға байланысты дұрыс дәйекті анықтаңыз:\n" +
            "І. Қазақ жеріндегі патша үкіметінің бекіністерін жойды;\n" +
            "ІІ. 1756 жылы Қытай үкіметімен дипломатиялық байланыс орнатты;\n" +
            "ІІІ. 1771 жылы Еділ қалмақтарымен сауда байланыс орнатты;\n" +
            "ІV. Қытайдан Тарбағатай мен Іле өзені бойындағы жерлерді қайтарып алды;",
        listOf("І,ІІ", "ІІ,ІV", "ІІІ,ІІ", "ІІІ,ІV"), 1)
)
val question37 = listOf(
    Question("«Алаш» партиясының І съезі қашан өтті?",
        listOf("1905 ж. желтоқсан", "1906 ж. ақпан", "1913 ж. қазан", "1917 ж. шілде"), 0),

    Question("«Алаш» партиясының көшбасшылары кімдер болды?",
        listOf("Ә.Бөкейханов, А.Байтұрсынов", "М.Дулатов, С.Сейфуллин",
            "Т.Рысқұлов, А.Асфендияров", "Ж.Аймауытов, Ш.Құдайбердіұлы"), 0),

    Question("«Алаш» партиясының басты мақсаты қандай болды?",
        listOf("Қазақстанды толық тәуелсіз ел ету", "Кеңес үкіметін қолдау",
            "Қазақ автономиясын құру", "Орыс шаруаларын Қазақстанға қоныстандыру"), 2),

    Question("«Алаш» партиясының бағдарламасы қанша бөлімнен тұрды?",
        listOf("5", "7", "10", "12"), 2),

    Question("«Алаш» автономиясының орталығы қай қала болды?",
        listOf("Орынбор", "Семей", "Ақмола", "Ташкент"), 1),

    Question("«Қазақ» газеті қай жылдан бастап жұмыс істей бастады?",
        listOf("1905 ж.", "1913 ж.", "1917 ж.", "1920 ж."), 1),

    Question("Алаш автономиясы құрамына қай облыстар кірді?",
        listOf("Бөкей ордасы, Орал, Торғай, Ақмола, Семей", "Жетісу, Сырдария, Түркістан",
            "Қостанай, Павлодар, Ақтөбе", "Маңғыстау, Қызылорда, Атырау"), 0),

    Question("Алашорда үкіметінің уақытша халықтық кеңесі қанша адамнан тұрды?",
        listOf("15", "20", "25", "30"), 2),

    Question("Алашорда үкіметі қай съезде жарияланды?",
        listOf("ІІ Жалпықазақ съезі", "І Жалпықазақ съезі",
            "Бүкілтүркістандық ІҮ съезі", "Мұсылмандар құрылтайы"), 0),

    Question("Қай қайраткер Алаш партиясына мүше болмады?",
        listOf("Бөкейханов", "М. Дулатов", "М. Тынышбаев", "Х. Ғаббасов", "Т. Рысқұлов"), 4),

    Question("Алашорда үкіметінің төрағасы кім?",
        listOf("Х. Ғаббасов", "Т. Рысқұлов", "М. Тынышбаев", "Ә. Бөкейханов"), 3),

    Question("Қазақ автономиясы идеясын қай партия ұсынды?",
        listOf("Алаш", "Кадеттер", "Социал-демократиялық", "Коммунистік"), 0),

    Question("«Алаш» үкіметін тарату туралы жарлық қай жылы шықты?",
        listOf("1922 жылы 9 наурызда", "1920 жылы 9 наурызда",
            "1922 жылы 9 наурызда", "1917 жылы 9 наурызда"), 1)
)
val question38 = listOf(
    Question("Кенесары Қасымұлы бастаған көтеріліс:",
        listOf("1836-1838ж", "1783-1797ж", "1837-1847ж", "1773-1775ж"), 2),

    Question("Кенесары әскерінің жеке отрядың басқарған белгілі батырлар:",
        listOf("Ағыбай,Иман,Бұқарбай", "Жоламан Тіленішұлы,Есет Көтібарұлы",
            "Қарынбай Зындағұлұлы,Еріш Азаматұлы", "Мұрат Құлшоранұлы,Қарасай"), 0),

    Question("1838 жылы Кенесары Қасымұлы бастаған ұлт азаттық қозғалысқа қатысқан сарбаздар қай бекіністі өртеді:",
        listOf("Орал", "Созақ", "Жаңақорған", "Ақмола"), 3),

    Question("1847 жылы қырғыз жеріндегі шайқаста Кенесарыдан бөлініп кеткен Ұлы жүздің сұлтаны:",
        listOf("Манап", "Долгов", "Айшуақ", "Рүстем"), 3),

    Question("Кенесары көтерілісі кезіндегі орыс патшасы:",
        listOf("I Петр", "Игельстром", "I Николай", "Пушкин"), 2),

    Question("Кенесарының соңғы шайқасы өткен жер:",
        listOf("Жетісу", "Ташкент", "Майтөбе", "Ақмола"), 2),

    Question("Кенесары хандық билікті қалпына келтірді:",
        listOf("1841", "1837", "1845", "1842"), 0),

    Question("Кенесары Қасымұлы Сарыарқаны тастап қоныс аударды:",
        listOf("Жетісу", "Алаш", "Түркістан", "Бұқар"), 0),

    Question("1844 жылы Кенесары Қасымұлына қарсы соғыста мерт болған сұлтандар саны:",
        listOf("44", "52", "35", "20"), 0),

    Question("1843 жылы I Николай Кенесары көтерілісін басу үшін жіберген старшина:",
        listOf("Лебедов", "Перемышельский", "Паллас", "Рычков"), 0),

    Question("1844 жылы Кенесары Қасымұлына қарсы шыққан отрядты басқарған сұлтан:",
        listOf("Лебедов", "Николай", "Ахмет Жантөреұлы", "Жоламан Тіленшіұлы"), 2),

    Question("1837 жылы Кенесары бастаған көтеріліс басталды:",
        listOf("Ақмола бекінісін өртеуден", "Петропавлдан Ташкентке бет алған сауда керуеніне шабуыл жасаумен",
            "Қырғыздарға жорық жасаудан", "Орал казак әскерінің зорлық-зомбылығынан"), 1),

    Question("Ақмола бекінісіне шабуыл кезінде қаза тапқан жауынгерлер саны:",
        listOf("154", "255", "225", "145"), 2),

    Question("Кенесарының атасы:",
        listOf("Абылай", "Қасым", "Тәуке", "Жәңгір"), 0),

    Question("\"Кенесарыға көзсіз ерлік тән\" деген:",
        listOf("Л.Майер", "Достоевский", "М.Қашғари", "Геродот"), 0)
)
val question39 = listOf(
    Question("Тың игеру жүргізілген облыстар:",
        listOf("Павлодар, Ақмола, Көкшетау, Қостанай, Солтүстік Қазақстан, Ақтөбе",
            "Павлодар, Ақмола, Көкшетау, Қостанай, Солтүстік Қазақстан, Қарағанды",
            "Павлодар, Ақмола, Көкшетау, Қостанай, Солтүстік Қазақстан, Торғай",
            "Павлодар, Ақмола, Көкшетау, Қостанай, Солтүстік Қазақстан, Атырау"), 2),

    Question("Тың және тыңайған жерлерді игеру туралы шешім қабылданды:",
        listOf("1953 ж.", "1954 ж.", "1947 ж.", "1943 ж."), 1),

    Question("Карточка жүйесі жойылды:",
        listOf("1953 ж.", "1954 ж.", "1947 ж.", "1943 ж."), 2),

    Question("Соғыстан кейінгі жылдарда ақша реформасы жүргізілді:",
        listOf("1943 ж.", "1947 ж.", "1946 ж.", "1953 ж."), 1),

    Question("Сталин қайтыс болды:",
        listOf("1953 ж.", "1946 ж.", "1943 ж.", "1954 ж."), 0),

    Question("1946 жылы маусымда құрылды:",
        listOf("КСРО ҒА-ның Қазақ филиалы", "КСРО Ғылым академиясы",
            "Алматы педагогикалық институты", "Қазақ КСР Ғылым академиясы"), 3),

    Question("Минералды шикізаттар мен кен орындарының табиғатта таралу заңдылықтарын ашып, металлогендік және болжамдық карта жасағаны үшін Лениндік сыйлық берілген ғалымдардың бірі:",
        listOf("Қ.Сәтбаев", "М.Айтхожин", "М.Әуезов", "А.Қонаев"), 0),

    Question("Қазақстанда 1961 жылы шаңырақ көтерген институт:",
        listOf("Қазақ КСР Ғылым академиясының Тіл білімі, әдебиет және өнер институты",
            "Қазақ КСР Ғылым академиясының Философия және құқық институты",
            "Қазақ Мемлекеттік институты", "Қарағанды педагогикалық институты"), 0),

    Question("Қазақстанда 1958 жылы құрылған институт:",
        listOf("Алматы педагогикалық институты", "Қазақ Мемлекеттік институты",
            "Қарағанды педагогикалық институты", "Қазақ КСР Ғылым академиясының Философия және құқық институты"), 3),

    Question("«Қазақ КСР тарихының» екі томдығы жарияланды:",
        listOf("1943-1945 жылдары", "1945-1947 жылдары", "1957-1959 жылдары", "1965-1967 жылдары"), 2),

    Question("Соғыстан кейінгі жылдары көшпелілердің қола дәуіріндегі тарихы мен мәдениетін зерттеген:",
        listOf("Ә.Марғұлан", "М.Айтхожин", "М.Әуезов", "Д.Қонаев"), 0),

    Question("М.Әуезов «Абай» романының екі кітабын жазып бітірді:",
        listOf("1945 жылы", "1960 жылы", "1950 жылы", "1947 жылы"), 3),

    Question("КОКП XX сьезінен кейін ақталған, әділетсіз жазаға ұшыраған аса көрнекті әдебиетшілер:",
        listOf("М.Жұмабаев, Ж.Аймауытов, М.Дулатов",
            "М.Әуезов, С.Мұқанов, Ә.Әбішев",
            "С.Сейфуллин, І.Жансүгіров, Б.Майлин",
            "Ә.Марғұлан, М.Айтхожин, А.Байтұрсынов"), 2),

    Question("1960 жылдардың ортасынан бастап 80 жылдардың ортасына дейінгі мерзімнің шартты атауы:",
        listOf("«Тоқырау жылдары»", "«Индустрияландыру жылдары»",
            "«Ұжымдастыру жылдары»", "«Ұлы нәубет жылдары»"), 0),

    Question("Тың игерушілер барар жеріне дейін тегін көшірілді және әр отбасына көрсетілді:",
        listOf("500-1000 сом көмек", "500-600 сом көмек", "300-400 сом көмек", "400-500 сом көмек"), 0)
)
val question40 = listOf(
    Question("Соғыстан кейінгі жылы ақша реформасы жүргізілді:",
        listOf("1944 ж", "1946 ж", "1947 ж", "1948 ж"), 2),

    Question2("ҰОС кейін республикада жұмысшы күшінің жетіспеушілігін жою үшін арттырылған жұмыстар:",
        listOf("Ақша реформасы енгізілді", "Карточкалық жүйе енгізілді", "Еңбек резервтері мектептері құрылды",
            "Азық- түлікті өлшеп берді", "Жұмысшылар дайындайтын училищелер ашылды"), 2, 4),

    Question("Кеңес билігі тұсында еңбекшілердің мүддесін қорғаған ұйым:",
        listOf("Кәсіподақ ұйымы", "Жоғарғы кеңес", "Кәсіпшілер одағы", "Комсомол"), 2),

    Question("Кеңес одағы тұсында балалар ұйымы:",
        listOf("Комсомол", "Кәсіподақ", "Жоғарғы кеңес", "Пионер"), 3),

    Question("Қазақстанда 1950 жылдары қаржының ең көп бөлігі бөлінген өндіріс саласы:",
        listOf("Жеңіл өнеркәсіп", "Тамақ өнеркәсібі", "Ауыр өнеркәсіп", "Су станциясын құру"), 2),

    Question("1947 жылы өзінің алғашқы өнімін берген өнеркәсіп орны:",
        listOf("Семей май зауыты", "Өскемен қорғасын- мырыш комбинаты",
            "Петропавлдағы тігін фабрикасы", "Жамбыл тері зауыты"), 1),

    Question("ҰОС кейінгі жылдары республиканың батысында іске қосылған мұнай кәсіпшілігі:",
        listOf("Семей", "Ембі", "Қызылорда", "Орал"), 1),

    Question("ХХ ғ 50 жылдары Сібір, Орал, Орталық Азияны металлмен қамтамасыз еткен комбинат:",
        listOf("Мойынты- Шу", "Семей", "Ембі", "Қарағанды"), 3),

    Question("Семей полигонында алғашқы атомдық жарылыс болды:",
        listOf("1949 жылы 29 тамыз", "1950 жылы 30 шілде",
            "1954 жылы 21 тамыз", "1963 жылы 23 шілде"), 0),

    Question("Батыс Қазақстандағы атом сынақ алаңы:",
        listOf("Семей", "Невада", "Капустин Яр", "Өскемен"), 2),

    Question("Семей ядролық полигонындағы сынақтардың жалпы саны:",
        listOf("455", "457", "458", "456"), 3),

    Question("1959-1965 жж жетіжылдық жоспар қабылданды:",
        listOf("КОКП ХІҮ съезінде", "КОКП ХХІ съезінде", "КОКП ХХ съезінде", "КОКП ХХІІІ съезінде"), 1),

    Question("Әлемнің елдері ҒТР дәуіріне енді:",
        listOf("1950 жж ІІ жартысында", "1960 жж ІІ жартысында",
            "1970 жж ІІ жартысында", "1940 жж ІІ жартысында"), 0)
)
val question41 = listOf(
    Question("С.Датұлы бастаған көтеріліс болған жылдар",
        listOf("1773-1775", "1783-1797", "1836-1838", "1837-1847"), 1),

    Question("С.Датұлы қай рудан шыққан",
        listOf("Байұлы", "Шекті", "Байбақты", "Беріш"), 2),

    Question("С.Датұлы көтерілісі кезінде Кіші жүздің ханы",
        listOf("Әбілқайыр", "Нұралы", "Айшуақ", "Абылай"), 1),

    Question("1784 жылы Орынбор өлкесінің басшысы болып кім тағайындалды",
        listOf("Сперанский", "Эссен", "Колпаковский", "Игельстром"), 3),

    Question("Игельстром реформасының мәні",
        listOf("Ералы ханды тақтан тайдыру", "Хандық кеңес құру",
            "Хандық билікті жою", "Билікке Сырымды отырғызу"), 2),

    Question("Нұралы ханнан кейін болған Кіші жүздің ханы",
        listOf("Есім", "Ералы", "Айшуақ", "Барақ"), 1),

    Question("Нұралы хан 1786 жылы қай қалаға жер аударылды",
        listOf("Қазан", "Уфа", "Сібір", "Орынбор"), 1),

    Question("Сырым Датұлы көтерілісінің себептерінен қатесін тап",
        listOf("Еділ, Дон казактарының озбырлығы", "Жер",
            "1778 жылы Сырымның отбасының қайтыс болуы", "Уәли ханның озбырлығы"), 3),

    Question("1791-1794 жылдары Кіші жүздің ханы",
        listOf("Нұралы", "Ералы", "Есім", "Айшуақ"), 2),

    Question("С.Датұлы көтерілісі кезінде хан сарайына шабуыл қашан болды",
        listOf("1797", "1783", "1775", "1801"), 0),

    Question("С.Датұлы көтерілісі қамтыған қазақ жері",
        listOf("Ұлы жүз", "Орта жүз", "Кіші жүз", "Орта және Кіші жүз"), 2),

    Question("С.Датұлының лақап аты",
        listOf("Сабалақ", "Бала би", "Жиренше шешен", "Ер Төстік"), 1),

    Question("С.Датұлының қызметі",
        listOf("Ақсақал", "Сұлтан", "Старшын", "жауынгер"), 2),

    Question("1797 жылы Кіші жүз ханы болып кім тағайындалды",
        listOf("Ералы", "Есім", "Сырым", "Айшуақ"), 3),

    Question("С.Датұлы көтерілісінің нәтижесі",
        listOf("Ешқандай", "Жайықтың оң жағына көшуге рұқсат берді",
            "Салық мөлшері азайды", "Халықтың өмірі жақсарды"), 1)
)
val question42 = listOf(
    Question("1985 жылы КОКП Орталық Комитетінің қандай бағыты жарияланды?",
        listOf("Индустриализация", "Жеделдету", "Социалистік қайта құру", "Экономикалық реформалар"), 1),

    Question("«Қайта құру» саясаты қай жылы ресми түрде басталды?",
        listOf("1985 ж", "1987 ж", "1990 ж", "1989 ж"), 0),

    Question("Желтоқсан оқиғасы қай күні басталды?",
        listOf("16 желтоқсан 1986 ж", "17 желтоқсан 1985 ж", "25 қазан 1990 ж", "1 желтоқсан 1991 ж"), 0),

    Question("Желтоқсан оқиғасы кезінде неше адам сотталды?",
        listOf("150", "99", "50", "200"), 1),

    Question("Қазақ КСР-нің Мемлекеттік егемендігі туралы Декларация қай күні қабылданды?",
        listOf("25 қазан 1990 ж", "16 желтоқсан 1991 ж", "30 тамыз 1995 ж", "1 желтоқсан 1991 ж"), 0),

    Question("Қазақстанның тәуелсіздігі қашан жарияланды?",
        listOf("10 желтоқсан 1991 ж", "16 желтоқсан 1991 ж", "1 желтоқсан 1991 ж", "4 маусым 1992 ж"), 1),

    Question("Қазақстанның тәуелсіздігін ең алғаш қай мемлекет мойындады?",
        listOf("АҚШ", "Қытай", "Түркия", "Ресей"), 2),

    Question("Қазақстан Республикасының жаңа атауы қай күні бекітілді?",
        listOf("10 желтоқсан 1991 ж", "25 қазан 1990 ж", "4 маусым 1992 ж", "16 желтоқсан 1991 ж"), 0),

    Question("ҚР-ның мемлекеттік Туы мен Елтаңбасы қашан бекітілді?",
        listOf("25 қазан 1990 ж", "16 желтоқсан 1991 ж", "4 маусым 1992 ж", "1 желтоқсан 1991 ж"), 2),

    Question("1991 жылы 17 желтоқсанда Қазақстан тәуелсіздігін қандай ел мойындады?",
        listOf("АҚШ", "Ресей", "Қытай", "Ұлыбритания"), 0),

    Question("Қазақстан қай жылы Ислам конференциясына толық мүше болды?",
        listOf("1991 ж", "1993 ж", "1995 ж", "1997 ж"), 2),

    Question("Қазақстанның Семей ядролық полигонын жабу туралы жарлығы қай жылы шықты?",
        listOf("1989 ж", "1991 ж", "1992 ж", "1994 ж"), 1),

    Question("Қазақстан қай жылы Атом энергиясы жөніндегі халықаралық агенттікке (МАГАТЭ) мүше болды?",
        listOf("1991 ж", "1992 ж", "1994 ж", "1995 ж"), 2),

    Question("Қазақстан қай жылы Мемлекеттік алтын қорын жинауды бастады?",
        listOf("1991 ж", "1992 ж", "1993 ж", "1994 ж"), 1)
)
val question43 = listOf(
    Question2("1867-1868 жылдардағы реформаның ауыртпалығына байланысты көтерілістер болған жерлер:",
        listOf("Орал", "Ақмола", "Түркістан", "Маңғыстау"), 0, 4),

    Question("Отарлық езгіге қарсы Орал Торғай облыстарында көтерілістер болды:",
        listOf("1867-1868 жж", "1868-1869 жж", "1870 жыл", "1870-1871 жж"), 1),

    Question2("1868-1869 жылдардағы көтерілістің себептері:",
        listOf("Елек қорғанысын казак әскерлерінің иемденуі", "Жайықтың оң жағына өтуге рұқсат бермеуі",
            "Жаңа бекіністердің салынуы", "Салықтың көбеюі", "Қазақтарды жер аударуы"), 2, 3),

    Question("Орал, Торғай көтерілісшілері мен фон Штемпель басқарған жазалаушы әскері арасында шайқас өткен жер:",
        listOf("Бозащы жерінде", "Жайықтың оң жағалауында", "Бөкей Ордасында", "Жамансай жерінде"), 3),

    Question("1869 жылы фон Штемпельдің әскеріне шабуыл жасаған көтерілісшілердің саны:",
        listOf("2000 қол", "200 қол", "20 000 қол", "150 000 қол"), 2),

    Question("Орал, Торғай көтерілісін жаншуға жіберілген жазалаушы отрядты басқарған подполковник:",
        listOf("Штемпель", "Калпоковский", "Рукин", "Гаспринский"), 2),

    Question("Орал, Торғайдағы халық көтерілісін басқарғандар:",
        listOf("Ақсүйектер", "Сұлтандар", "Шаруалар", "Ру басылары"), 3),

    Question("1867-1868 жылғы Жаңа Ереже енгізілгеннен кейін Маңғыстау түбегіндегі адайларда қатты шиеленісіп кетті:",
        listOf("Салық жинау мәселесі", "Мал шаруашылығы", "Жер мәселесі", "Шекара мәселесі"), 2),

    Question("1870 жылы Маңғыстауда көтеріліске шыққан ру:",
        listOf("Табын", "Адай", "Төре", "Алшын"), 1),

    Question2("1870 жылы Маңғыстаудағы көтерілістің басшылары:",
        listOf("Досан Тәжіұлы", "Жанқожа Нұрмұхаммедұлы", "Тіленішұлы", "Датұлы", "Иса Тіленбайұлы"), 0, 4),

    Question("Маңғыстау көтерілісі кезінде көтерілісшілер қарулы қол жинаған жер:",
        listOf("Жамансай", "Бозашы", "Орал", "Ойыл"), 1),

    Question("Маңғыстау көтерілісі кезінде көтерілісшілерден жеңіліп, өзін-өзі атып өлтірген жазалаушы отряд басшысы:",
        listOf("Штемпель", "Калпоковский", "Рукин", "Гирсс"), 2),

    Question("1870 жылы сәуір айында көтерілісшілер шабуыл жасады:",
        listOf("Жамансай деген жерде фон Штемпель отрядына", "Ережені қабылдауға рұқсат берген ақсүйектердің ауылына",
            "Александровск фортына", "Бозашы деген жерде Рукин отрядына"), 2),

    Question("Маңғыстау көтерілісі кезіндегі Александровск фортына шабуыл кезіндегі көтерілісшілердің саны:",
        listOf("10 мың", "20 мың", "5 мың", "15 мың"), 0),

    Question("1870 жылы адайлар соғыс шығыны ретіндегі өткізген мал саны:",
        listOf("90 мың қой", "90 мың жылқы", "90 мың ірі қара", "90 мың түйе"), 0)
)
val question44 = listOf(
    Question("Түркістан автономиясы неше күн өмір сүрді?",
        listOf("21 күн", "33 күн", "64 күн", "100 күн"), 2),

    Question("Қоқанда IV Төтенше жалпымұсылмандық съезд қай жылы өтеді?",
        listOf("1922 жылы 26-29 қараша", "1920 жылы 26-29 қараша", "1919 жылы 26-29 қараша", "1917 жылы 26-29 қараша"), 3),

    Question("Автономия - ?",
        listOf("Белгілі бір дінге жататындығын ұғынуға құрылған ұжымдық өзіндік сана түрі",
            "Өзін-өзі басқару, іс-әрекеттер еркіндігі",
            "Мемлекеттер арасындағы соғыс",
            "Революцияға қарама-қарсы құрылған ұйым"), 1),

    Question("Түркістан автономиясы қашан құрылды?",
        listOf("1918 жылы қаңтарда", "1917 жылы қарашада", "1920 жылы қазан айында", "1919 жылы шілде"), 1),

    Question2("Түркістан автономиясының алғашқы жетекшілері кім болды?",
        listOf("М.Шоқай", "Ә.Бөкейханов", "М.Тынышбаев", "С.Меңдешев"), 0, 2),

    Question("1918 жылы Қоқан қаласына қай жақтан жазалаушы отряд жіберілді?",
        listOf("Алматыдан", "Мәскеуден", "Ташкенттен", "Самарқандтан"), 2),

    Question("Түркістан автономиясын жою кезінде шамамен қанша бейбіт тұрғын қаза тапты?",
        listOf("5 мың", "10 мың", "15 мың", "20 мың"), 1),

    Question("Қазақ АКСР-нің алғашқы астанасы қай қала болды?",
        listOf("Алматы", "Ақмешіт", "Орынбор", "Ташкент"), 2),

    Question("Қазақ АКСР-нің жер аумағы алғашында қанша шаршы версті құрады?",
        listOf("1 500 000", "1 871 239", "2 500 000", "3 000 000"), 1),

    Question("1925 жылы Қазақ АКСР-нің қай съезінде «қазақ» атауы қалпына келтірілді?",
        listOf("ІІ", "ІІІ", "IV", "V"), 3),

    Question("1921 жылы Қазақстанның батысы мен солтүстігінде не болды?",
        listOf("Қазақ АКСР-нің құрылуы", "Шегаралық межелеу", "Ашаршылық", "Түркістан автономиясының жойылуы"), 1),

    Question("1926 жылғы халық санағы бойынша қазақтардың үлесі қанша пайыз болды?",
        listOf("55,2%", "60%", "61,3%", "65%"), 2)
)
val question45 = listOf(
    Question("Ресейдің Шығыспен сауда қатынасын өрістету үшін Қазақстанды 'Кілт және қақпа' деп атаған патша:",
        listOf("І Петр", "ІІ Екатерина", "Анна Иоановна", "ІІ Александр"), 0),

    Question("1716 жылы И.Д.Бухгольц отряды негізін қалаған бекініс:",
        listOf("Жәміш", "Семей", "Омбы", "Өскемен"), 2),

    Question("1716 жылы салынған бекіністер:",
        listOf("Жәміш, Омбы", "Өскемен, Семей", "Коряков, Өскемен", "Железинск, Омбы"), 0),

    Question("1717 жылы Железинск бекінісі салынды:",
        listOf("Ертіс бойына", "Жайық бойына", "Еділ бойына", "Ертістің оң жағалауына"), 3),

    Question("1714-1720 жылы патша үкіметінің Ертіс бойына әскери бекіністер салудағы басты мақсаты:",
        listOf("Қазақ өлкесін біртіндеп жаулап алу", "Сауда қарым-қатынасын дамыту", "Мал шаруашылығын дамыту", "Су торабын салу"), 0),

    Question("XVIII ғ. 20 жылдары Жайық өзенінің бойындағы жерлер үшін күрескен хан:",
        listOf("Қайып", "Нұралы", "Әбілқайыр", "Әбілмәмбет"), 2),

    Question("'Жайық өзені қашан сарқылып, арнасы кеуіп қалғанша қазақтар оның бойынан кетпейді' деген сөзді айтқан хан:",
        listOf("Әбілқайыр", "Қайып", "Нұралы", "Әбілмәмбет"), 0),

    Question("'Ертіс бойындағы бекіністер шебі осылай құрылды. Оның міндеті - оң жағалаудағы жерлерді жоңғарлардан, ал одан соң көп ұзамай қырғыздардан (қазақтардан) қорғау еді' деген сөзді айтқан орыс зерттеушісі:",
        listOf("И.Д.Бухгольц", "Г.Миллер", "Н.Коншин", "П.Паллас"), 2),

    Question("1723-1724 жж Еділ мен Жайық арасындағы бүкіл аумақты басып алған хан:",
        listOf("Әбілқайыр", "Қайып", "Нұралы", "Әбілмәмбет"), 0),

    Question("XVIII ғ. 30 жылдарында Қазақстанмен дипломатиялық байланыс жасаған ел:",
        listOf("Жоңғар хандығы", "Ресей", "Бұхар хандығы", "Хиуа"), 1),

    Question("Кіші жүзді Ресейдің қол астына алу ұсынысын қабылдаған патша:",
        listOf("ІІ Александр", "І Петр", "Анна Иоановна", "Иван Грозный"), 2),

    Question2("1730 жылы Ресейге жіберілген қазақ елшілігі:",
        listOf("Нұралы", "Қойдағұлұлы", "Т.Шайымов", "Қоштайұлы"), 1, 3),

    Question("'Қырғыз-қайсақ' экспедициясы қай жылы ұйымдастырылды?",
        listOf("1730", "1731", "1734", "1748"), 2)
)
val question46 = listOf(
    Question("1723 ж Цеван Рабдан қазақтарға қарсы барлық күшті жұмсауына не ықпал етті?",
        listOf("Цин императоры Канси өлімі", "Қазақстанның оңтүстігіне Қоқан хандығының шабуылы", "Қазақ даласының жеке дара қалуы", "Ресейдің қазақтарды қолдаудан бас тартуы"), 0),

    Question("Жоңғарлардың Ташкент пен Түркістанды басып алуы?",
        listOf("1724-1725", "1725-1726", "1824-1825", "1722-1723"), 0),

    Question("Біріккен қазақ жасағын құру мақсатындағы 'Қарақұм' құрылтайы өткізілді:",
        listOf("1721 ж", "1723 ж", "1710 ж", "1727 ж"), 2),

    Question("'Ақтабан Шұбырынды, Алқакөл сұлама' аталған жылдар",
        listOf("1723-1727 ж", "1724-1727 ж", "1723-1827 ж", "1724-1725 ж"), 0),

    Question("Жоңғар шапқыншылығынан қатты ойрандалған",
        listOf("Түркістан", "Жетісу", "Ордабасы", "Қарасиыр"), 1),

    Question("Ордабасыда бүкілхалықтық құрылтай өткен мерзім:",
        listOf("1726 жыл", "1728 жыл", "1730 жыл", "1724 жыл"), 0),

    Question("Бұланты шайқасы болған жыл:",
        listOf("1728", "1726", "1730", "1729"), 0),

    Question("Аңырақай түбінде барлық жасақтарға көшбасшылық жасаған",
        listOf("Абылай", "Әбілмәмбет", "Батыр","Әбілқайыр"), 3),

    Question("Аңырақай шайқасы болған жыл",
        listOf("1730", "1728", "1726", "1711"), 0),

    Question("'Ақтабан Шұбырынды' жылдары жоңғарлардан ығысқан Орта жүздің бірқатар рулары ойысты:",
        listOf("Маңғыстауға", "Самарқанға", "Жайық бойына", "Тобыл маңына"), 1),

    Question("'Ақтабан Шұбырынды' жылдары қайғы-қасіреттен туған ән",
        listOf("'Заман-ай'", "'Қайран елім'", "'Туған жер'", "'Елім-ай'"), 3),

    Question("Тарихи оқиғалардың хронологиялық ретін анықтаңыз:\n\n1) Қарақұм құрылтайының өтуі;\n\n2) Жоңғар хандығының құрылуы;\n\n3) 'Ақтабан шұбырынды, Алқакөл сұлама' кезеңінің басталуы;\n\n4) Абылайдың жоңғар тұтқынына түсуі;",
        listOf("2,1,3,4", "1,2,3,4", "3,1,2,4", "2,1,4,3"), 0),

    Question("Тарихи оқиғалардың хронологиялық ретін анықтаңыз:\n\n1) Аңырақай шайқасы\n\n2) Бұланты шайқасы\n\n3) Аягөз шайқасы",
        listOf("2,1,3", "3,1,2", "3,2,1", "2,3,1"), 2)
)
val question47 = listOf(
    Question("ҰОС қатысқан Қазақстандықтардың саны:",
        listOf("1 млн 238 мың", "1 млн 200 мың", "1 млн 390 мың", "1 млн 230 мың"), 1),

    Question("Генерал-майор И.В.Панфилов басқарған 316 атқыштар дивизиясы ерлікпен шайқасты:",
        listOf("Мәскеу үшін", "Ленинград үшін", "Сталинград үшін", "Еділ бойы үшін"), 0),

    Question("316-шы атқыштар дивизиясы кейін гвардиялық дивизия болып қайта жасақталды:",
        listOf("8-ші гвардиялық дивизия", "74-ші гвардиялық дивизия", "79-шы гвардиялық дивизия", "9-шы гвардиялық дивизия"), 0),

    Question("1990 жылы 11 желтоқсанда Кеңес Одағының Батыры атағы берілді:",
        listOf("М.Мәметоваға", "Ә.Молдағұловаға", "Б.Момышұлына", "Ж.Елеусізовке"), 2),

    Question("ҰОС жылдарындағы Қазақстанға ең жақын майдан:",
        listOf("Мәскеу", "Ленинград", "Сталинград", "Еділ бойы"), 2),

    Question("Дүниежүзілік соғыста түбегейлі бетбұрысқа шешуші үлес қосқан Еділдегі шайқас:",
        listOf("Мәскеу шайқасы", "Ленинград шайқасы", "Сталинград шайқасы", "Дон шайқасы"), 2),

    Question("Полковник Ғани Сафиуллин бастаған 73-ші гвардиялық дивизия ерлік көрсетті:",
        listOf("Мәскеу түбінде", "Ленинград түбінде", "Сталинград түбінде", "Еділ бойында"), 2),

    Question("Өртке оранған ұшағын жау танкілерінің шоғырына құлатын қаза тапқан, Кеңес Одағының Батыры, Қарағандылық ұшқыш:",
        listOf("Т.Тоқтаров", "Т.Бегелдинов", "І.Айтықов", "Н.Әбдіров"), 3),

    Question("Сталинград қаласының түбінде қаза тапқан минометші, Кеңес Одағының батыры:",
        listOf("Қ.Сыпатаев", "Т.Мырзаев", "Т.Позолотин", "Ж.Елеусізов"), 0),

    Question("Жаудың 5 танкісін, өздігінен жүретін 'Фердинанд' зеңбірегін, оқ-дәрі тиелген 3 автомашинасын жойған Кеңес Одағының батыры:",
        listOf("Т.Позолотин", "Қ.Аухадиев", "Ж.Елеусізов", "С.Баймағамбетов"), 1),

    Question("ҰОС жылдарында Қазақстандық партизандардың жалпы саны:",
        listOf("2,5 мың адам", "2 мың адам", "4 мың адам", "3,5 мың адам"), 3),

    Question2("Рейхстаг терезесіне ту тіккен қазақстандық жауынгерлер:",
        listOf("Қ.Қайсенов", "Г.Булатов", "Ж.Елеусізов", "Р.Қошқарбаев", "Ә.Шәріпов"), 1, 3),

    Question("ҰОС жылдарында Кеңес Одағының Батыры атағын алған қазақстандықтар саны:",
        listOf("500", "497", "395", "239"), 1)
)
val question48 = listOf(
    Question("XIX ғасырдың 50 жылдары көтерілістер болған аймақ:",
        listOf("Оңтүстік Қазақстан", "Батыс Қазақстан", "Шығыс Қазақстан", "Орталық Қазақстан"), 0),

    Question("ХІХ ғ. екінші жартысында патша үкіметінің Оңтүстік Қазақстанды жаулап алуына себеп болған жағдай:",
        listOf("Сырым Датұлы көтерілісінің Оңтүстік Қазақстанды шарпуы",
            "Ж.Нұрмұхамедұлы көтерілісінің басталуы",
            "К.Қасымұлы көтерілісінің Оңтүстік Қазақстанды шарпуы",
            "Есет батыр көтерілісінің басталуы"), 2),

    Question("1847 жылы салынған бекініс:",
        listOf("Қапал", "Верный", "Аягөз", "Ақмешіт"), 0),

    Question("1848 жылы Ұлы жүз қазақтарын басқару үшін бекітілген лауазым:",
        listOf("пристав", "уезд", "ауыл", "болыс"), 0),

    Question("1848 жыл Ұлы жүзді басқаратын пристав тағайындалды:",
        listOf("Таушүбекте", "Қапалда", "Верныйда", "Пішпекте"), 1),

    Question("1833 жылы Орынбор өлкесінің әскери губернаторы болып сайланды:",
        listOf("В.А.Перовский", "А.Куропаткин", "Эссен", "Игельстром"), 0),

    Question("1853 жылы Ресейдің қол астына алынған қоқандықтардың бекінісі:",
        listOf("Ақмешіт", "Райым", "Пішпек", "Тоқмақ"), 0),

    Question("1854 жылы көктемде құрылған бекініс:",
        listOf("Верный", "Қапал", "Кәстек", "Ұзынағаш"), 0),

    Question("Ұлы жүздің приставтығы Қапалдан Верныйға ауыстырылған жыл:",
        listOf("1855 жыл", "1854 жыл", "1856 жыл", "1857 жыл"), 0),

    Question("1859 жылы Ұлы жүзбен Қырғыз елінің солтүстік шекарасына тұрғызылған бекініс:",
        listOf("Кәстек", "Меркі", "Қапал", "Верный"), 0),

    Question2("1860 жылы полковник Циммерман бастаған орыс әскерлері басып алған бекініс:",
        listOf("Тоқмақ", "Қапал", "Ақмешіт", "Пішпек", "Әулиеата"), 0, 3),

    Question("1860 жылы 19-21 қазанда қоқандықтар мен орыс әскерлері шайқасқан жер:",
        listOf("Шымкент", "Ұзынағаш", "Тоқмақ", "Пішпек"), 1),

    Question("Қоқандықтар мен орыс әскерлерінің арасында Ұзынағаш түбіндегі шайқас өтті:",
        listOf("1860 жылы", "1864 жылы", "1867 жыл", "1855 жыл"), 0),

    Question("1864 жылы Ресей әскерлері басып алмаған бекініс:",
        listOf("Әулиеата", "Верный", "Түркістан", "Меркі", "Шымкент"), 1)
)
val question49 = listOf(
    Question("Отарлық ұлт аудандарының 'Сілкініп оянуына' негіз болған 'Қанды жексенбі' болған жыл:",
        listOf("1905 жылы 15 қаңтар", "1905 жылы 9 қаңтар", "1905 жылы 7 қаңтар", "1905 жылы 10 қаңтар"), 1),

    Question("'Қанды жексенбі' өлеңінің авторы:",
        listOf("А.Иманов", "Ұ.Саурықов", "Жүсіп Көпейұлы", "Кейкі батыр"), 2),

    Question("1905-1906 жж Қазақстанда жұмысшылар толқуының болуына әсер еткен оқиға:",
        listOf("Бірінші Орыс революциясы", "Столыпин реформасы", "Патша манифестінің қабылдануы", "Салықтың көбеюі"), 0),

    Question("1906 жылы қабылданған реформаның сипаты:",
        listOf("Бұқаралық", "Әлеуметтік", "Саяси", "Аграрлық"), 3),

    Question("Столыпин аграрлық реформасының мақсаты:",
        listOf("Шаруаларды қоныстандыруды тоқтату", "Шаруаларды Қазақстанға қоныстандыру", "Теміржолдар салу", "Өлкеде өнеркәсіп орындарын салу"), 1),

    Question2("Алғашқы петициялар жолдаған дін өкілдері:",
        listOf("Ш.Қосшығұлұлы", "Науан хазірет", "А.Байтұрсынов", "Ә.Жанбосынов", "Бейіс хазірет"), 1, 4),

    Question("1913 жылдың өзінде 'Қазақ ұлтының өмір сүруінің өзі проблемаға айналды' деп жазды:",
        listOf("С.Сейфуллин", "Т.Рысқұлов", "Ә.Бөкейханов", "А.Байтұрсынов"), 3),

    Question("Столыпиннің реформасы бойынша Қазақстанға қоныс аударған шаруалар:",
        listOf("700 000 астам", "800 000 астам", "1 млн жуық", "500 000 астам"), 0),

    Question("Столыпиннің реформасы бойынша Қазақстаннан тартып алынған жер көлемі:",
        listOf("4 млн десятина", "17 млн десятина", "45 млн десятина", "15 мың десятина"), 1),

    Question2("1906 жылы І Мемлекеттік Думаның құрамына сайланған қазақ депутаттары:",
        listOf("А.Бірімжонов", "Ә.Бөкейханов", "М.Тынышбаев", "Б.Қаратаев" ), 0, 1),

    Question("Ресейдің бірінші Мемлекеттік Думасы жұмыс істеді:",
        listOf("104 күн", "101 күн", "73 күн", "75 күн"), 2),

    Question("1907 жылы ІІ Мемлекеттік Думаға Семей облысынан сайланған депутат:",
        listOf("А.Бірімжанов", "М.Қаратаев", "Т.Нүрекенов", "Ә.Бөкейханов"), 2),

    Question("Қазақ халқының өз құқықтарын қорғау жолындағы күресінің өзіндік ерекшелігі:",
        listOf("Қарулы күреске шығу", "Петиция жолдау", "Жерді тартып алуға қарсылық көрсету", "Бейбіт шеруге шығу"), 1)
)
val question50 = listOf(
    Question("1925-1933 жылдары Қазақ өлкелік партия комитетінің басшысы:",
        listOf("О.Исаев", "Ф.Голощекин", "Л.И.Мирзоян", "С.Қожанов"), 1),

    Question("Кіші Қазан идеясының авторы:",
        listOf("О.Исаев", "Ф.Голощекин", "Л.И.Мирзоян", "С.Қожанов"), 1),

    Question("Ф.Голощекиннің ұраны:",
        listOf("Кіші Қазан", "Ұжымдастыру", "Ауылды кеңестендіру", "Сомодержавие жасасын"), 2),

    Question("Кіші Қазан төңкерісін өткізуді ұсынған Голощекиннің идеясын дұрыс деп бағалады:",
        listOf("С.Сәдуақасов", "О.Исаев", "И.В.Сталин", "Л.Мирзоян"), 2),

    Question("1927 жылы БК(б)П- ның ХҮ съезінде қабылданған шешім:",
        listOf("Индустрияландыру", "Құғын-сүргін ұйымдастыру", "ЖЭС", "Ауылшаруашылығын ұжымдастыру"), 3),

    Question("Қазақ байларын тәркілеу және жер аудару туралы декрет шыққан жыл:",
        listOf("1927 ж. 28 тамыз", "1928 ж. 27 шілде", "1928 ж. 27 тамыз", "1927 ж. 14 шілде"), 2),

    Question("Ұжымдастыру жылдары тәркілеуге ұшыраған қожалықтар саны:",
        listOf("700-дей", "500-дей", "600-дей", "883-тей"), 0),

    Question("Ұжымдастыру жылдары жартылай феодалдар мен байлардан тартып алынған мал саны:",
        listOf("148 мың мал", "151 мың мал", "168 мың мал", "145 мың мал"), 3),

    Question("Ұжымдастыру басталардан бұрын республикада 40 млн- нан астам мал болса, 1933 жылы не бары:",
        listOf("3,5 млн мал қалған", "4,5 млн мал қалған", "7 млн мал қалған", "2,7 млн мал қалған"), 1),

    Question("Ұжымдастыру жылдары лаңкестік әрекеттерді, өрт салуларды есептемегенде, республика аумағында толқулар мен көтерілістер саны:",
        listOf("728", "350", "372", "883"), 2),

    Question("1929 жылы ұжымдастыруға қарсы көтерілістер болған округтер:",
        listOf("Сырдария, Жетісу", "Ақмола, Семей", "Орал, Торғай", "Сырдария, Қостанай"), 3),

    Question("1932 жылы Бесеудің хаты жолданды:",
        listOf("О.Исаевке", "Л.И.Мирзоянға", "Сталинге", "Голощекинге"), 3),

    Question("Қазақстандағы аштық туралы Сталинге ашық хат жазды:",
        listOf("С.Сәдуақасов", "А.Байтұрсынов", "С.Қожанов", "Т.Рысқұлов"), 3),

    Question("1933 жылы Қазақ өлкелік партия комитетінің бірінші хатшысы болып сайланды:",
        listOf("Ф.Голощекин", "Л.И.Мирзоян", "С.Сәдуақасов", "О.Исаев"), 1),

    Question("Лаңкестік жаппай сипат алды:",
        listOf("1938-1939", "1935-1937", "1937-1938", "1928-1930"), 2)
)



@Composable
fun QuizScreen() {
    val questions = remember {
        when (Whichquiz.level) {
            1 -> question1
            2 -> question2
            3 -> question3
            4 -> question4
            5 -> question5
            6 -> question6
            7 -> question7
            8 -> question8
            9 -> question9
            10 -> question10
            11 -> question11
            12 -> question12
            13 -> question13
            14 -> question14
            15 -> question15
            16 -> question16
            17 -> question17
            18 -> question18
            19 -> question19
            20 -> question20
            21 -> question21
            22 -> question22
            23 -> question23
            24 -> question24
            25 -> question25
            26 -> question26
            27 -> question27
            28 -> question28
            29 -> question29
            30 -> question30
            31 -> question31
            32 -> question32
            33 -> question33
            34 -> question34
            35 -> question35
            36 -> question36
            37 -> question37
            38 -> question38
            39 -> question39
            40 -> question40
            41 -> question41
            42 -> question42
            43 -> question43
            44 -> question44
            45 -> question45
            46 -> question46
            47 -> question47
            48 -> question48
            49 -> question49
            50 -> question50
            else -> question1
        }
    }

    var currentQuestionIndex by remember { mutableStateOf(0) }
    var selectedOptions by remember { mutableStateOf(setOf<Int>()) } // Для множественного выбора
    var score by remember { mutableStateOf(0) }
    var showResult by remember { mutableStateOf(false) }
    var incorrectQuestions by remember { mutableStateOf(listOf<Int>()) }

    if (showResult) {
        Column(
            modifier = Modifier
                .fillMaxSize()
                .verticalScroll(rememberScrollState())
                .padding(top= 90.dp  , bottom = 170.dp),
            verticalArrangement = Arrangement.Center,
            horizontalAlignment = Alignment.CenterHorizontally
        ) {
            Text(
                text = "Сіздің нәтижеңіз: $score/${questions.size}",
                style = MaterialTheme.typography.headlineMedium
                , fontFamily = FontFamily(Font(R.font.forum))
            )

            if (incorrectQuestions.isNotEmpty()) {
                Text(
                    text = "Қателескен сұрақтар:",
                    style = MaterialTheme.typography.headlineSmall,
                    modifier = Modifier.padding(top = 100.dp , bottom= 170.dp)   ,
                    color=Color.White
                    , fontFamily = FontFamily(Font(R.font.forum))
                )
                incorrectQuestions.forEach { index ->
                    val question = questions[index]
                    Text(text = "Сұрақ: ${question.text}" , color= Color.White)
                    when (question) {
                        is Question -> Text(text = "Дұрыс жауап: ${question.options[question.correctAnswerIndex]}" , color= Color.White ,  fontFamily = FontFamily(Font(R.font.forum)))
                        is Question2 -> Text(text = "Дұрыс жауаптар: ${question.options[question.correctAnswerIndex]} и ${question.options[question.correctAnswerIndex2]}" , color=Color.White , fontFamily = FontFamily(Font(R.font.forum)))
                    }
                    Spacer(modifier = Modifier.height(8.dp))
                }
            }

            Button(
                onClick = {
                    currentQuestionIndex = 0
                    score = 0
                    selectedOptions = emptySet()
                    showResult = false
                    incorrectQuestions = listOf()
                },
                modifier = Modifier.padding(top = 16.dp)
            ) {
                Text("Қайта өту" , fontFamily = FontFamily(Font(R.font.forum)))
            }
        }
    } else {
        val question = questions[currentQuestionIndex]

        Column(
            modifier = Modifier
                .fillMaxSize()
                .verticalScroll(rememberScrollState()) // Добавляем прокрутку
                .padding(top = 100.dp , bottom = 170.dp),
            horizontalAlignment = Alignment.CenterHorizontally
        ) {
            Card(
                colors = CardDefaults.cardColors(containerColor = Color.Transparent) ,
                border = BorderStroke(1.dp , color = Color.White)
            ){
                Text(
                    text = question.text,
                    style = MaterialTheme.typography.headlineMedium,
                    modifier = Modifier.padding(bottom = 8.dp) ,
                    color =Color.White
                    , fontFamily = FontFamily(Font(R.font.forum))
                )
            }


            question.options.forEachIndexed { index, option ->
                Row(
                    verticalAlignment = Alignment.CenterVertically,
                    modifier = Modifier
                        .fillMaxWidth()
                        .clickable {
                            selectedOptions = if (selectedOptions.contains(index)) {
                                selectedOptions - index
                            } else {
                                selectedOptions + index
                            }
                        }
                        .padding(vertical = 8.dp)
                ) {
                    if (question is Question2) {
                        Checkbox(
                            checked = selectedOptions.contains(index),
                            onCheckedChange = {
                                selectedOptions = if (selectedOptions.contains(index)) {
                                    selectedOptions - index
                                } else {
                                    selectedOptions + index
                                }
                            }
                        )
                    } else {
                        RadioButton(
                            selected = selectedOptions.contains(index),
                            onClick = {
                                selectedOptions = setOf(index)
                            }
                        )
                    }
                    Text(text = option, modifier = Modifier.padding(start = 8.dp) , color= Color.White)
                }
            }

            Spacer(modifier = Modifier.weight(1f)) // Кнопка "Далее" опускается вниз

            Button(
                onClick = {
                    val isCorrect = when (question) {
                        is Question -> selectedOptions == setOf(question.correctAnswerIndex)
                        is Question2 -> selectedOptions.contains(question.correctAnswerIndex) &&
                                selectedOptions.contains(question.correctAnswerIndex2) &&
                                selectedOptions.size == 2
                        else -> false
                    }

                    if (isCorrect) {
                        score++
                    } else {
                        incorrectQuestions = incorrectQuestions + currentQuestionIndex
                    }

                    selectedOptions = emptySet()
                    if (currentQuestionIndex < questions.size - 1) {
                        currentQuestionIndex++
                    } else {
                        showResult = true
                    }
                },
                modifier = Modifier.fillMaxWidth()
            ) {
                Text("Келесі"  ,  fontFamily = FontFamily(Font(R.font.forum)))
            }
        }
    }
}



@Preview(showBackground = true)
@Composable
fun PreviewQuizScreen() {
    QuizScreen()
}