package com.baglan.quizapp

import androidx.compose.foundation.BorderStroke
import androidx.compose.foundation.clickable
import androidx.compose.foundation.layout.*
import androidx.compose.foundation.rememberScrollState
import androidx.compose.foundation.verticalScroll
import androidx.compose.material3.*
import androidx.compose.runtime.*
import androidx.compose.ui.Alignment
import androidx.compose.ui.Modifier
import androidx.compose.ui.graphics.Color
import androidx.compose.ui.text.font.Font
import androidx.compose.ui.text.font.FontFamily
import androidx.compose.ui.tooling.preview.Preview
import androidx.compose.ui.unit.dp
import com.baglan.tarihtanbasy.R
import com.baglan.tarihtanbasy.screens.Whichquiz

interface Questions {
    val text: String
    val options: List<String>
}

data class Question(
    override val text: String,
    override val options: List<String>,
    val correctAnswerIndex: Int
) : Questions

data class Question2(
    override val text: String,
    override val options: List<String>,
    val correctAnswerIndex: Int,
    val correctAnswerIndex2: Int
) : Questions

val question1 =listOf(
    Question("Ежелгі дүние тарихының негізгі зерттеу объектісі қандай?",
        listOf("Орта ғасырлар тарихы", "Антикалық философия", "Алғашқы таптық қоғамдар мен өркениеттер", "Қазіргі заман тарихы"), 2),

    Question("“Неолиттік революция” ұғымы қандай өзгерістермен байланысты?",
        listOf("Отырықшылыққа көшу және егіншіліктің пайда болуы", "Алғашқы империялардың құрылуы", "Қоладан жасалған еңбек құралдарының пайда болуы", "Алғашқы жазудың пайда болуы"), 0),

    Question("Алғашқы қауымдық құрылыстың негізгі ерекшелігі қандай болды?",
        listOf("Әлеуметтік теңсіздіктің қалыптасуы", "Жеке меншіктің кең таралуы", "Ұжымдық меншік және бірлескен еңбек", "Құлдықтың пайда болуы"), 2),

    Question("Алғашқы таптық қоғам қай кезеңде пайда болды?",
        listOf("Палеолит", "Неолит", "Қола дәуірі", "Темір дәуірі"), 2),

    Question("Алғашқы өркениеттер қай аймақта пайда болды?",
        listOf("Солтүстік Америка", "Таяу Шығыс пен Месопотамия", "Орталық Азия", "Скандинавия"), 1),

    Question("Алғашқы жазу жүйелері қайда пайда болды?",
        listOf("Қытайда", "Грекияда", "Египет пен Месопотамияда", "Римде"), 2),

    Question("Өркениеттің негізгі белгілері қандай?",
        listOf("Қауымдық құрылыс, рулық басқару", "Мемлекеттік басқару, жазудың пайда болуы", "Жануарларды қолға үйрету, аңшылық", "Тек ауыл шаруашылығымен айналысу"), 1),

    Question("Антикалық өркениеттерге қандай елдер кіреді?",
        listOf("Египет пен Қытай", "Үндістан мен Месопотамия", "Грекия мен Рим", "Шумер мен Вавилон"), 2),

    Question("Алғашқы қауымдық қоғамда өндіріс тәсілі қандай болды?",
        listOf("Құлдық еңбек", "Жеке меншікке негізделген еңбек", "Ұжымдық еңбекті пайдалану", "Феодалдық қатынастар"), 2),

    Question("Тарихтағы алғашқы империялардың бірі қай елде пайда болды?",
        listOf("Грекия", "Қытай", "Парсы", "Египет"), 2),

    Question("Ежелгі Шығыс өркениеттерінде қандай шаруашылық түрі басым болды?",
        listOf("Өнеркәсіп", "Көшпелі мал шаруашылығы", "Суармалы егіншілік", "Сауда-саттық"), 2),

    Question("Қоғамдағы алғашқы еңбек бөлінісі неге негізделді?",
        listOf("Әлеуметтік таптардың қалыптасуына", "Әскердің пайда болуына", "Адамдардың жыныстық және жас ерекшеліктеріне", "Құлдықтың таралуына"), 2),

    Question("Ежелгі Шығыс мемлекеттерінде билеушінің негізгі қызметі қандай болды?",
        listOf("Сауда ұйымдастыру", "Әскер басқару және халықты қорғау", "Ғылым мен білімді дамыту", "Құл саудасын жүргізу"), 1),

    Question("Шығыс пен Батыс ұғымдары алғаш қай дәуірде қалыптасты?",
        listOf("Орта ғасырларда", "Қайта өрлеу дәуірінде", "Антика дәуірінде", "Жаңа заманда"), 2),

    Question("Археологтардың пікірінше, алғашқы Homo sapiens қай кезеңде өмір сүрді?",
        listOf("Темір дәуірінде", "Палеолит дәуірінде", "Антикалық кезеңде", "Орта ғасырларда"), 1)
)
val question2 = listOf(
    Question("Ежелгі Египеттің өркениетін дамытқан басты өзен қандай?",
        listOf("Евфрат", "Ніл", "Ганг", "Амазонка"), 1),

    Question("Египетті 'Нілдің сыйы' деп атаған тарихшы кім?",
        listOf("Геродот", "Птолемей", "Гомер", "Цицерон"), 0),

    Question("Ежелгі Египеттің алғашқы перғауындарының бірі кім болған?",
        listOf("Рамзес II", "Тутанхамон", "Нармер (Менес)", "Аменхотеп IV"), 2),

    Question("Ежелгі Египет тарихындағы ең ұзақ кезең қалай аталады?",
        listOf("Жаңа патшалық", "Ежелгі патшалық", "Орта патшалық", "Кейінгі патшалық"), 1),

    Question("Ежелгі Египеттің билеушісі қалай аталған?",
        listOf("Сатрап", "Император", "Фараон", "Канцлер"), 2),

    Question("Перғауындарды құдайдың жердегі бейнесі ретінде қандай құдаймен байланыстырды?",
        listOf("Осирис", "Гор", "Сет", "Анубис"), 1),

    Question("Ежелгі Египеттің алғашқы жазу жүйесі қалай аталады?",
        listOf("Клинопись", "Алфавиттік жазу", "Иероглифтер", "Латын жазуы"), 2),

    Question("Гиксос тайпалары қай кезеңде Египетті басып алды?",
        listOf("Ежелгі патшалық", "Бірінші өтпелі кезең", "Орта патшалық", "Екінші өтпелі кезең"), 3),

    Question("Жаңа патшалық дәуіріндегі әйгілі әйел билеуші кім болды?",
        listOf("Клеопатра", "Хатшепсут", "Нефертити", "Тутмос"), 1),

    Question("Ежелгі Египет перғауны IV Аменхотеп қандай діни реформа жасады?",
        listOf("Монотеизмді енгізіп, Атонға табынуды жариялады", "Барлық храмдарды жауып тастады", "Перғауындарға табынуды тоқтатты", "Жаңа құдайлар пантеонын құрды"), 0),

    Question("Ежелгі Египеттің ең ірі әскери күші қай патшалық кезінде болды?",
        listOf("Ежелгі патшалық", "Орта патшалық", "Жаңа патшалық", "Кейінгі патшалық"), 2),

    Question("Тутанхамон перғауынының қабірі қашан және кімнің басшылығымен ашылды?",
        listOf("1922 жылы, Говард Картер", "1815 жылы, Жан-Франсуа Шампольон", "1905 жылы, Генрих Шлиман", "1954 жылы, Захи Хавасс"), 0),

    Question("Ежелгі Египеттің ең әйгілі пирамидалары қай жерде орналасқан?",
        listOf("Луксор", "Карнак", "Гиза", "Асуан"), 2),

    Question("Ежелгі Египеттің кейінгі тарихында елді кімдер жаулап алды?",
        listOf("Вавилондықтар", "Гректер мен римдіктер", "Қытайлықтар", "Ғұндар"), 1),

    Question("Египеттің құлдырауы қай ғасырда аяқталды?",
        listOf("Б.з.д. VII ғасырда", "Б.з.д. IV ғасырда", "Б.з. I ғасырда", "Б.з. VII ғасырда"), 1)
)
val question3 = listOf(
    Question("Шумер өркениеті қай аймақта қалыптасты?",
        listOf("Египет", "Үндістан", "Месопотамия", "Грекия"), 2),

    Question("Месопотамиядағы алғашқы жазу түрі қалай аталады?",
        listOf("Алфавиттік жазу", "Клинопись", "Иероглифтер", "Руналық жазу"), 1),

    Question("Шумерлік қалалардың басқару жүйесі қалай аталды?",
        listOf("Демократия", "Қала-мемлекет", "Империя", "Феодализм"), 1),

    Question("Шумерлер қай өзендердің арасында қоныстанды?",
        listOf("Ніл мен Конго", "Ганг пен Инд", "Тигр мен Евфрат", "Дунай мен Рейн"), 2),

    Question("Ең алғашқы патшалар тізімі қай өркениетке жатады?",
        listOf("Ежелгі Египет", "Ежелгі Қытай", "Шумер", "Ежелгі Грекия"), 2),

    Question("Гильгамеш қай қала-мемлекеттің билеушісі болған?",
        listOf("Вавилон", "Урук", "Аккад", "Ниппур"), 1),

    Question("Қай патша алғаш рет бүкіл Месопотамияны біріктірді?",
        listOf("Саргон Аккадтық", "Хаммурапи", "Гильгамеш", "Навуходоносор"), 0),

    Question("Шумерлер қандай негізгі діни құрылымдар салды?",
        listOf("Пирамидалар", "Зиккураттар", "Храмдар", "Форумдар"), 1),

    Question("Ежелгі Месопотамияда 'Патшалар тізімі' не үшін қолданылды?",
        listOf("Салық жинау үшін", "Соғысқа дайындалу үшін", "Билеушілердің мұрасын сақтау үшін", "Діни рәсімдер үшін"), 2),

    Question("Шумерлердің басты құдайы кім болған?",
        listOf("Анубис", "Амон-Ра", "Энлиль", "Зевс"), 2),

    Question("Ежелгі Месопотамияда Урдың III әулетін кім басқарды?",
        listOf("Саргон", "Ур-Намму", "Хаммурапи", "Тиглатпаласар"), 1),

    Question("Аккад патшалығын қай патша басқарды?",
        listOf("Гильгамеш", "Навуходоносор", "Саргон", "Рамзес"), 2),

    Question("Шумер өркениетінің басты жетістігі қандай?",
        listOf("Жазу жүйесінің пайда болуы", "Бірінші темір қару-жарақ", "Атақты пирамидалар", "Философияның дамуы"), 0),

    Question("Вавилон патшасы Хаммурапи қандай заңдар жинағын жасады?",
        listOf("Рим құқығы", "Хаммурапи заңдары", "Торпах кодексі", "Наполеон кодексі"), 1),

    Question("Месопотамиядағы суармалы егіншілік жүйесін дамыту қай өзендерге байланысты болды?",
        listOf("Ганг және Брахмапутра", "Ніл және Конго", "Тигр және Евфрат", "Амудария және Сырдария"), 2)
)
val question4 =listOf(
    Question("Хетт мемлекеті қай аймақта орналасқан?",
        listOf("Месопотамия", "Кіші Азия", "Египет", "Балқан түбегі"), 1),

    Question("Хеттердің алғашқы астанасы қай қала болды?",
        listOf("Вавилон", "Урук", "Куссар", "Хаттуша"), 2),

    Question("Хетт мемлекетінің кейінгі астанасы қандай қала болды?",
        listOf("Аккад", "Хаттуша", "Карфаген", "Микены"), 1),

    Question("Хеттер қай халықтардың жазуын қабылдады?",
        listOf("Египеттіктер", "Шумерлер", "Финикийлер", "Гректер"), 1),

    Question("Хеттер қай тілдік топқа жатады?",
        listOf("Семиттік", "Түркілік", "Үндіеуропалық", "Қытай-тибет"), 2),

    Question("Хетт мемлекетіндегі негізгі билеуші кім болды?",
        listOf("Фараон", "Лугаль", "Патша", "Император"), 2),

    Question("1906 жылы Богазкейде жүргізілген қазба жұмыстарында не табылды?",
        listOf("Хетт заңдары", "Патша мұрағаты", "Гильгамеш жыры", "Хаммурапи кодексі"), 1),

    Question("Қай ғалым хетт сына жазуын ашты?",
        listOf("Геродот", "Бедржих Грозный", "Генрих Шлиман", "Жан-Франсуа Шампольон"), 1),

    Question("Хетт мемлекеті қай ғасырда құлдырады?",
        listOf("Б.з.д. XVIII ғ.", "Б.з.д. XIII ғ.", "Б.з.д. XII ғ.", "Б.з.д. X ғ."), 2),

    Question("Хеттердің басты жаулары кімдер болды?",
        listOf("Египеттіктер", "Шумерлер", "Ассириялықтар", "Теңіз халықтары"), 3),

    Question("Хетт мемлекетінде қандай құдай ең жоғары саналды?",
        listOf("Осирис", "Зевс", "Тешуб", "Аполлон"), 2),

    Question("Қай патша Вавилонды басып алды?",
        listOf("Суппилулиум I", "Мурсили I", "Хаттусили III", "Рамзес II"), 1),

    Question("Қай шайқас Хетт мемлекеті мен Египет арасында өтті?",
        listOf("Марафон шайқасы", "Қадеш шайқасы", "Саламис шайқасы", "Термопил шайқасы"), 1),

    Question("Хетттер алғаш болып қандай металды өңдеді?",
        listOf("Қола", "Темір", "Алтын", "Күміс"), 1),

    Question("Хетт патшалығының экономикасы қандай салаға негізделді?",
        listOf("Балық аулау", "Металл өңдеу және сауда", "Жол құрылысы", "Құл саудасы"), 1)
)
val question5 = listOf(
    Question("Финикия атауы қай халықтан шыққан?",
        listOf("Гректер", "Египеттіктер", "Шумерлер", "Ассирийліктер"), 0),

    Question("Б.з.д. III мыңжылдықта Финикиядағы маңызды сауда орталығы қай қала болды?",
        listOf("Угарит", "Сидон", "Библ", "Тир"), 2),

    Question("Финикиялықтар қандай алфавитті ойлап тапты?",
        listOf("Клинопись", "Иероглиф", "Алфавиттік жазу", "Руналық жазу"), 2),

    Question("Финикиялықтардың негізгі шаруашылығы қандай болды?",
        listOf("Ауыл шаруашылығы", "Сауда және теңізде жүзу", "Әскер ісі", "Қолөнер"), 1),

    Question("Финикиялықтар қай теңізде үстемдік етті?",
        listOf("Қара теңіз", "Каспий теңізі", "Жерорта теңізі", "Қызыл теңіз"), 2),

    Question("Ханаан аймағы қай елдер арасында орналасқан?",
        listOf("Египет пен Вавилон", "Ассирия мен Үндістан", "Парфия мен Грекия", "Рим мен Карфаген"), 0),

    Question("Б.з.д. ІІ мыңжылдықта Сириядағы ең қуатты мемлекет қайсысы болды?",
        listOf("Митанни", "Финикия", "Египет", "Ассирия"), 0),

    Question("Финикиялықтар қандай тауарды Египетке экспорттады?",
        listOf("Алтын", "Балқарағай ағашы", "Күміс", "Темір"), 1),

    Question("Палестинада алғашқы иудей мемлекеті қашан құрылды?",
        listOf("Б.з.д. X ғасырда", "Б.з.д. VIII ғасырда", "Б.з.д. VI ғасырда", "Б.з.д. IV ғасырда"), 0),

    Question("Финикиялықтар қай қалада ең бірінші теңіз империясын құрды?",
        listOf("Карфаген", "Тир", "Аккад", "Мари"), 1),

    Question("Б.з.д. XIII ғасырда қай халық Палестинаға басып кірді?",
        listOf("Хетттер", "Ассириялықтар", "Израильдіктер", "Финикиялықтар"), 2),

    Question("Б.з.д. 1274 жылы Қадеш шайқасы қай екі мемлекет арасында өтті?",
        listOf("Египет пен Финикия", "Египет пен Хетттер", "Финикия мен Ассирия", "Грекия мен Парфия"), 1),

    Question("Парфия патшалығы қай аймақта құрылды?",
        listOf("Кіші Азия", "Месопотамия", "Иран", "Үндістан"), 2),

    Question("Бактрия патшалығы қай аймақты қамтыды?",
        listOf("Қазіргі Иран", "Орта Азия", "Солтүстік Африка", "Таяу Шығыс"), 1),

    Question("Парфия мен Бактрия мемлекеттері қай елдің ықпалымен қалыптасты?",
        listOf("Грекия", "Египет", "Шумер", "Қытай"), 0)
)
val question6 = listOf(
    Question("Мидия мемлекеті қай ғасырда қалыптасты?",
        listOf("Б.з.д. IX ғасыр", "Б.з.д. VII ғасыр", "Б.з.д. V ғасыр", "Б.з.д. III ғасыр"), 1),

    Question("Мидияның ең күшті патшасы кім болды?",
        listOf("Астиаг", "Кир II", "Камбиз", "Киаксар"), 3),

    Question("Мидия қай елмен одақтасып, Ассирияны талқандады?",
        listOf("Египет", "Лидия", "Вавилон", "Парфия"), 2),

    Question("Ахеменидтер әулетінің негізін қалаушы кім?",
        listOf("Ксеркс", "Дарий I", "Кир II", "Артаксеркс"), 2),

    Question("Кир II қай патшаны жеңіп, Мидияны бағындырды?",
        listOf("Астиаг", "Киаксар", "Навуходоносор II", "Рамзес II"), 0),

    Question("Ахеменидтік империяның алғашқы астанасы қай қала болды?",
        listOf("Сузы", "Персеполь", "Вавилон", "Хаттуша"), 0),

    Question("Парсы державасы қай патша тұсында ең үлкен аймағына жетті?",
        listOf("Кир II", "Камбиз", "Дарий I", "Ксеркс"), 2),

    Question("Ахеменидтік империяда аймақтық басқару жүйесі қалай аталды?",
        listOf("Провинция", "Сатрапия", "Легион", "Тайпа"), 1),

    Question("Дарий I қандай ақша бірлігін енгізді?",
        listOf("Динар", "Дарик", "Тетрадрахма", "Сикль"), 1),

    Question("Ахеменидтік парсылар қай халықтың жазуын қолданды?",
        listOf("Финикийлер", "Египеттіктер", "Шумерлер", "Эламдықтар"), 3),

    Question("Ахеменидтердің діни жүйесінің негізін салған қай ілім?",
        listOf("Буддизм", "Зороастризм", "Монотеизм", "Яхвизм"), 1),

    Question("Ксеркс қай елге сәтсіз жорық жасады?",
        listOf("Үндістан", "Грекия", "Египет", "Скифия"), 1),

    Question("Парсы патшасы III Дарийді кім жеңіп, Ахеменидтер мемлекетін құлатты?",
        listOf("Юлий Цезарь", "Филипп II", "Александр Македонский", "Ганнибал"), 2),

    Question("Ахеменидтік империя қай жылы құлады?",
        listOf("Б.з.д. 331 жыл", "Б.з.д. 323 жыл", "Б.з.д. 280 жыл", "Б.з.д. 202 жыл"), 0),

    Question("Зороастризм дінінің негізгі қасиетті кітабы қалай аталады?",
        listOf("Таурат", "Веда", "Авеста", "Құран"), 2)
)
val question7 = listOf(
    Question("Ежелгі Үндістанның алғашқы өркениеті қалай аталады?",
        listOf("Ганг өркениеті", "Инд өркениеті", "Дравид өркениеті", "Ведалық өркениет"), 1),

    Question("Инд өркениетінің басты қалалары қандай?",
        listOf("Агра мен Дели", "Мохенджо-Даро және Хараппа", "Каннаудж және Паталипутра", "Уджайни мен Матхура"), 1),

    Question("Ведалық дәуірде қоғам қандай жүйеге бөлінді?",
        listOf("Тайпаларға", "Касталарға", "Сатрапияларға", "Мемлекеттерге"), 1),

    Question("Үндістандағы ең көне қасиетті мәтіндер қалай аталады?",
        listOf("Веды", "Трипитака", "Авеста", "Бхагавадгита"), 0),

    Question("Буддизм дінінің негізін қалаушы кім?",
        listOf("Ашока", "Чандрагупта", "Сиддхартха Гаутама", "Ману"), 2),

    Question("Буддизм қай дәуірде пайда болды?",
        listOf("Инд өркениеті кезінде", "Ведалық дәуірде", "Буддалық дәуірде", "Классикалық дәуірде"), 2),

    Question("Ежелгі Үндістанда ең ірі империялардың бірі қай әулетке тиесілі болды?",
        listOf("Гупталар", "Маурьялар", "Кушандар", "Нанда әулеті"), 1),

    Question("Маурьялар империясының негізін қалаған кім?",
        listOf("Ашока", "Чандрагупта Маурья", "Самудрагупта", "Харша"), 1),

    Question("Ашока патшаның басты жетістігі қандай?",
        listOf("Буддизмді тарату", "Инд өркениетін дамыту", "Гупта әулетін құру", "Парсыларды жеңу"), 0),

    Question("Касталық жүйеде ең жоғары варна қалай аталды?",
        listOf("Кшатрийлер", "Брахмандар", "Вайшьилер", "Шудралар"), 1),

    Question("Гупта империясы кезінде Үндістанда қандай ғылым ерекше дамыды?",
        listOf("Астрономия", "Химия", "Психология", "Философия"), 0),

    Question("Ежелгі Үндістанда қандай жазу жүйесі қолданылды?",
        listOf("Клинопись", "Брахми", "Руналық жазу", "Иероглифтер"), 1),

    Question("Ежелгі Үндістанның діни заңдар жинағы қалай аталды?",
        listOf("Ашока эдиктілері", "Ману заңдары", "Тора", "Конфуций ілімдері"), 1),

    Question("Ежелгі Үндістанда варналар арасындағы қатынасты қандай заңдар реттеді?",
        listOf("Хаммурапи заңдары", "Ману заңдары", "Вавилон кодексі", "Авеста"), 1),

    Question("Гупта империясы кезінде Үндістан қай дәуірге жетті?",
        listOf("Алтын ғасырға", "Құлдырау кезеңіне", "Темір дәуіріне", "Тас ғасырына"), 0)
)
val question8 = listOf(
    Question("Ежелгі Римде гладиаторлар кімдер болды?",
        listOf("Ликторлар", "Центурийлар", "Гладиаторлар", "Плебейлер"), 2),

    Question("Грециядағы ғылым мен өнердің бай және жомарт қамқоршысы кім болды?",
        listOf("Перикл", "Аристотель", "Меценат", "Цицерон"), 2),

    Question("Рим республикасының негізгі басқару органдары қандай болды?",
        listOf("Сенат пен халық жиналысы", "Король мен министрлер", "Консулдар мен патриархтар", "Форум мен гладиаторлар"), 0),

    Question("Рим мен Карфаген арасындағы соғыстар қалай аталады?",
        listOf("Грек-Парсы соғыстары", "Пуникалық соғыстар", "Пелопоннес соғыстары", "Македония соғыстары"), 1),

    Question("Гай Юлий Цезарь қандай титулды иеленді?",
        listOf("Император", "Диктатор", "Консул", "Триумвир"), 1),

    Question("Рим империясының алғашқы императоры кім болды?",
        listOf("Цезарь", "Октавиан Август", "Нерон", "Тиберий"), 1),

    Question("Римдіктер қай халықтың мәдениеті мен дінін көп қабылдады?",
        listOf("Шумерлер", "Египеттіктер", "Гректер", "Финикийлер"), 2),

    Question("Римнің әйгілі заңдар жинағы қалай аталады?",
        listOf("Юстиниан кодексі", "Наполеон кодексі", "XII кесте заңдары", "Хаммурапи заңдары"), 2),

    Question("Рим империясы қай жылы екіге бөлінді?",
        listOf("476 жылы", "395 жылы", "330 жылы", "1453 жылы"), 1),

    Question("Батыс Рим империясы қай жылы құлады?",
        listOf("410 жылы", "395 жылы", "476 жылы", "1453 жылы"), 2),

    Question("Римдегі негізгі әлеуметтік таптар қандай болды?",
        listOf("Аристократтар мен құлдар", "Патрицийлер мен плебейлер", "Феодалдар мен шаруалар", "Сенаторлар мен гладиаторлар"), 1),

    Question("Рим империясында халықты санау және салық жинау үшін қандай жүйе қолданылды?",
        listOf("Форум", "Ценз", "Легион", "Трибунат"), 1),

    Question("Римдегі гладиаторлар шайқасы қай амфитеатрда өтетін?",
        listOf("Пантеон", "Форум", "Колизей", "Акрополь"), 2),

    Question("Ежелгі Римнің құлауына негізгі себептер қандай болды?",
        listOf("Жер сілкінісі мен климаттың өзгеруі", "Экономикалық дағдарыс, варварлардың шабуылы, ішкі қақтығыстар", "Шетелдік сауданың тоқтауы", "Теңіз саудасының дамуы"), 1),

    Question("Рим империясында қандай басқару жүйесі қолданылды?",
        listOf("Республика", "Монархия", "Империя", "Феодализм"), 2)
)
val question9 = listOf(
    Question("Ежелгі Рим өркениетінің қалыптасуына қандай халықтардың мәдениеті әсер етті?",
        listOf("Гректер мен этрускілер", "Египеттіктер мен шумерлер", "Галдар мен германдықтар", "Парсылар мен финикийліктер"), 0),

    Question("Рим қаласының негізін қалағандар кімдер деп есептеледі?",
        listOf("Юлий Цезарь мен Октавиан Август", "Рем мен Ромул", "Ганнибал мен Сципион", "Нерон мен Калигула"), 1),

    Question("Ежелгі Римдегі басқару формасы қандай кезеңдерден өтті?",
        listOf("Монархия, республика, империя", "Диктатура, республика, феодализм", "Демократия, империя, олигархия", "Анархия, монархия, социализм"), 0),

    Question("Рим республикасы қашан құрылды?",
        listOf("Б.з.д. 753 жылы", "Б.з.д. 509 жылы", "Б.з.д. 146 жылы", "Б.з. 27 жылы"), 1),

    Question("Римдегі плебейлер кімдер болды?",
        listOf("Жаулап алынған халықтар", "Құлдар", "Рулық қауымға кірмеген тұрғындар", "Сенаторлар"), 2),

    Question("Рим мен Карфаген арасындағы соғыстар қалай аталады?",
        listOf("Пелопоннес соғыстары", "Грек-парсы соғыстары", "Пуникалық соғыстар", "Македония соғыстары"), 2),

    Question("Гай Юлий Цезарь қандай титулды иеленді?",
        listOf("Принцепс", "Диктатор", "Консул", "Император"), 1),

    Question("Октавиан Август қандай басқару жүйесін енгізді?",
        listOf("Республика", "Доминат", "Принципат", "Феодализм"), 2),

    Question("Рим империясы ең үлкен аймағына қай ғасырда жетті?",
        listOf("Б.з.б. ІІ ғасырда", "Б.з. І ғасырда", "Б.з. ІІ ғасырда", "Б.з. ІV ғасырда"), 2),

    Question("Ежелгі Римнің әйгілі амфитеатры қалай аталады?",
        listOf("Парфенон", "Колизей", "Пантеон", "Форум"), 1),

    Question("Ежелгі Римнің заңдары алғаш рет қандай құжатта жазылған?",
        listOf("Наполеон кодексі", "Хаммурапи заңдары", "XII кесте заңдары", "Юстиниан кодексі"), 2),

    Question("Римдегі ең ірі құлдар көтерілісін кім басқарды?",
        listOf("Гай Гракх", "Ганнибал", "Спартак", "Сципион"), 2),

    Question("Батыс Рим империясы қай жылы құлады?",
        listOf("395 жылы", "410 жылы", "476 жылы", "565 жылы"), 2),

    Question("Ұлы қоныс аудару дәуірінде Римге қандай халықтар шабуыл жасады?",
        listOf("Викингтер", "Славяндар", "Ғұндар мен германдықтар", "Моңғолдар"), 2),

    Question("Ежелгі Рим мәдениетінде қандай архитектуралық стиль басым болды?",
        listOf("Готика", "Романдық стиль", "Классика", "Антикалық стиль"), 3)
)



val question10 = listOf(
    Question("Орта ғасырларда Қытайда қай әулет кезінде қағаз, компас және порох ойлап табылды?",
        listOf("Мин", "Сун", "Тан", "Юань"), 2),

    Question("Үндістанда нөл саны алғаш рет қай кезеңде математикалық жетістік ретінде қолданылды?",
        listOf("Маурия империясы", "Гупта дәуірі", "Делидің сұлтанаты", "Моғолдар империясы"), 1),

    Question("Ислам өркениетінің 'Алтын ғасыры' кезеңінде білім орталығы болған қала:",
        listOf("Бағдат", "Дели", "Самарқанд", "Фес"), 0),

    Question("Тан әулеті кезеңіндегі Қытай ақындарының бірі кім?",
        listOf("Конфуций", "Ли Бо", "Ибн Сина", "Әл-Фараби"), 1),

    Question("Африкадағы Тимбукту қаласы қандай ерекшелігімен белгілі болды?",
        listOf("Алтын кен орындарымен", "Сауда және білім орталығы ретінде", "Христиандық сәулет өнерімен", "Ислам дінінің таралуымен"), 1),

    Question("Қытайда кітап басу ісі алғаш рет қай кезеңде дамыды?",
        listOf("Мин әулеті", "Сун әулеті", "Тан әулеті", "Юань әулеті"), 1),

    Question("Ислам сәулет өнерінің негізгі ерекшелігі қандай?",
        listOf("Мүсін өнеріне көп мән беру", "Діни көріністерді бейнелеу", "Каллиграфия мен геометриялық өрнектерді пайдалану", "Ағаш ою өнерін дамыту"), 2),

    Question("Ұлы Жібек жолының Қытай экономикасы мен мәдениетіне ықпалы қандай болды?",
        listOf("Сауда дамыды және мәдени алмасу артты", "Қытай тұйық саясат жүргізді", "Еуропамен қарым-қатынас әлсіреді", "Конфуциандық философия жойылды"), 0),

    Question("Үнді мұхиты арқылы сауда қатынастарын дамытқан африкалық қала?",
        listOf("Кайруан", "Занзибар", "Тимбукту", "Александрия"), 1),

    Question("Әл-Фараби қай ғылым салаларында еңбектерімен белгілі болды?",
        listOf("Астрономия мен медицина", "Философия мен музыка", "Тарих пен саясат", "География мен физика"), 1),

    Question("Африкадағы Мали империясының экономикасы неге негізделді?",
        listOf("Мұнай өндірісі", "Алтын және тұз саудасына", "Жібек өндірісіне", "Мал шаруашылығына"), 1),

    Question("Ислам әлемінде ең ірі медициналық еңбектердің бірі 'Дәрігерлік ғылым каноны' кімнің еңбегі?",
        listOf("Әл-Фараби", "Ибн Сина", "Әл-Бируни", "Әл-Хорезми"), 1),

    Question("Орта ғасырларда Қытайда қолданылған ауыл шаруашылық жетістігі:",
        listOf("Суғару жүйелері мен темір соқа", "Бу қозғалтқышы", "Көтерме көпірлер", "Жел диірмендері"), 0),

    Question("Африканың солтүстігіндегі ислам мәдениетінің ең ірі орталығы:",
        listOf("Лалибела", "Фес", "Каир", "Тимбукту"), 2),

    Question("Ислам әлемінің суфизм бағыты қандай ерекшеліктерімен белгілі?",
        listOf("Жауынгерлік дәстүрге сүйенуі", "Рухани тәжірибе мен медитацияға мән беруі", "Саяси билікті нығайтуы", "Еуропа мәдениетіне ықпалы"), 1)
)
val question11 = listOf(
    Question("Орта ғасырларда Африкадағы ең ірі мемлекеттердің бірі қайсысы болды?",
        listOf("Мали", "Египет", "Эфиопия", "Гана"), 0),

    Question("Гана мемлекетінің негізгі байлығы неде болды?",
        listOf("Алтын мен тұз", "Мұнай мен газ", "Жібек пен темір", "Көмір мен күміс"), 0),

    Question("Мали мемлекетінің атақты билеушісі кім болған?",
        listOf("Манса Муса", "Сонгай Али", "Шака Зулу", "Аскья Мұхаммед"), 0),

    Question("Орта ғасырларда Африкадағы ең ірі ислам мәдениетінің орталығы қай қала болды?",
        listOf("Тимбукту", "Каир", "Нубия", "Занзибар"), 0),

    Question("Сонгай империясының ең әйгілі билеушісі кім болған?",
        listOf("Манса Муса", "Сонгай Али", "Аскья Мұхаммед", "Шака Зулу"), 2),

    Question("Арабтар Африкаға қай ғасырдан бастап ене бастады?",
        listOf("VII ғасыр", "IX ғасыр", "XI ғасыр", "XIII ғасыр"), 0),

    Question("Сахара арқылы өтетін керуендер не тасымалдады?",
        listOf("Алтын мен тұз", "Кітаптар мен қағаз", "Мата мен жібек", "Қару-жарақ"), 0),

    Question("Эфиопия мемлекетінің негізгі діні қандай болды?",
        listOf("Ислам", "Христиандық", "Буддизм", "Яхудилік"), 1),

    Question("Орта ғасырларда Африкада құл саудасының басты орталықтарының бірі қайсысы болды?",
        listOf("Занзибар", "Каир", "Триполи", "Гана"), 0),

    Question("Мали империясының астанасы қай қала болған?",
        listOf("Тимбукту", "Гао", "Бамако", "Дженне"), 2),

    Question("Орта ғасырларда Африка елдері қандай теңіз арқылы сауда жасады?",
        listOf("Жерорта теңізі", "Қызыл теңіз", "Атлант мұхиты", "Үнді мұхиты"), 0),

    Question("Сонгай империясы қай өзеннің бойында орналасқан?",
        listOf("Ніл", "Конго", "Нигер", "Замбези"), 2),

    Question("Манса Муса қай жылы қажылық сапарға барып, Египет пен Меккеде үлкен әсер қалдырды?",
        listOf("1200", "1324", "1405", "1501"), 1),

    Question("Гана мемлекеті қандай себеппен әлсіреді?",
        listOf("Арабтардың шабуылы", "Экономикалық дағдарыс", "Су тапшылығы", "Жібек жолының құлдырауы"), 0),

    Question("Шахаралық транссахаралық сауданың ең маңызды тауары қандай болды?",
        listOf("Мұнай", "Тұз", "Қант", "Темір"), 1)
)
val question12 =  listOf(
    Question("Орта ғасырларда Закавказье аймағында қандай мемлекеттер өмір сүрді?",
        listOf("Грузия, Армения, Албания", "Осман империясы, Ресей, Қытай", "Византия, Египет, Үндістан", "Парфия, Бактрия, Согдиана"), 0),

    Question("Грузияның ең күшті патшасы кім болды?",
        listOf("Баграт III", "Тамара патшайым", "Гагик I", "Давид Строитель"), 3),

    Question("Орта ғасырларда Орта Азияда қандай мемлекеттер өмір сүрді?",
        listOf("Қарахан мемлекеті, Селжұқтар, Хорезм", "Франция, Германия, Англия", "Араб халифаты, Парсы патшалығы", "Рим империясы, Византия"), 0),

    Question("Самани әулетінің орталығы қай қала болды?",
        listOf("Самарқанд", "Бұхара", "Ташкент", "Хива"), 1),

    Question("XI ғасырда Орта Азияға кімдер шабуыл жасады?",
        listOf("Қытайлар", "Моңғолдар", "Селжұқтар", "Орыстар"), 2),

    Question("Грузияның алтын ғасыры қай патшайымның тұсында болды?",
        listOf("Тамара патшайым", "Анна патшайым", "София патшайым", "Мария патшайым"), 0),

    Question("Хорезм мемлекетінің атақты билеушісі кім?",
        listOf("Мұхаммед Хорезмшах", "Темірлан", "Байбарыс", "Әл-Фараби"), 0),

    Question("Моңғол шапқыншылығы кезінде Орта Азияның басты қалаларының бірі болған?",
        listOf("Хива", "Бұхара", "Киев", "Стамбул"), 1),

    Question("Закавказье аймағы қай теңіздердің арасында орналасқан?",
        listOf("Қара және Жерорта теңіздері", "Каспий және Қара теңіздері", "Арал және Балтық теңіздері", "Солтүстік және Жапон теңіздері"), 1),

    Question("Самани әулеті қай ғасырларда өмір сүрді?",
        listOf("VII-X ғғ.", "IX-XI ғғ.", "XI-XIII ғғ.", "XIII-XV ғғ."), 1),

    Question("Тебриз қаласы қай мемлекеттің астанасы болды?",
        listOf("Грузия", "Әзірбайжан", "Қарақойлы мемлекеті", "Иран"), 2),

    Question("XII ғасырда Грузияға қандай сыртқы қауіп төніп тұрды?",
        listOf("Селжұқтар шапқыншылығы", "Моңғол шапқыншылығы", "Орыс князьдіктері", "Француз жорықтары"), 0),

    Question("Орта Азиядағы ірі ислам мәдениетінің орталықтарының бірі қай қала болды?",
        listOf("Мерв", "Нишапур", "Самарқанд", "Термез"), 2),

    Question("Орта ғасырларда Армения қандай империяның билігінде болды?",
        listOf("Византия", "Рим империясы", "Парсы патшалығы", "Селжұқтар"), 3),

    Question("1219-1221 жылдары Орта Азияға кімдер басып кірді?",
        listOf("Арабтар", "Моңғолдар", "Селжұқтар", "Ресейліктер"), 1)
)
val question13 = listOf(
    Question("Осман империясының негізін қалаған билеуші кім?", listOf("Сүлеймен I", "Осман I", "Мехмед II", "Баязид I"), 1),
    Question("Осман империясы қай ғасырда құрылды?", listOf("XI ғасыр", "XII ғасыр", "XIII ғасыр", "XIV ғасыр"), 2),
    Question("1453 жылы Константинопольді басып алған Осман билеушісі кім?", listOf("Осман I", "Сүлеймен I", "Мехмед II", "Селим I"), 2),
    Question("Осман империясы 1683 жылы қай мемлекетпен Вена түбінде соғысты?", listOf("Ресей", "Австрия", "Франция", "Иран"), 1),
    Question("Янычарлар әскери құрам ретінде қай ғасырда құрылды?", listOf("XIV ғасыр", "XV ғасыр", "XVI ғасыр", "XVII ғасыр"), 0),
    Question("Сүлеймен I билік еткен кезең қалай аталады?", listOf("Османның гүлдену дәуірі", "Алтын ғасыр", "Төңкерістер кезеңі", "Реформа дәуірі"), 1),
    Question("Осман империясының ең маңызды теңіз шайқасы қандай?", listOf("Лепанто шайқасы", "Чесма шайқасы", "Наварин шайқасы", "Гелголанд шайқасы"), 0),
    Question("1517 жылы Осман империясы қай аймақты жаулап алып, халифат билігін өз қолына алды?", listOf("Иран", "Египет", "Анадолы", "Балқан түбегі"), 1),
    Question("Осман империясында билік еткен соңғы сұлтан кім?", listOf("Сүлеймен II", "Абдулхамид II", "Мехмед VI", "Мұстафа Кемал Ататүрік"), 2),
    Question("Қай ғасырда Осман империясы «Еуропаның ауру адамы» деп атала бастады?", listOf("XVII ғасыр", "XVIII ғасыр", "XIX ғасыр", "XX ғасыр"), 2),
    Question("Осман империясының астанасы Константинополь қай жылы Стамбул деп өзгертілді?", listOf("1453", "1517", "1683", "1923"), 3),
    Question("1526 жылы Мохач шайқасында Осман империясы қай мемлекетті жеңді?", listOf("Ресей", "Польша", "Австрия", "Венгрия"), 3),
    Question("Осман империясында жергілікті билеушілер қалай аталды?", listOf("Бейлер", "Паша", "Сұлтан", "Халиф"), 1),
    Question("Осман империясының негізгі мемлекеттік діні қандай болды?", listOf("Буддизм", "Христиандық", "Ислам", "Иудаизм"), 2),
    Question("Қай жылы Осман империясы ресми түрде жойылды?", listOf("1908", "1918", "1923", "1935"), 2)
)
val question14 = listOf(
    Question("Үндістанда ерте феодалдық қатынастар қай ғасырларда дамыды?",
        listOf("III-V ғғ.", "V-X ғғ.", "XI-XIII ғғ.", "XIV-XVI ғғ."), 1),

    Question("Солтүстік Үндістанда Гупталар әулеті қай ғасырда құлады?",
        listOf("V ғ.", "VI ғ.", "VII ғ.", "VIII ғ."), 1),

    Question("Харша мемлекеті қай ғасырда өмір сүрді?",
        listOf("VI ғ.", "VII ғ.", "VIII ғ.", "IX ғ."), 1),

    Question("Чола мемлекеті қай аймақта орналасқан?",
        listOf("Солтүстік Үндістан", "Ганг жазығы", "Декан түбегі", "Бенгалия"), 2),

    Question("Үндістанға 998-1030 жылдары бірнеше рет жорық жасаған билеуші кім?",
        listOf("Бабыр", "Махмұд Ғазнауи", "Акбар", "Шах Жахан"), 1),

    Question("Дели сұлтанаты қай жылы құрылды?",
        listOf("1192 ж.", "1206 ж.", "1258 ж.", "1398 ж."), 1),

    Question("Дели сұлтанатының алғашқы билеушісі кім болды?",
        listOf("Құтб ад-дин Айбек", "Разия сұлтан", "Илтутмыш", "Ала уд-дин"), 0),

    Question("Дели сұлтанатын қанша әулет басқарды?",
        listOf("Үш", "Төрт", "Бес", "Алты"), 2),

    Question("Үндістанға Әмір Темір қай жылы жорық жасады?",
        listOf("1336 ж.", "1368 ж.", "1398 ж.", "1421 ж."), 2),

    Question("Ұлы Моғолдар империясының негізін қалаған кім?",
        listOf("Шах Жахан", "Бабыр", "Акбар", "Аурангзеб"), 1),

    Question("Бабыр Панипат шайқасында қай жылы жеңіске жетті?",
        listOf("1498 ж.", "1526 ж.", "1556 ж.", "1605 ж."), 1),

    Question("Ұлы Моғолдар империясында ең ірі реформаларды жүргізген билеуші кім?",
        listOf("Бабыр", "Акбар", "Шах Жахан", "Аурангзеб"), 1),

    Question("Сикхизм қандай діни-әлеуметтік қозғалыс болды?",
        listOf("Буддизмнің бір тармағы", "Индуизм мен исламның синтезі", "Даосизмнің жалғасы", "Зороастризмнің бір тармағы"), 1),

    Question("Виджаянагар мемлекеті қай аймақта құрылды?",
        listOf("Ганг жазығы", "Декан түбегі", "Солтүстік Үндістан", "Кашмир"), 1),

    Question("Ұлы Моғолдар империясы Үндістанда қанша жыл билік жүргізді?",
        listOf("100 жыл", "200 жыл", "300 жыл", "400 жыл"), 2)
)
val question15 = listOf(
    Question("Корея түбегінде орта ғасырларда қандай үш мемлекет болды?",
        listOf("Чосон, Пэкче, Силла", "Когурё, Пэкче, Силла", "Горё, Когурё, Чосон", "Силла, Горё, Чосон"), 1),

    Question("Силла патшалығы қай жылы Корея түбегін біріктірді?",
        listOf("668 ж.", "918 ж.", "1392 ж.", "1598 ж."), 0),

    Question("Кореядағы ең көне тарихи жазба қалай аталады?",
        listOf("Худуд әл-Алам", "Самгук Саги", "Нихон Сёки", "Манъёсю"), 1),

    Question("Когурё мемлекетінің аумағы қай аймақтарды қамтыды?",
        listOf("Тек Корей түбегі", "Қытайдың солтүстік-шығысы және Корей түбегі", "Жапония мен Корей түбегі", "Монғолия және Қытай"), 1),

    Question("Силла дәуірінде қандай дін Кореяда кең тарады?",
        listOf("Буддизм", "Конфуцийлік", "Даосизм", "Шаманизм"), 0),

    Question("Кореяда 918 жылы қандай мемлекет құрылды?",
        listOf("Когурё", "Горё", "Пэкче", "Чосон"), 1),

    Question("Горё мемлекеті қай жылы Моңғол билігін мойындады?",
        listOf("1232 ж.", "1258 ж.", "1274 ж.", "1368 ж."), 1),

    Question("Корё мемлекеті қай ғасырда өзінің ең жоғары дамуына жетті?",
        listOf("VIII ғ.", "X ғ.", "XI ғ.", "XIII ғ."), 2),

    Question("Кореяға 1231 жылы шабуыл жасаған халық?",
        listOf("Қидандар", "Жапондар", "Моңғолдар", "Маньчжурлар"), 2),

    Question("Имиджин соғысы қай елдер арасында өтті?",
        listOf("Қытай мен Жапония", "Корея мен Жапония", "Корея мен Қытай", "Корея мен Моңғолия"), 1),

    Question("1592 жылы Имиджин соғысында корей флотының атақты қолбасшысы кім болды?",
        listOf("Ли Сун Син", "Ван Гон", "Чхве Чхивон", "Хидэеси"), 0),

    Question("Корей мәдениетінде қандай дін үлкен рөл атқарды?",
        listOf("Буддизм және конфуцийлік", "Даосизм және христиандық", "Ислам және шаманизм", "Синтоизм және буддизм"), 0),

    Question("Корей поэзиясы мен әдебиеті қай дәуірде гүлденді?",
        listOf("Когурё дәуірінде", "Горё дәуірінде", "Силла дәуірінде", "Чосон дәуірінде"), 2),

    Question("Корё мемлекетінің қытайлық Юань әулетінен тәуелсіздік алған жылы:",
        listOf("1258 ж.", "1274 ж.", "1368 ж.", "1392 ж."), 2),

    Question("Кореяда 1392 жылы қандай жаңа әулет билікке келді?",
        listOf("Пэкче", "Горё", "Чосон", "Силла"), 2)
)
val question16 = listOf(
    Question("Жапонияның төрт негізгі аралы қандай?",
        listOf("Тайвань, Сахалин, Кюсю, Хонсю", "Кюсю, Хонсю, Сикоку, Хоккайдо", "Окинава, Кюсю, Хонсю, Сахалин", "Сикоку, Хоккайдо, Тайвань, Хонсю"), 1),

    Question("Жапонияда буддизм қай ғасырда тарады?",
        listOf("V ғасыр", "VI ғасыр", "VII ғасыр", "VIII ғасыр"), 1),

    Question("645 жылы Жапонияда қандай маңызды реформа болды?",
        listOf("Хэйан реформасы", "Камакура реформасы", "Тайка реформасы", "Сёгун реформасы"), 2),

    Question("Нара дәуірі қандай ерекшелігімен белгілі?",
        listOf("Императорлық биліктің әлсіреуі", "Самурайлардың күшеюі", "Бірінші орталықтандырылған мемлекеттің қалыптасуы", "Еуропамен сауда қатынастарының дамуы"), 2),

    Question("Хэйан дәуірінің ең әйгілі әдеби шығармасы қандай?",
        listOf("Кодзики", "Гэнджи моногатари", "Манъёсю", "Тайхэйки"), 1),

    Question("Жапонияда бірінші сёгунат қай жылы құрылды?",
        listOf("794 ж.", "1185 ж.", "1603 ж.", "1333 ж."), 1),

    Question("Самурайлардың кодексі қалай аталады?",
        listOf("Бусидо", "Сёгунат", "Сакоку", "Ронин"), 0),

    Question("1192 жылы Жапонияда сёгун атағын алған кім?",
        listOf("Токугава Иэясу", "Минамото Ёритомо", "Ода Нобунага", "Тайра Киёмори"), 1),

    Question("Моңғолдар Жапонияға жорық жасаған жылдар:",
        listOf("1250 және 1270 жж.", "1266 және 1273 жж.", "1274 және 1281 жж.", "1290 және 1301 жж."), 2),

    Question("Асикага сегунаты кезінде Жапонияның тарихында қандай кезең басталды?",
        listOf("Тыныштық кезеңі", "Самурайлардың әлсіреу кезеңі", "Өзара соғысушы провинциялар дәуірі", "Буддизмнің таралу кезеңі"), 2),

    Question("1543 жылы Жапонияға алғаш рет қай елдің саудагерлері келді?",
        listOf("Голландия", "Қытай", "Португалия", "Испания"), 2),

    Question("Жапонияда 1603 жылы қандай сёгунат құрылды?",
        listOf("Минамото", "Токугава", "Асикага", "Ода"), 1),

    Question("Токугава сегунаты қандай саясат жүргізді?",
        listOf("Еуропамен тығыз байланыс", "Буддизмді жою", "Жабық есік саясаты (Сакоку)", "Монғолдармен одақ құру"), 2),

    Question("Жапонияға христиан діні қай ғасырда тарай бастады?",
        listOf("X ғасыр", "XIV ғасыр", "XVI ғасыр", "XVII ғасыр"), 2),

    Question("Жапонияның орта ғасырлардағы негізгі әлеуметтік топтары қандай болды?",
        listOf("Самурайлар, шаруалар, қолөнершілер, саудагерлер", "Император, будда монахтары, әскери қолбасшылар", "Феодалдар, құлдар, саудагерлер, сёгундар", "Жауынгерлер, фермерлер, ғалымдар, жазушылар"), 0)
)
val question17 = listOf(
    Question("Қытайдың 'Үш патшалық дәуірі' қай жылдары өтті?",
        listOf("100-200 жж.", "220-280 жж.", "300-400 жж.", "500-600 жж."), 1),

    Question("Үш патшалық дәуіріндегі ең қуатты мемлекет қайсысы болды?",
        listOf("Шу", "У", "Вэй", "Сун"), 2),

    Question("Суй әулеті Қытайды қай жылы біріктірді?",
        listOf("589 ж.", "618 ж.", "960 ж.", "1271 ж."), 0),

    Question("Тан әулеті кезінде Қытай қандай мемлекеттермен сауда байланысын орнатты?",
        listOf("Еуропа, Жапония, Үндістан", "Түркия, Иран, Африка", "Грекия, Рим, Карфаген", "Скандинавия, Англия, Франция"), 0),

    Question("Қытай тарихында 'Алтын ғасыр' деп қай әулеттің кезеңін атайды?",
        listOf("Суй", "Тан", "Сун", "Юань"), 1),

    Question("Қытайда қай әулет кезінде кітап басу мен компас пайда болды?",
        listOf("Сун", "Тан", "Мин", "Цин"), 0),

    Question("Юань әулетінің негізін қалаушы кім?",
        listOf("Құбылай хан", "Чжэн Хэ", "Ли Юань", "Канси"), 0),

    Question("Қай әулет кезінде Қытай Еуропамен дипломатиялық байланыстар орнатты?",
        listOf("Тан", "Сун", "Мин", "Цин"), 2),

    Question("Мин әулетінің императоры Чжу Юаньчжан Қытайды қай жылы басқарды?",
        listOf("1368 ж.", "1421 ж.", "1644 ж.", "1279 ж."), 0),

    Question("Қытайдың монғол билігінен құтылуына себепші болған әулет қайсысы?",
        listOf("Сун", "Мин", "Тан", "Юань"), 1),

    Question("Манчжурлар Қытайда билікті қай жылы өз қолына алды?",
        listOf("1279 ж.", "1368 ж.", "1644 ж.", "1911 ж."), 2),

    Question("Қытай тарихында 'Ақ лотос' ұйымы қандай мақсатта құрылды?",
        listOf("Сауданы дамыту", "Императорды қолдау", "Буддизмді тарату", "Монғол билігіне қарсы күресу"), 3),

    Question("Қытайда 'сегіз уанның бүлігі' қай кезеңде орын алды?",
        listOf("290-306 жж.", "618-626 жж.", "907-960 жж.", "1368-1424 жж."), 0),

    Question("Сун әулеті кезінде Қытайдың негізгі жетістігі қандай болды?",
        listOf("Әскери қуаты артты", "Сауда мен экономика дамыды", "Жібек өндірісі тоқтады", "Шетел басқыншылығы күшейді"), 1),

    Question("Шаруалар көтерілісінің жетекшісі Ли Цзычэн қай жылы Пекинді басып алды?",
        listOf("1368 ж.", "1421 ж.", "1644 ж.", "1911 ж."), 2)
)
val question18 = listOf(
    Question("Тарихнама ғылымы нені зерттейді?",
        listOf("Жаңа технологияларды", "Орта ғасыр әдебиетін", "Тарих ғылымының даму заңдылықтарын", "Географиялық карталарды"), 2),

    Question("Ортағасырлық Азия мен Африка тарихының негізгі дерек көздерінің бірі қайсысы?",
        listOf("Араб деректері", "Грек философиясы", "Қытай поэзиясы", "Еуропа шежірелері"), 0),

    Question("Ортағасырлық араб тарихшыларының еңбектеріне кімдер жатады?",
        listOf("Геродот пен Фукидид", "Ибн Халдун мен Ибн Баттута", "Конфуций мен Лао-цзы", "Марко Поло мен Плано Карпини"), 1),

    Question("Ибн Фадланның еңбектерінде қандай халықтың өмірі сипатталған?",
        listOf("Қытайлар", "Хазарлар", "Римдіктер", "Славяндар"), 1),

    Question("Қытай деректері қандай сипатқа ие?",
        listOf("Мифологиялық", "Әулеттік тарихтар негізінде жазылған", "Діни негіздегі шығармалар", "Поэтикалық аңыздар"), 1),

    Question("Парсы деректерінің негізгі ескерткіші қалай аталады?",
        listOf("Құран", "Авеста", "Ригведа", "Тора"), 1),

    Question("Үнді деректерінің ең маңызды трактаты қайсысы?",
        listOf("Артхашастра", "Бхагавадгита", "Махабхарата", "Трипитака"), 0),

    Question("Орта ғасырдағы түркі деректері қандай еңбектермен танымал?",
        listOf("Манас пен Диван-и Хикмет", "Кутадғу білік пен Түрік шежіресі", "Кодекс Куманикус пен Рамаяна", "Шахнаме мен Илиада"), 1),

    Question("Моңғол деректеріндегі негізгі заң жинағы қалай аталады?",
        listOf("Шыңғыс ханның заңы", "Ұлы жасақ", "Құдіретті қағидалар", "Моңғол ережелері"), 1),

    Question("Ибн Халдун қай салада еңбек етті?",
        listOf("Тарих және әлеуметтану", "Медицина және химия", "Поэзия және музыка", "Астрономия және физика"), 0),

    Question("Ибн Баттута не себепті әйгілі болды?",
        listOf("Әскери жорықтарымен", "Ұлы саяхаттарымен", "Империя басқаруымен", "Заңгерлік қызметімен"), 1),

    Question("Қытайдың ортағасырлық тарихи еңбектерінде қандай деректер кездеседі?",
        listOf("Еуропа халықтары туралы", "Жібек жолы мен көшпенділер туралы", "Скандинавия мифтері", "Араб мәдениеті туралы"), 1),

    Question("Заратуштраның ілімі қай еңбекте жазылған?",
        listOf("Авеста", "Махабхарата", "Құран", "Тора"), 0),

    Question("Орта ғасырдағы Үндістандағы мемлекеттік басқару туралы қандай еңбек мәлімет береді?",
        listOf("Артхашастра", "Ригведа", "Трипитака", "Жеті жарғы"), 0),

    Question("Моңғолдардың алғашқы тарихи шежіресі қалай аталады?",
        listOf("Тайзу тарихы", "Моңғолдың құпия шежіресі", "Шыңғыс хан жылнамасы", "Алтын Орда тарихы"), 1)
)


// 3.9 осы салынбаған
val question19 = listOf(
    Question("XX ғасырдың соңында қай елдер Африкада тәуелсіздік алды?",
        listOf("Намибия, Эритрея", "Алжир, Мысыр", "Оңтүстік Африка, Марокко", "Судан, Ливия"), 0),

    Question("XX ғасырдың соңында Азиядағы ең ірі экономикалық держава қандай ел болды?",
        listOf("Қытай", "Үндістан", "Жапония", "Индонезия"), 0),

    Question("1991 жылы Кеңес Одағы ыдырағаннан кейін Орталық Азияда қанша жаңа мемлекет құрылды?",
        listOf("5", "3", "7", "6"), 0),

    Question("XX ғасырдың соңында Африка елдеріндегі басты саяси мәселе қандай болды?",
        listOf("Этникалық қақтығыстар мен азаматтық соғыстар", "Демократияның күшеюі", "Экономикалық тұрақтылық", "Еуропа елдерімен бірігу"), 0),

    Question("XX ғасырдың соңында Қытай қандай экономикалық реформаларды енгізді?",
        listOf("Ашық нарық және шетелдік инвестицияларды тарту", "Толық коммунизмге көшу", "Барлық өндірісті мемлекеттендіру", "Елді толық оқшаулау"), 0),

    Question("1994 жылы қай елде апартеидтік режим ресми түрде жойылды?",
        listOf("Оңтүстік Африка Республикасы", "Мысыр", "Ангола", "Конго"), 0),

    Question("XX ғасырдың соңында қандай Азия мемлекеті технологиялық дамуда көш бастады?",
        listOf("Жапония", "Қытай", "Үндістан", "Малайзия"), 0),

    Question("2001 жылы құрылған халықаралық ұйым қандай?",
        listOf("Шанхай Ынтымақтастық Ұйымы (ШЫҰ)", "БРИКС", "ОПЕК", "АСЕАН"), 0),

    Question("XX ғасырдың соңында Африка елдерінің экономикасын не әлсіретті?",
        listOf("Саяси тұрақсыздық пен жемқорлық", "АҚШ-тың экономикалық санкциялары", "Батыс елдерінің қолдауы", "Еуропалық Одақпен экономикалық байланыстар"), 0),

    Question("XXI ғасырдың басында қандай Азия елі әлемдегі ең халқы көп ел атанды?",
        listOf("Қытай", "Үндістан", "Индонезия", "Пәкістан"), 0)  ,
    Question2("XX ғасырдың соңында қандай Азия елдері экономикалық дамуда үлкен серпіліс жасады? (Бірнеше жауапты таңдауға болады)" ,
        listOf("Қытай", "Үндістан", "Қазақстан", "Пәкістан"), 0 ,1)
)
val question20 = listOf(
    Question("Қиыр Шығыс елдеріне қай мемлекеттер кіреді?",
        listOf("Қытай, Жапония, Корея", "Үндістан, Пәкістан, Бангладеш", "Иран, Ирак, Сауд Арабиясы", "Франция, Германия, Испания"), 0),

    Question("Бірінші дүниежүзілік соғыстан кейін Жапония қандай саяси бағытты ұстанды?",
        listOf("Агрессиялық экспансия", "Бейтараптық", "Толық оқшаулану", "Коммунистік идеология"), 0),

    Question("Қытайдағы 1911 жылғы Синьхай революциясының нәтижесі қандай болды?",
        listOf("Цин әулеті құлады", "Жапонияның үстемдігі орнады", "Коммунистік билік орнады", "Монархия күшейді"), 0),

    Question("Екінші дүниежүзілік соғыстан кейін Корея қандай жағдайға тап болды?",
        listOf("Солтүстік және Оңтүстік болып бөлінді", "Жапонияның құрамына кірді", "Біртұтас социалистік мемлекетке айналды", "АҚШ-тың отарына айналды"), 0),

    Question("1949 жылы Қытайда қандай маңызды оқиға болды?",
        listOf("Қытай Халық Республикасы құрылды", "Қытай Жапонияға бағынды", "Цинь әулеті билікке келді", "Коммунистік билік жойылды"), 0),

    Question("Жапонияның экономикалық өрлеуі қай кезеңде басталды?",
        listOf("1950-1960 жылдары", "1920-1930 жылдары", "1990-2000 жылдары", "1910-1920 жылдары"), 0),

    Question("Мао Цзэдунның Қытайда жүргізген саясаты қалай аталды?",
        listOf("Үлкен секіріс", "Жаңа бағыт", "Реформалар кезеңі", "Бейтараптық саясаты"), 0),

    Question("Корея соғысы қай жылдары болды?",
        listOf("1950-1953", "1945-1949", "1960-1965", "1939-1945"), 0),

    Question("Жапония Екінші дүниежүзілік соғыста қай мемлекеттермен соғысты?",
        listOf("АҚШ, Қытай, КСРО", "Германия, Италия", "Франция, Ұлыбритания", "Үндістан, Канада"), 0),

    Question("Қытайдағы мәдени революцияның негізгі мақсаты қандай болды?",
        listOf("Коммунистік идеологияны күшейту", "Экономиканы реформалау", "Демократиялық өзгерістер", "АҚШ-пен қарым-қатынасты жақсарту"), 0),

    Question("Жапониядағы 1947 жылғы жаңа Конституция қандай негізгі қағиданы енгізді?",
        listOf("Соғыс жүргізуге тыйым салу", "Коммунистік билік орнату", "Император билігін күшейту", "Қатаң әскери тәртіп орнату"), 0),

    Question("1978 жылы Қытайда қандай маңызды экономикалық өзгеріс болды?",
        listOf("Реформалар мен ашықтық саясаты енгізілді", "Мао Цзэдун билікке қайта келді", "Коммунизм жойылды", "Қытай экономикасы толығымен мемлекеттік бақылауға өтті"), 0),

    Question("Жапония қандай халықаралық ұйымның мүшесі болып табылады?",
        listOf("БҰҰ", "Варшава шарты ұйымы", "Араб мемлекеттері лигасы", "ОПЕК"), 0),

    Question("Қытайдағы Тяньаньмэнь оқиғасы қай жылы болды?",
        listOf("1989", "1956", "1975", "1999"), 0),

    Question("Қазіргі Қытай экономикасының негізі неге сүйенеді?",
        listOf("Мемлекеттік капитализм", "Толық коммунизм", "Феодалдық құрылым", "Тек ауыл шаруашылығы"), 0)
)


// буны тастадым
val question21 = listOf(
    Question("Қай ел Африкада бірінші болып тәуелсіздігін алды?", listOf("Алжир", "Гана", "Египет", "Марокко"), 1),

            Question("XVII-XIX ғасырларда Үндістанда қандай ірі билік жүргізуші әулет болды?", listOf("Моғолдар", "Сефевидтер", "Османдар", "Циндер"), 0),

Question("Қытайда 1644-1912 жылдары билік құрған әулет қалай аталады?", listOf("Юань", "Мин", "Цин", "Сун"), 2),

Question("Осман империясында XVII-XIX ғасырларда негізгі әскери күш қалай аталды?", listOf("Самурайлар", "Жаңа шеріктер", "Легиондар", "Қарулы рыцарьлар"), 1),

Question("Иранда XVII-XIX ғасырларда билік еткен әулет қалай аталады?", listOf("Қаджарлар", "Сефевидтер", "Османдар", "Моғолдар"), 0),

Question("Азия мен Африкадағы капиталистік қатынастар қандай елдердің әсерімен дамыды?", listOf("Франция мен Германия", "АҚШ пен Жапония", "Ұлыбритания мен Франция", "Ресей мен Қытай"), 2),

Question("XVII-XIX ғасырларда Қытайда қандай шаруашылық саласы басым болды?", listOf("Өнеркәсіп", "Қолөнер", "Ауыл шаруашылығы", "Сауда"), 2),

Question("Африка елдерінің тәуелсіздік алу кезеңі қай жылдары белсенді жүрді?", listOf("1900-1920", "1920-1945", "1950-1980", "1980-2000"), 2),

Question("Үндістанда Британдық білім беру жүйесі енгізілгеннен кейін қай ғылым салалары дамыды?", listOf("Астрономия мен математика", "Биология мен медицина", "Физика мен химия", "Тарих пен философия"), 0),

Question("Қытайда XIX ғасырда «Батыс жел» саясаты не үшін енгізілді?", listOf("Әскерді нығайту", "Батыс ғылымы мен техникасын енгізу", "Жергілікті өндірісті жою", "Дәстүрлі мәдениетті қорғау"), 1),

Question("Осман империясы XVIII ғасырда қай елдермен ұзақ соғыс жүргізді?", listOf("Ресей мен Австрия", "Франция мен Германия", "Италия мен Испания", "Иран мен Қытай"), 0),

Question("Иранда XVII-XIX ғасырларда қандай өндіріс дамыды?", listOf("Мақта-мата өндірісі", "Кеме жасау", "Металлургия", "Мұнай өндіру"), 3),

Question("Азия мен Африкадағы отаршылдық саясаттың негізгі мақсаты қандай болды?", listOf("Жергілікті мәдениетті сақтау", "Экономикалық ресурстарды игеру", "Жергілікті халықты дамыту", "Тәуелсіз мемлекеттер құру"), 1),

Question("Трансұлттық корпорациялар Азия мен Африка елдеріне қалай әсер етті?", listOf("Олардың мәдени дамуын тежеді", "Экономикалық құрылымын өзгертті", "Жаңа мемлекеттер құрды", "Тәуелсіздік қозғалыстарын қолдады"), 1),

Question("Қазіргі Азия мен Африка елдеріндегі басты экономикалық мәселе қандай?", listOf("Өнеркәсіптің артық дамуы", "Технологиялық даму", "Экономикалық тұрақсыздық", "Халық санының азаюы"), 2),
)

val question22 = listOf(
    Question("XVII ғасырда Осман империясының басты қарсыластары кімдер болды?",
        listOf("Австрия мен Ресей", "Қытай мен Жапония", "Франция мен Испания", "Иран мен Үндістан"), 0),

    Question("1699 жылғы Карловиц келісімі бойынша Осман империясы қандай жерлерінен айырылды?",
        listOf("Венгрия, Трансильвания, Хорватия", "Сирия мен Ливан", "Египет пен Ливия", "Балқан түбегінің барлық аймақтары"), 0),

    Question("Осман империясында XVIII ғасырда қандай реформалар жүргізілді?",
        listOf("Әскери және әкімшілік реформалар", "Білім беру реформасы", "Экономикалық реформа", "Діни реформа"), 0),

    Question("Осман империясының XVIII ғасырдағы ең әлсіз тұсы қандай болды?",
        listOf("Экономикалық дағдарыс", "Әскери күштің әлсіреуі", "Еуропа державаларының қысымы", "Барлығы дұрыс"), 3),

    Question("1736-1739 жылдары Осман империясы қай елдермен соғыс жүргізді?",
        listOf("Ресей мен Австрия", "Франция мен Англия", "Иран мен Үндістан", "Қытай мен Жапония"), 0),

    Question("Осман империясының XVIII ғасырдағы ең ірі әскери жеңілісі қандай болды?",
        listOf("Вена түбіндегі шайқас", "Наварин теңіз шайқасы", "Прут шайқасы", "Карловиц келісімі"), 1),

    Question("1774 жылғы Кучук-Кайнарджи келісімі Осман империясы үшін қандай нәтижелерге алып келді?",
        listOf("Қара теңіздегі ықпалынан айырылды", "Иранмен соғысты тоқтатты", "Англиямен сауда келісіміне қол қойды", "Франциямен одақ құрды"), 0),

    Question("XIX ғасырда жүргізілген Танзимат реформаларының негізгі мақсаты қандай?",
        listOf("Мемлекеттік басқаруды жаңарту", "Әскери күшті әлсірету", "Империяны бөлшектеу", "Еуропадан оқшаулану"), 0),

    Question("Танзимат реформаларының маңызды бөлігі қандай өзгерістерді қамтыды?",
        listOf("Құқықтық жүйенің өзгеруі", "Жаңа әскери тәртіп", "Салық реформасы", "Барлығы дұрыс"), 3),

    Question("XIX ғасырда Осман империясына қандай мемлекеттер қатты ықпал етті?",
        listOf("Англия мен Франция", "Қытай мен Жапония", "Испания мен Португалия", "АҚШ пен Германия"), 0),

    Question("1839-1876 жылдардағы реформалар қалай аталады?",
        listOf("Танзимат реформалары", "Миллет жүйесі", "Селимдік жаңартулар", "Қайта өрлеу реформалары"), 0),

    Question("XIX ғасырдың ортасында Осман империясында қандай әлеуметтік өзгерістер болды?",
        listOf("Жаңа мектептер ашылды", "Жаңа салық жүйесі енгізілді", "Әкімшілік құрылым реформаланды", "Барлығы дұрыс"), 3),

    Question("1876 жылы қабылданған алғашқы Осман конституциясы не нәрсені қамтамасыз етті?",
        listOf("Мемлекеттік билікті шектеу", "Сұлтан билігінің күшеюі", "Шариғат заңдарының күшеюі", "Еуропамен одақтастықты"), 0),

    Question("XIX ғасырдағы ең үлкен ұлттық қозғалыстар қай аймақтарда болды?",
        listOf("Балқан түбегі", "Анадолы", "Солтүстік Африка", "Месопотамия"), 0),

    Question("Осман империясының XIX ғасырдың соңына қарай әлсіреуінің негізгі себебі қандай?",
        listOf("Ішкі көтерілістер мен сыртқы қысым", "Сұлтан билігінің күшеюі", "Еуропа елдерімен тығыз қарым-қатынас", "Экономикалық тұрақтылық"), 0)
)

val question23 = listOf(
    Question("Сефевидтер әулетінің негізін қалаушы кім?",
        listOf("Аббас I", "Исмаил I", "Надир шах", "Фатх Али шах"), 1),

    Question("Ирандағы Сефевидтер мемлекетінің астанасы қай қала болды?",
        listOf("Тегеран", "Исфахан", "Шираз", "Мешхед"), 1),

    Question("XVII ғасырда Иранның басты сыртқы саяси қарсыластары кімдер болды?",
        listOf("Осман империясы мен Ресей", "Қытай мен Жапония", "Франция мен Англия", "Үндістан мен Ауғанстан"), 0),

    Question("1719-1747 жылдары Иранда билік құрған Надир шах қандай реформалар жүргізді?",
        listOf("Әскери реформалар", "Білім беру реформалары", "Аграрлық реформалар", "Салық реформалары"), 0),

    Question("XVIII ғасырда Иранға қандай елдің ықпалы күшейді?",
        listOf("Ресей", "Франция", "Ұлыбритания", "Қытай"), 2),

    Question("1779 жылы билікке келген әулет қалай аталды?",
        listOf("Сефевидтер", "Қаджарлар", "Саманидтер", "Газнауидтер"), 1),

    Question("Қаджар әулетінің алғашқы билеушісі кім болды?",
        listOf("Фатх Али шах", "Ага Мохаммед хан", "Надир шах", "Аббас Мирза"), 1),

    Question("XIX ғасырда Иран Ресеймен қандай келісімдер жасасты?",
        listOf("Гүлстан және Түркманчай келісімдері", "Нанкин келісімі", "Берлин келісімі", "Ташкент келісімі"), 0),

    Question("Түркманчай келісімінің негізгі нәтижесі қандай болды?",
        listOf("Иран Ресейге жерлерін берді", "Иран толық тәуелсіздік алды", "Иран Франциямен одақтасты", "Иран Қытайға тәуелді болды"), 0),

    Question("Иран XIX ғасырда экономикалық тұрғыдан қандай қиындықтарға тап болды?",
        listOf("Еуропалық державалардың экономикалық қысымы", "Ішкі көтерілістер", "Ауыл шаруашылығының құлдырауы", "Барлығы дұрыс"), 3),

    Question("Фатх Али шах қай жылы билікке келді?",
        listOf("1797", "1813", "1828", "1850"), 0),

    Question("1850 жылдары Иранда қандай маңызды оқиғалар болды?",
        listOf("Бабизм көтерілісі", "Англиямен соғыс", "Қытаймен келісім", "Парсы-Осман соғысы"), 0),

    Question("XIX ғасырда Иранның экономикалық жағдайына қандай елдер көп әсер етті?",
        listOf("Франция мен Германия", "Англия мен Ресей", "Қытай мен Жапония", "АҚШ пен Осман империясы"), 1),

    Question("XIX ғасырдың соңында Иранда қандай реформалар жасалды?",
        listOf("Конституциялық реформа", "Әскери реформа", "Білім реформасы", "Діни реформа"), 0),

    Question("Ирандағы 1905-1911 жылдардағы революция қалай аталады?",
        listOf("Конституциялық революция", "Ислам революциясы", "Бабизм көтерілісі", "Ұлттық қозғалыс"), 0)
)

val question24 = listOf(
    Question("Ұлы Моғол мемлекетінің негізін қалаған кім?", listOf("Бабыр", "Акбар", "Шах Жахан", "Аурангзеб"), 0),

            Question("1526 жылы Панипат түбіндегі шайқаста кім жеңіске жетті?", listOf("Бабыр", "Иран билеушісі", "Маратха мемлекеті", "Ағылшындар"), 0),

Question("XVIII ғасырда Ұлы Моғол мемлекетінің әлсіреуіне не себеп болды?", listOf("Еуропалықтардың басып кіруі", "Ішкі қақтығыстар", "Салық ауыртпалығы", "Барлығы дұрыс"), 3),

Question("1739 жылы Делиге шабуыл жасаған Иран билеушісі кім?", listOf("Надир шах", "Ахмед-шах Дуррани", "Аурангзеб", "Роберт Клайв"), 0),

Question("Ұлы Моғол империясының соңғы билеушісі кім болды?", listOf("Бахадур шах II", "Акбар", "Шах Жахан", "Аурангзеб"), 0),

Question("Ост-Индия компаниясы Үндістанды қай жылы толықтай жаулап алды?", listOf("1849", "1757", "1813", "1857"), 0),

Question("1857-1859 жылдардағы Үндістандағы халықтық көтеріліс қалай аталады?", listOf("Сепай көтерілісі", "Маратха соғысы", "Ауған шапқыншылығы", "Сикх көтерілісі"), 0),

Question("Сепайлар көтерілісінің негізгі себептерінің бірі?", listOf("Жаңа ант қабылдау", "Ағылшын тілі енгізілуі", "Темір жолдардың салынуы", "Еуропалық идеялардың таралуы"), 0),

Question("Сепайлар көтерілісінен кейін билік кімнің қолына өтті?", listOf("Ұлыбритания үкіметі", "Ост-Индия компаниясы", "Моғол билеушілері", "Франция"), 0),

Question("1876 жылы Виктория ханшайымы қандай атаққа ие болды?", listOf("Үндістан императрицасы", "Королева ана", "Британ королевасы", "Ұлы хан"), 0),

Question("1885 жылы құрылған саяси ұйым қалай аталды?", listOf("Үнді ұлттық конгресі", "Свадеши қозғалысы", "Сикх одағы", "Маратха кеңесі"), 0),

Question("ХІХ ғасырда енгізілген 'Свадеши' қозғалысының негізгі мақсаты қандай?", listOf("Ұлттық экономиканы қолдау", "Сепайларды күшейту", "Британ билігін қолдау", "Еуропалық мәдениетті енгізу"), 0),

Question("Дадабхаи Наорожи кім болған?", listOf("Үнді ұлттық конгресінің негізін қалаушы", "Ауған билеушісі", "Сикх мемлекетінің негізін қалаушы", "Британ губернаторы"), 0),

Question("Б.Тилак пен Р.Тагор қандай қозғалысқа қатысқан?", listOf("Үндістанның тәуелсіздік қозғалысы", "Маратха көтерілісі", "Сикх мемлекетінің құрылуы", "Ағылшын-үнді соғысы"), 0),

Question("1857 жылғы Сепай көтерілісінің басты тарихи маңызы қандай?", listOf("Үндістан Ұлыбританияның тікелей билігіне өтті", "Ұлы Моғолдар билігі күшейді", "Ост-Индия компаниясының күші артты", "Франция Үндістанды жаулап алды"), 0)
)

val question25 = listOf(
    Question("Қытайда Цин әулеті қашан билікке келді?",
        listOf("1368 жылы", "1644 жылы", "1840 жылы", "1911 жылы"), 1),

    Question("Қытайдағы 1840-1842 жылдардағы соғыс қалай аталды?",
        listOf("Жүз жылдық соғыс", "Апиын соғысы", "Сегіз ұлттың интервенциясы", "Синьхай революциясы"), 1),

    Question("Қытай мен Англия арасындағы алғашқы Апиын соғысы немен аяқталды?",
        listOf("Қытайдың жеңісі", "Тяньцзинь келісімі", "Нанкин келісімі", "Англияның шегінуімен"), 2),

    Question("Нанкин келісімі бойынша Қытай қай жерді Ұлыбританияға берді?",
        listOf("Тайвань", "Гонконг", "Макао", "Шанхай"), 1),

    Question("Қытайда 1850-1864 жылдары қандай көтеріліс болды?",
        listOf("Синьхай революциясы", "Тайпиндер көтерілісі", "Мэйдзи реформасы", "Боксшылар көтерілісі"), 1),

    Question("1899-1901 жылдары Қытайда болған 'Ихэтуандар көтерілісі' басқа атаумен қалай белгілі?",
        listOf("Тайпиндер көтерілісі", "Боксшылар көтерілісі", "Сунь Ятсен көтерілісі", "Моңғол шапқыншылығы"), 1),

    Question("Қытайда қай жылы Синьхай революциясы болды?",
        listOf("1898 жылы", "1905 жылы", "1911 жылы", "1927 жылы"), 2),

    Question("Қытайдағы Синьхай революциясының нәтижесі қандай болды?",
        listOf("Коммунистік билік орнады", "Цин әулеті құлатылды", "Қытай Ұлыбританияның отарына айналды", "Қытай демократиялық республикаға айналды"), 1),

    Question("Қытай Республикасының бірінші президенті кім болды?",
        listOf("Мау Зэдун", "Юань Шикай", "Сунь Ятсен", "Чан Кайши"), 2),

    Question("Қытайдағы 'ашық есік' саясатын қай ел енгізді?",
        listOf("Ресей", "АҚШ", "Жапония", "Франция"), 1),

    Question("Қытайда бірінші Апиын соғысы қай жылдары өтті?",
        listOf("1793-1795 жж.", "1839-1842 жж.", "1856-1860 жж.", "1870-1875 жж."), 1),

    Question("Қытайда Цин империясының әлсіреуінің негізгі себебі қандай болды?",
        listOf("Экономикалық құлдырау", "Еуропалық елдердің араласуы", "Феодалдық құрылымның әлсіздігі", "Барлығы дұрыс"), 3),

    Question("Қытайдағы Боксшылар көтерілісінің негізгі мақсаты қандай болды?",
        listOf("Феодалдық құрылымды күшейту", "Шетелдіктерді елден қуу", "Қытайдың Жапонияға қосылуы", "Коммунистік билік орнату"), 1),

    Question("Цин әулеті билігін қай жылы аяқтады?",
        listOf("1840 жылы", "1895 жылы", "1911 жылы", "1927 жылы"), 2),

    Question("Сунь Ятсен ұсынған негізгі үш халықтық принцип қандай болды?",
        listOf("Ұлттық тәуелсіздік, демократия, халық игілігі", "Коммунизм, социализм, индустрияландыру",
            "Феодализм, патшалық билік, реформалар", "Конфуций ілімі, буддизм, даосизм"), 0)
)
val question26 =  listOf(
    Question("Жаңа заманда Шығыс елдерінің басты ерекшелігі қандай болды?",
        listOf("Толық тәуелсіздікке қол жеткізді", "Батыс елдерінің ықпалы артты",
            "Экономикалық дамуы бәсеңдеді", "Феодалдық құрылыс күшейді"), 1),

    Question("Қытайдағы 19 ғасырдың маңызды оқиғасы қандай?",
        listOf("Жапониямен соғыс", "Синьхай революциясы",
            "Апиын соғыстары", "Моңғолиямен қақтығыс"), 2),

    Question("1853 жылы АҚШ әскери кемелері қай елдің шекарасына келіп, ашық сауда жасауға мәжбүрледі?",
        listOf("Қытай", "Корея", "Жапония", "Вьетнам"), 2),

    Question("Шығыс елдеріндегі ең ірі отаршыл мемлекеттер кімдер болды?",
        listOf("Германия, Ресей", "Ұлыбритания, Франция",
            "Түркия, Иран", "Қытай, Жапония"), 1),

    Question("1868 жылғы Мэйдзи реформалары қай елде өтті?",
        listOf("Қытай", "Үндістан", "Жапония", "Корея"), 2),

    Question("Үндістанда 1857-1859 жылдардағы көтерілісті кім басқарды?",
        listOf("Махатма Ганди", "Джавахарлал Неру",
            "Нана Сахиб", "Далай Лама"), 2),

    Question("Қай елдер 19 ғасырда Қытайды ықпал ету аймақтарына бөлді?",
        listOf("Тек Ұлыбритания мен Франция", "АҚШ, Германия, Ресей, Жапония",
            "Түркия мен Иран", "Италия мен Испания"), 1),

    Question("Жаңа заманда Жапония қандай саясат жүргізді?",
        listOf("Толық оқшаулану", "Батыстық үлгіде жаңғырту",
            "Коммунистік реформалар", "Аграрлық даму"), 1),

    Question("Қай жылы Қытайда Синьхай революциясы болды?",
        listOf("1905 жыл", "1911 жыл", "1923 жыл", "1899 жыл"), 1),

    Question("Үндістан қай жылы Ұлыбританиядан тәуелсіздік алды?",
        listOf("1939 жыл", "1945 жыл", "1947 жыл", "1956 жыл"), 2),

    Question("Түркиядағы 19 ғасырдағы реформалар қалай аталды?",
        listOf("Мэйдзи реформалары", "Танзимат реформалары",
            "Синьхай революциясы", "Жас түріктер қозғалысы"), 1),

    Question("Қытайда Апиын соғыстары қай елмен өтті?",
        listOf("Жапония", "АҚШ", "Франция", "Ұлыбритания"), 3),

    Question("19 ғасырдың аяғында Жапония қай елге соғыс жариялады?",
        listOf("Қытай", "Корея", "Үндістан", "Моңғолия"), 0),

    Question("Шығыс елдерінде 19 ғасырда қандай өзгерістер болды?",
        listOf("Феодалдық құрылыс нығайды", "Еуропалық ықпал артты",
            "Толық тәуелсіздік орнады", "Экономика әлсіреді"), 1),

    Question("1869 жылы ашылған Суэц каналы қай материктерді байланыстырды?",
        listOf("Еуропа мен Азия", "Азия мен Америка",
            "Африка мен Еуропа", "Африка мен Азия"), 3)
)

val question27 = listOf(
    Question("Жаңа замандағы Азия мен Африка елдеріндегі басты отарлаушы мемлекеттер?",
        listOf("Германия, АҚШ", "Ұлыбритания, Франция", "Қытай, Жапония", "Ресей, Осман империясы"), 1),

    Question("Жапониядағы Мэйдзи реформаларының негізгі мақсаты қандай болды?",
        listOf("Феодалдық құрылысты күшейту", "Елді индустрияландыру және батыстық үлгіде жаңғырту",
            "Еуропалық елдерге бағынышты болу", "Аграрлық шаруашылыққа басымдық беру"), 1),

    Question("Қай жылы Үндістан Ұлыбританиядан тәуелсіздігін алды?",
        listOf("1918 жыл", "1947 жыл", "1956 жыл", "1965 жыл"), 1),

    Question("Қытайда 19 ғасырдың ортасында болған 'Апиын соғыстарының' себебі неде?",
        listOf("Жібек саудасына байланысты дау", "Англияның Қытайға апиын әкелуі",
            "Діни қақтығыстар", "Тибетке қатысты жанжал"), 1),

    Question("Осман империясының ыдырауына қандай негізгі себептер әсер етті?",
        listOf("Батыс елдерінің шабуылы", "Ішкі көтерілістер мен экономикалық дағдарыс",
            "Халық санының көбеюі", "Еуропа елдерімен тығыз байланыстар"), 1),

    Question("Африкадағы отаршылдық саясаттың салдары қандай болды?",
        listOf("Экономикалық және мәдени дамудың жеделдеуі", "Африка елдерінің саяси және экономикалық тәуелділігі",
            "Африка елдерінің толық тәуелсіздікке жетуі", "Бейбіт келісімдердің нығаюы"), 1),

    Question("Жапонияның Қытайға шабуыл жасаған жылы:",
        listOf("1905 жыл", "1931 жыл", "1945 жыл", "1895 жыл"), 1),

    Question("Мұсылман елдерінде 19 ғасырда қандай реформа қозғалыстары кең тарады?",
        listOf("Исламды қайта жаңғырту", "Капиталистік дамуды тежейтін қозғалыстар",
            "Батыс елдерімен жақындасу саясатынан бас тарту", "Буддизмді тарату"), 0),

    Question("Қай ел Африкадағы ең ірі отарлық держава болды?",
        listOf("Португалия", "Франция", "Германия", "Ұлыбритания"), 3),

    Question("Жаңа замандағы Азия мен Африка елдерінің отаршылдыққа қарсы күресінің нәтижесі қандай болды?",
        listOf("Барлық елдер тез арада тәуелсіздік алды", "Ұлт-азаттық қозғалыстар күшейді және тәуелсіздікке қол жеткізілді",
            "Көтерілістер тез басылып тасталды", "Барлық елдер Еуропа мемлекеттеріне қосылды"), 1),

    Question("1857-1859 жылдары Үндістандағы ұлт-азаттық көтерілісті кім басқарды?",
        listOf("Махатма Ганди", "Нана Сахиб", "Джахангир", "Шиваджи"), 1),

    Question("19 ғасырдың соңында Африканың толық отарланбаған елдері қайсы?",
        listOf("Египет пен Алжир", "Либерия мен Эфиопия", "Конго мен Марокко", "Оңтүстік Африка мен Судан"), 1),

    Question("1911 жылы Қытайда қандай маңызды оқиға орын алды?",
        listOf("Жапониямен соғыс", "Синьхай революциясы", "Коммунистік қозғалыстың басталуы", "Ұлы қорғанды салу аяқталды"), 1),

    Question("Суэц каналы қай жылы ашылды?",
        listOf("1855 жыл", "1869 жыл", "1888 жыл", "1901 жыл"), 1),

    Question("'Босап шыққан мемлекеттер' деген ұғым қай кезеңде пайда болды?",
        listOf("19 ғасырдың ортасында", "20 ғасырдың екінші жартысында", "Бірінші дүниежүзілік соғыс кезінде", "18 ғасырда"), 1)
)


@Composable
fun QuizScreen() {
    val questions = remember {
        when (Whichquiz.level) {
            1 -> question1
            2 -> question2
            3 -> question3
            4 -> question4
            5 -> question5
            6 -> question6
            7 -> question7
            8 -> question8
            9 -> question9
            10 -> question10
            11 -> question11
            12 -> question12
            13 -> question13
            14 -> question14
            15 -> question15
            16 -> question16
            17 -> question17
            18 -> question18
            19 -> question19
            20 -> question20
            21 -> question21
            22 -> question22
            23 -> question23
            24 -> question24
            25 -> question25
            26 -> question26
            27 -> question27
            else -> question1
        }
    }

    var currentQuestionIndex by remember { mutableStateOf(0) }
    var selectedOptions by remember { mutableStateOf(setOf<Int>()) } // Для множественного выбора
    var score by remember { mutableStateOf(0) }
    var showResult by remember { mutableStateOf(false) }
    var incorrectQuestions by remember { mutableStateOf(listOf<Int>()) }

    if (showResult) {
        Column(
            modifier = Modifier
                .fillMaxSize()
                .verticalScroll(rememberScrollState())
                .padding(top= 90.dp  , bottom = 170.dp),
            verticalArrangement = Arrangement.Center,
            horizontalAlignment = Alignment.CenterHorizontally
        ) {
            Text(
                text = "Сіздің нәтижеңіз: $score/${questions.size}",
                style = MaterialTheme.typography.headlineMedium
                , fontFamily = FontFamily(Font(R.font.forum))
            )

            if (incorrectQuestions.isNotEmpty()) {
                Text(
                    text = "Қателескен сұрақтар:",
                    style = MaterialTheme.typography.headlineSmall,
                    modifier = Modifier.padding(top = 100.dp , bottom= 170.dp)   ,
                    color=Color.White
                    , fontFamily = FontFamily(Font(R.font.forum))
                )
                incorrectQuestions.forEach { index ->
                    val question = questions[index]
                    Text(text = "Сұрақ: ${question.text}" , color= Color.White)
                    when (question) {
                        is Question -> Text(text = "Дұрыс жауап: ${question.options[question.correctAnswerIndex]}" , color= Color.White ,  fontFamily = FontFamily(Font(R.font.forum)))
                        is Question2 -> Text(text = "Дұрыс жауаптар: ${question.options[question.correctAnswerIndex]} и ${question.options[question.correctAnswerIndex2]}" , color=Color.White , fontFamily = FontFamily(Font(R.font.forum)))
                    }
                    Spacer(modifier = Modifier.height(8.dp))
                }
            }

            Button(
                onClick = {
                    currentQuestionIndex = 0
                    score = 0
                    selectedOptions = emptySet()
                    showResult = false
                    incorrectQuestions = listOf()
                },
                modifier = Modifier.padding(top = 16.dp)
            ) {
                Text("Қайта өту" , fontFamily = FontFamily(Font(R.font.forum)))
            }
        }
    } else {
        val question = questions[currentQuestionIndex]

        Column(
            modifier = Modifier
                .fillMaxSize()
                .verticalScroll(rememberScrollState()) // Добавляем прокрутку
                .padding(top = 100.dp , bottom = 170.dp),
            horizontalAlignment = Alignment.CenterHorizontally
        ) {
            Card(
                colors = CardDefaults.cardColors(containerColor = Color.Transparent) ,
                border = BorderStroke(1.dp , color = Color.White)
            ){
                Text(
                    text = question.text,
                    style = MaterialTheme.typography.headlineMedium,
                    modifier = Modifier.padding(bottom = 8.dp) ,
                    color =Color.White
                    , fontFamily = FontFamily(Font(R.font.forum))
                )
            }


            question.options.forEachIndexed { index, option ->
                Row(
                    verticalAlignment = Alignment.CenterVertically,
                    modifier = Modifier
                        .fillMaxWidth()
                        .clickable {
                            selectedOptions = if (selectedOptions.contains(index)) {
                                selectedOptions - index
                            } else {
                                selectedOptions + index
                            }
                        }
                        .padding(vertical = 8.dp)
                ) {
                    if (question is Question2) {
                        Checkbox(
                            checked = selectedOptions.contains(index),
                            onCheckedChange = {
                                selectedOptions = if (selectedOptions.contains(index)) {
                                    selectedOptions - index
                                } else {
                                    selectedOptions + index
                                }
                            }
                        )
                    } else {
                        RadioButton(
                            selected = selectedOptions.contains(index),
                            onClick = {
                                selectedOptions = setOf(index)
                            }
                        )
                    }
                    Text(text = option, modifier = Modifier.padding(start = 8.dp) , color= Color.White)
                }
            }

            Spacer(modifier = Modifier.weight(1f)) // Кнопка "Далее" опускается вниз

            Button(
                onClick = {
                    val isCorrect = when (question) {
                        is Question -> selectedOptions == setOf(question.correctAnswerIndex)
                        is Question2 -> selectedOptions.contains(question.correctAnswerIndex) &&
                                selectedOptions.contains(question.correctAnswerIndex2) &&
                                selectedOptions.size == 2
                        else -> false
                    }

                    if (isCorrect) {
                        score++
                    } else {
                        incorrectQuestions = incorrectQuestions + currentQuestionIndex
                    }

                    selectedOptions = emptySet()
                    if (currentQuestionIndex < questions.size - 1) {
                        currentQuestionIndex++
                    } else {
                        showResult = true
                    }
                },
                modifier = Modifier.fillMaxWidth()
            ) {
                Text("Келесі"  ,  fontFamily = FontFamily(Font(R.font.forum)))
            }
        }
    }
}



@Preview(showBackground = true)
@Composable
fun PreviewQuizScreen() {
    QuizScreen()
}